{"title":"Der.Untergang.xvid.ac3.SHEITAN.","uid":3900744,"size":1466401905,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:003fe2806c2cdf310ac376830f1873d68d0951b5&amp;dn=Der.Untergang.xvid.ac3.SHEITAN.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"timant1","files":5,"time":1195556464,"description":"Downfall (German: Der Untergang) is a 2004 German / Austrian film depicting the final ten days of Adolf Hitler in his Berlin bunker and Nazi Germany in 1945, written by Bernd Eichinger, directed by Oliver Hirschbiegel, and based upon the books Inside Hitler&amp;#039;s Bunker, by historian Joachim Fest, portions of Albert Speer&amp;#039;s memoirs, the memoirs of Traudl Junge, Hitler&amp;#039;s secretary, and the memoirs of Siegfried Knappe.\n\nIn the last days of the European fighting in World War II, the Red Army is reaching Berlin, while in the FÃƒÂ¼hrerbunker under the Reich Chancellery, Adolf Hitler has his last birthday and final ten days of life isolated from the world and ordering desperate counterattacks. Hitler (Bruno Ganz) is a sick, exhausted man dreaming still of a Greater Germany amid the ruins of Berlin, callously ranting against the weakness and deserved destruction of the Germans. As the Red Army and defeat loom over the Third Reich, he is alone with his clique: Joseph Goebbels (Ulrich Matthes), Albert Speer (Heino Ferch), and SS leader Heinrich Himmler\n\nVIDEO\nXVID\nPAL\n16:9\n25 FPS\nDuration: 2:29,44\nAUDIO\nAC3 192 kb/s\nSIZE\n1,36 Gt\nSUBS\nSvenska, Norske, Danske, Suomi and English (all tested and working)\n\nEnjoy!\nPlease keep seeding at least 24h. Then more people will be able to download and I will be able to release more! win-win situation.","torrent":{"xt":"urn:btih:003fe2806c2cdf310ac376830f1873d68d0951b5","amp;dn":"Der.Untergang.xvid.ac3.SHEITAN.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"003fe2806c2cdf310ac376830f1873d68d0951b5","infoHashBuffer":{"type":"Buffer","data":[0,63,226,128,108,44,223,49,10,195,118,131,15,24,115,214,141,9,81,181]},"announce":[],"urlList":[]}}