{"title":"Brian Eno_vocals_cd3_FLAC (Lossless)","uid":3937906,"size":461567398,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00f79b573a108e7f9d0df73b5e0207cf32cda0e3&amp;dn=Brian+Eno_vocals_cd3_FLAC+%28Lossless%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chipboard","files":21,"time":1197942540,"description":"Brian Eno Box 2 - Vocals.\n\nTHIS TORRENT IS THE WHOLE OF CD3 PLUS 1 TRACK FROM DISC 1\n\nThis box set is a deluxe masterpiece in its creation. It starts off as a box that has a box within it that slides out the open side and inside the middle box there are the 3 cds and a booklet. \nThe discs are a complete overview of Brian Enos\\&amp;#039; vocal music. The first disc contains the first 2 solo albums he made. It is refreshing to have them both together vurtually untouched(i say vurtually because I dont even know what they omitted to fit them on together).\nThe second disc contains the bulk of Another Green World and Before and After Science. Both Classics in my book. The last disc is the treasure for most people probably have the first 4 albums. The first discs only throw hints of having rare tracks with only a couple per cd. The 3rd disc which has not only Enos projects for outside artists represented but it also contains the unfinshed album of pop songs called My Squelchy Life. As far as i can tell he hasnt made anything like those early vocal albums since he worked on this album back in 91. Consequently the disc is very valuable and with the deluxe packaging of the box it makes a terrific box set.","torrent":{"xt":"urn:btih:00f79b573a108e7f9d0df73b5e0207cf32cda0e3","amp;dn":"Brian+Eno_vocals_cd3_FLAC+%28Lossless%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00f79b573a108e7f9d0df73b5e0207cf32cda0e3","infoHashBuffer":{"type":"Buffer","data":[0,247,155,87,58,16,142,127,157,13,247,59,94,2,7,207,50,205,160,227]},"announce":[],"urlList":[]}}