{"title":"MARTIN GARCIA - JOURNEY - METRO 95.1 FM - 21-12-2007","uid":3946171,"size":170572893,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0240dc7faffb1c167c275b17e408bd19f3f9fede&amp;dn=MARTIN+GARCIA+-+JOURNEY+-+METRO+95.1+FM+-+21-12-2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nowixs","files":1,"time":1198494683,"description":"Unfolding his double side of both DJ and producer, Martin Garcia&amp;#039;s path draws along the electronic music local map a rising line that goes beyond its limits to burst into the international circle. His career, based on talent and hard work, led him both to share the decks with figures of the importance of Sasha, Danny Howells, Lexicon Avenue and John Creamer and to sign contracts with Perfecto Records, taking part of a consistent production duet with Hernan Cattaneo. Precisely, one of the reasons why his name stands out in the vernacular scene is the combining with equal success his work in the booth and in the studio. \n\nSince his beginnings as a professional DJ, Martin covered the big club circuit of Buenos Aires (Puente Mitre, La Embajada, Odeon) creating an interesting sound exploration. Taking characters of the rank of Sasha or John Digweed as referents, he evolved artistically through the years at the pace of the musical trends and new styles coming from the UK, adapting and incorporating them. Already considered a classic, his sets at the Clubland booth (Saturdays@Pacha Buenos Aires) allowed him to establish a close tie with the most demanding audience and test his flair at international level parties and festivals of the size of Creamfields, where he was an important feature in all its editions in Buenos Aires. Also at international height, he played in Peru, Brazil, Chile, Uruguay and Colombia where he performed alongside the well known DJ Sasha. \n\nOn the other hand, since the launching of Deep Funk -the track that was included in the Nu Breed by Sander Kleinenberg edited by Global Underground-, his contributions production-wise enriched the most demanding designs of the music industry. As a part of the artistic cast of Paul Oakenfold&amp;#039;s record label, together with Cattaneo he also signed tracks for Sinichi (an original version of Pasion Descalza, by the Mar del Plata-based band Altocamet) and remixes for Bedrock. In fact, Digweed&amp;#039;s brand will be responsible for releasing the pair&amp;#039;s new single Behind the music. \n\nCurrently, Martin Garcia maintains the bond with his audience alive during his residency at Clubland as well as through his weekly radio space Main Room on Metrodance 95.1 FM. ","torrent":{"xt":"urn:btih:0240dc7faffb1c167c275b17e408bd19f3f9fede","amp;dn":"MARTIN+GARCIA+-+JOURNEY+-+METRO+95.1+FM+-+21-12-2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0240dc7faffb1c167c275b17e408bd19f3f9fede","infoHashBuffer":{"type":"Buffer","data":[2,64,220,127,175,251,28,22,124,39,91,23,228,8,189,25,243,249,254,222]},"announce":[],"urlList":[]}}