{"title":"National Geographic - The Sinking of the Belgrano [DVDRIP][Spa-E","uid":3372043,"size":748015531,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:041a9652d59396f3b588f33a3e50ea57ce8985e6&amp;dn=National+Geographic+-+The+Sinking+of+the+Belgrano+%5BDVDRIP%5D%5BSpa-E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pctorrent","files":5,"time":1124492741,"description":"THE SINKING OF THE BELGRANO  \n \nAt 4pm on May 2, 1982, two torpedoes fired from the British nuclear submarine, H.M.S. Conqueror, struck the Argentine warship A.R.A. General Belgrano, killing some 300 men almost instantly. \n\nAs the enormous warship began to sink, her remaining shell-shocked crewmembers scrambled onto life rafts and plunged into the near-freezing waters of the South Atlantic Ocean. For the next hours and days they battled injuries, hypothermia and the relentless pounding of the storm-driven seas.\n\nIn one of the most difficult marine rescue operations ever conducted, more than 700 men were saved but a number of others died of exposure or injuries, bringing the total dead to 323.\n\nIt is a tale of human struggle for survival against the backdrop of the British-Argentine war over the Falkland Islands, or Islas Malvinas.\n \nMany question whether the ship was ever a serious threat to the British fleet and to this day the attack remains steeped in controversy, more than twenty years after the guns of war fell silent.\n\nNow National Geographic Channel returns to the treacherous seas off of Cape Horn, searching for the remains of the lost warship. ?The Sinking of the Belgrano? tells the story from the point of view of those involved, on both sides of the conflict. Re-enactments of events, together with some shocking archival footage, recount the dramatic events of May 2nd, 1982\n\nDVDRIP\nSpa-Eng with Spanish subs","torrent":{"xt":"urn:btih:041a9652d59396f3b588f33a3e50ea57ce8985e6","amp;dn":"National+Geographic+-+The+Sinking+of+the+Belgrano+%5BDVDRIP%5D%5BSpa-E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"041a9652d59396f3b588f33a3e50ea57ce8985e6","infoHashBuffer":{"type":"Buffer","data":[4,26,150,82,213,147,150,243,181,136,243,58,62,80,234,87,206,137,133,230]},"announce":[],"urlList":[]}}