{"title":"Xbox - RLT - Dead to Rights","uid":3366775,"size":1578958156,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:047e476456d2dc609c8c9d0166b09b3c007f7920&amp;dn=Xbox+-+RLT+-+Dead+to+Rights&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shady78","files":1,"time":1123441126,"description":"NTSC \nENGLISH\n100% RETAIL\n\n\n\nLINK:\nhttp://www.xbox.com/en-us/deadtorights/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=deadtorights\n\n\n \n \n  \nInspired by Hong Kong action movies, classic film noir style and hardboiled detective novels, Dead to Rights&amp;reg; stars action noir hero, Jack Slate, a good cop in a bad city, forced to be a fugitive as he fights for his life and searches for his father's killers.\n\n\nDead to Rights features more than a dozen game mechanics including diving, rolling, punching, kicking, and lethally disarming enemies in a variety of over-the-top ways.  Jack's canine partner (a Husky named Shadow) lives up to the name &quot;man's best friend,&quot; helping Jack investigate crime scenes, sniff out bombs, retrieve weapons and attack enemies. Unique game play scenarios, mini-games and stop motion special effects add to the action.\n \nThe graphics and characters are given depth and realism on the Xbox platform by employing advanced graphics technology called bump-mapping pixel shading.  Additionally, players will feel like they're in a movie theatre with Dolby Digital sound effects and the option of a 16:9 anamorphic wide screen support which gives the look of a movie screen ? wide screen with black bars at the top and bottom. \n \n \n \n Features  \n \n \n\nClassic film noir style inspired by Hong Kong action movies and hardboiled detective novels. The twisting plot, seedy citizens of Grant City and high adrenaline action leave players wanting more. \nProvides an intense and adult experience with great depth and detail that can't be defined within existing game genres \nMore than a dozen game mechanics including diving, rolling, punching, kicking, and lethally disarming enemies in a variety of over-the-top ways \nJack's canine partner helps Jack investigate crime scenes, sniff out bombs, retrieve weapons and attack enemies. \nMovie quality production- Screenwriter Flint Dille (G. I. Joe, Transformers series), movie music composer Kevin Manthei (Resident Evil, Air Force One, Halloween H20), sound effects/design firm GDH Digital (Star Trek, Babylon 5) and Weddington Productions (Lethal Weapon 4, Die Hard, Training Day) were brought in. Smashcut (The Matrix, Fight Club) was hired for motion capture effects and stunts. \nUse of advanced technology- Dolby Digital sound effects, 16:9 anamorphic wide screen support and bump-mapping pixel shading \n \n \n","torrent":{"xt":"urn:btih:047e476456d2dc609c8c9d0166b09b3c007f7920","amp;dn":"Xbox+-+RLT+-+Dead+to+Rights","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047e476456d2dc609c8c9d0166b09b3c007f7920","infoHashBuffer":{"type":"Buffer","data":[4,126,71,100,86,210,220,96,156,140,157,1,102,176,155,60,0,127,121,32]},"announce":[],"urlList":[]}}