{"title":"XBMC Xbox Media Center 1.1.0 2005-06-24 [Y]","uid":3348394,"size":36582391,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:04b1a1539411c5fe5458b69929332bebad226c11&amp;dn=XBMC+Xbox+Media+Center+1.1.0+2005-06-24+%5BY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ythan","files":1,"time":1119675422,"description":"24-06-2005 fixed: Small width anim-gif loading crash.\n24-06-2005 fixed: wav header parsing in wavcodec is incorrect\n24-06-2005 fixed: Small issue in FileHD (reading of weather .rar file triggered it)\n24-06-2005 fixed: Transistion on press of left/right in my pictures faded incorrectly.\n24-06-2005 changed: aaccodec now uses mp4ff to read m4a files (aaccodec.dll in systemplayerspaplayer got updated)\n24-06-2005 updated: Norwegian language file (Thnx to vnm)\n24-06-2005 updated: German language file\n24-06-2005 changed: dll's loaded via section loader are unloaded with a 30 secs delay when unreferenced -&gt; more freemem when using my music\n22-06-2005 fixed: some nav sounds are not played correctly\n22-06-2005 added: New MasterLock option: Settings &amp; Filemanager &amp; Home Media [GeminiServer]\nNow you can define a MasterLock also for Settings, Filemanager, My Video, My Music, My Pictures, My Programms\nLocation: SettingsAppearanceMaster Lock: Lock Filemanger, Lock Settings and Lock Media!\nThese settings are also setable via xboxmediacenter.xml: &lt;LockFilemanager&gt;0&lt;/LockFilemanager&gt;, &lt;LockSettings&gt;0&lt;/LockSettings&gt;, &lt;LockHomeMedia&gt;0&lt;/LockHomeMedia&gt;\n21-06-2005 added: use of combined conditional visibility is now supported in skin.\n+ is logical AND, | is used for logical OR. ie VideoPlayer.IsFullscreen + !Player.Caching, will display when fullscreen and not rebuffering\n21-06-2005 added: progress bar / slider can use info values. ie &lt;info&gt;Player.Progress&lt;/info&gt; will make progressbar/slider display current progress\nvalid commands are so far only: Player.Progress, Plyayer.Seekbar (Seekbars current location), Player.Caching (Progress of caching)\n21-06-2005 added: sliders now respect &lt;height&gt; and &lt;width&gt;, scaling will be based on background image\n21-06-2005 fixed: aaccodec, return value of AACOpen is not always AAC_INVALID_HANDLE when open fails\n21-06-2005 fixed: audiomanager (nav sounds) could crash on an invalid wav file, second try ;)\n21-06-2005 changed: added more chars (&amp;eacute;&amp;egrave;&amp;ccedil;&amp;agrave;&amp;ugrave;&amp;ecirc;&amp;Aring;&amp;aring;&amp;Acirc;&amp;ntilde;&amp;aacute;&amp;aring;&amp;Auml;&amp;Uuml;&amp;uuml;&amp;Ouml;) to the allowed for fatx limits \n20-06-2005 fixed: [ 1223555 ] Case sensitiveSubtitle files where case sensitive.\n20-06-2005 fixed: ogg playback\n20-06-2005 fixed: unneeded logs from track_realloc when mem with 0 bytes size is reallocated\n20-06-2005 fixed: mem leak in mp3 tag loader\n20-06-2005 fixed: audiomanager (nav sounds) could crash on an invalid wav file\n20-06-2005 added: replay gain support for aaccodec (aaccodec.dll in systemplayerspaplayer was updated)\n20-06-2005 updated: Spanish language file (Thnx to unknown)\n20-06-2005 updated: Korean language file (Thnx to AkoXko)\n20-06-2005 updated: Italian language file (Thnx to kotix)\n20-06-2005 updated: German language file\n20-06-2005 updated: German (Austrian) language file (Thnx to CEOMR)\n20-06-2005 updated: Finnish language file (Thnx to jutski)\n20-06-2005 updated: Norwegian language file (Thnx to vnm)\n20-06-2005 updated: [ 1215375 ] Newest BiosIDs.ini (Thnx to bubbadood)\n16-06-2005 changed: 'the' is ignored during sorting in my videos as well.\n16-06-2005 added: aac codec for paplayer (needs aaccodec.dll in systemplayerspaplayer)\n16-06-2005 added: Startup Window now setable via GUI! SysteminfoAppearanceLook and FeelStartup Window! [GeminiServer]\nIt will set the XBMC Startup Window [Manual Settings, Home, Programms, Pictures, Music, Videos, Music, ] default it Home Window!\nManual Settings will not touch the Settings and you can define your own Startwindow in xbmc xml.\n16-06-2005 fixed: sf.net Bug [1220193]. if Date and Time Set Hour is 0 (24), it will add. + 1day [GeminiServer]\n14-06-2005 fixed: home.xml, urlset was 0, changed to 1, RSS should work now again\n14-06-2005 changed: Milkdropnow renders with correct aspect ratio.\n14-06-2005 added: Pixel ratio parameter added to the visualisation Create function and more Direct X exports.\n14-06-2005 changed: added option in build.bat to unrar web stuff (Thanks to Aasum)\n14-06-2005 changed: build.bat now RAR's weather gfx and puts it in media/ folder (required for gfx to show)\n14-06-2005 fixed: rar code had problems with multiple volumes.\n14-06-2005 updated: mplayer.dll (fixes crash with noise filter)\n14-06-2005 changed: weather pictures can be in a rar as well.\n14-06-2005 added: CGUIListControl::SetPageControlVisible() exposed to python.\n14-06-2005 fixed: Navigation off the right of list/thumb controls was not functioning.\n14-06-2005 changed: Spin control only shows in thumb/list controls if more than 1 page exists.\n14-06-2005 changed: All controls now check for conditional visibility.\n14-06-2005 changed: Moved fading code into the base control class.\n14-06-2005 changed: Removed ability to alter Brightness/Gamma/Contrast from video OSD during Hardware Overlays rendering.\n14-06-2005 added: Visualisation settings, and ability to show, select and lock vis presets.\n14-06-2005 added: Nicer music OSD during visualisation (thanks to Chokeman for all the nice graphics)\n14-06-2005 updated: mplayer.dll (fixes 2x playback speed when volumn amplification was enabled)\n14-06-2005 fixed: possible crash in zip file handler.\n14-06-2005 changed: weather pictures now in weather.zip (currently disabled).\n14-06-2005 added: rar support. since it has to extract the files to disc, it is currently only available for: \n.cbr/.rar in my pictures. \ncompressed (vob)subs (supports a rar within a rar etc)\nmy music.\n13-06-2005 changed: fat-x limit setting also affects filemanager.\n13-06-2005 fixed: cosmetic problem introduced by previous commit.\n13-06-2005 added: ability to select rss feeds update interval.\n13-06-2005 fixed: the option to enable autosync in mplayer (smooth audio clock) wasn't taking affect\n12-06-2005 added: readstring method to zip file class.\n12-06-2005 fixed: seeking after selecting time using seekbar was very slow\n12-06-2005 changed: HttpApi: re-enabled database lookup\n11-06-2005 updated: mplayer.dllabout 1 meg smaller than old (saves mem).\nhas been compiled with gcc.3.4.4 and has some unneeded filters removed\n11-06-2005 fixed: HttpApi internal logic bug\n10-06-2005 added: Master Code Control: XBMC Startup Lock! [GeminiServer]\nXBMC Startup Lock will use the Master Lock Settings and if Startup Lock is enabled:\nOn XBMC Startup, the XBMC Startup Lock will ask you the predefined Master Code in \naddition with the Max Retry. If you enter the correct MasterCode, XBMC will start as used\nBut if you enter the Wrong Master Code in addition with the Max Retry:\nThen XBMC switches off! if you restart XBMC it will ask the Master Code again!\n10-06-2005 added: Master Code control within the GUI! [GeminiServer]\nThis will make it easy to set the Master Code handling, instead of XboxMediaCenter.xml \nediting to set the &lt;masterlock&gt; settings. It will set the Master Code, Retry, Enable Shutdown, \nProtect Shares, Master Mode, automatic, with MasterCode detection and also the conditions to use it!\nMaster Lock will use the Max Retry condition, to prevent the infinite tries on the Settings\nScreen! It will ask you the Master code on: Entering a New Master Code, Disabling Master Mode\nand also it will ask on hit Applying Changes! The Master Code Remember is not used here, to prevent not intended changes\n10-06-2005 added: more extensive RSS comments &amp; changed the id method in xboxmediacenter.xml\n10-06-2005 changed: rss sets use an id attribute rather than separate tag + updated skin.\n10-06-2005 fixed: GUIThumbnailPanel graphical glitches (focused item while scrolling + page number glitch on last page).\n10-06-2005 fixed: List/Thumb controls spin control didn't use relative coordinates correctly.\n10-06-2005 changed: rss sets must be tagged with a &lt;id&gt;#&lt;/id&gt; now.\n10-06-2005 fixed: [ 1218199 ] Fix for Bug 1216728 (hardware panel on systeminfo) thanks to Mr_Muh.\n10-06-2005 changed: IMDb lookups (and Scanning) now threaded. Now easily cancellable.\n10-06-2005 fixed: Crossfadeinitial volume of new track could spike to max volume.\n10-06-2005 removed: unneded function call to mplayer.dll\n08-06-2005 fixed: OutputToAllSpeakers didn't work with when AC3 Output was enabled on 2ch AC3 files\n06-06-2005 changed: VSync now always on.\n06-06-2005 added: dll_fprintf() initial code for writing text files from dll's.\n06-06-2005 changed: Updated OpenForWrite() to open with overwrite if requested.\n06-06-2005 fixed: FileZip Read() missed last chunk if read chunksize was small.\n06-06-2005 updated: Hungarian language file (Thnx to tcsizmadia)\n06-06-2005 fixed: mplayer may crash when playback ends (updated again)\n06-06-2005 fixed: item is highlighted as playing when the start of a song fails\n06-06-2005 fixed: .cue sheets would loop indefinitely on the last two tracks.\n06-06-2005 fixed: Source of the below crash (urlset out of range in rsscontrol), + updated PM3 to suit the new system.\n06-06-2005 fixed: added missing !--&gt; to the rss comments in Xboxmediacenter.xml (fixes serious crash)\n06-06-2005 fixed: some legal fat-x chars were not in the listthanks to yoci!\n06-06-2005 changed: moved rss specifications to xboxmediacenter.xml and added url sets.\n06-06-2005 changed: removed libmp4 linkage. reduces xbe with ~ 110kb\n06-06-2005 added: sf.net patch [1215111] Fast AAC/MP4 tag retrievalthanks to arnie pie!\n05-06-2005 changed: Cleaned up use of CUtil::cmpnocase, replacing with strcmpi throughout.\n05-06-2005 added: Combined spectrums into a single .vis with presets, changeable on the fly.\n05-06-2005 fixed: dvdplayer would fail to play from scrambled disc untill mplayer had once played it\n05-06-2005 fixed: XBMC would sometimes lockup during FF/RW when using Hardware Overlays\n05-06-2005 added: Write to log when memory allocation failes in a dll\n05-06-2005 fixed: memory overrun when reading EEPROM (not as bad as it sounds). HalReadSMBusValue() allways touched 4bytes on each call.\n05-06-2005 added: Faster path lookups in CFileItemList (for DirectoryCache mainly) thanks to desertbear.\n05-05-2005 fixed: minor crash fix when switching between gui and fullscreen\n05-06-2005 fixed: PAPlayer correctly handles track changes where the number of channels changes + handles 6 channel tracks correctly.\n04-06-2005 added: sf.net patch [1209466] Multiple RSS feeds concatenatedthanks to desertbear!\n04-06-2005 fixed: long rss feeds could crash xbmc when using ttf fonts.\n04-06-2005 added: All Winamp milkdrops &quot;Winamp-presets(436).zip&quot;, no shortened filenames. Zip 'normal' compression used.\n04-06-2005 changed: Ogg codec now uses the FileReader.\n04-06-2005 changed: Updated MPCCodec.dll so that MPC files use the FileReader.\n04-06-2005 updated: [ 1212669 ] Newest BiosIDs.ini (Thnx to bubbadood)\n04-06-2005 changed: added zipped G-Force presetfiles.\n04-06-2005 updated: Dutch language file (Thnx to tijmengozer)\n04-06-2005 updated: German language file\n04-06-2005 updated: German (Austrian) language file (Thnx to CEOMR)\n04-06-2005 updated: Finnish language file (Thnx to jutski)\n04-06-2005 updated: Norwegian language file (Thnx to vnm)\n04-06-2005 added: HttpApi Slideshow commands\n04-06-2005 fixed: File manager, context menu option &quot;select all&quot; does not select all items\n04-06-2005 changed: unified dll load/unload in paplayer codecs by using the section loader\n03-06-2005 added: G-ForceAbility to select a folder or a zip file for presets from the xml config.","torrent":{"xt":"urn:btih:04b1a1539411c5fe5458b69929332bebad226c11","amp;dn":"XBMC+Xbox+Media+Center+1.1.0+2005-06-24+%5BY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04b1a1539411c5fe5458b69929332bebad226c11","infoHashBuffer":{"type":"Buffer","data":[4,177,161,83,148,17,197,254,84,88,182,153,41,51,43,235,173,34,108,17]},"announce":[],"urlList":[]}}