{"title":"Celldweller","uid":3373714,"size":64480912,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:04dd32a97772655d9873c77676ba2d95416d6518&amp;dn=Celldweller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Shad19","files":20,"time":1124830105,"description":"Celldweller - the concept born from experiences of personal and cultural bondage along with the creator 's near 24-7 dwelling in his former basement studio. Klayton, the man behind the machine, originally created the moniker as a producer pseudonym. However, after retiring his previous band, the 90's cult industrial act Circle of Dust, he adopted Celldweller as his defining outlet.\n\nKlayton has garnered the interest of the Film/TV industry having licensed tracks for &quot;Mr. and Mrs. Smith,&quot; &quot;XXX: State of the Union,&quot; &quot;Catwoman,&quot; &quot;Spiderman 2,&quot; &quot;The Punisher,&quot; &quot;Constantine,&quot; &quot;Supercross,&quot; &quot;Paycheck,&quot; &quot;Timeline,&quot; &quot;Mindhunters,&quot; &quot;Out for a Kill,&quot; &quot;Bad Boys 2,&quot; &quot;National Security,&quot; &quot;Kart Racer,&quot; &quot;Takedown,&quot; &quot;Cutaway,&quot; &quot;Repli-Kate,&quot; &quot;Veritas,&quot; &quot;21,&quot; &quot;Rubbernecking,&quot; &quot;Higher Ground,&quot; &quot;Python,&quot; &quot;Beggars &amp; Choosers,&quot; &quot;Wrecked,&quot; The Surf Channel, &quot;The Chris Isaak Show&quot; (Showtime), &quot;The Bum Hunter,&quot; Rossignal Ski video, Divinci Bicycles video and the video games &quot;Enter the &quot;Enter the Matrix,&quot; &quot;XGRA,&quot; &quot;Fallout: Brotherhood of Steel,&quot; &quot;Rallisport Challenge 2,&quot; &quot;Road Rash - Jailbreak,&quot; &quot;Test Drive Off Road: Wide Open&quot; and &quot;NHL Hockey 2003.&quot;\n\nDeveloped as an agent of contrast Celldweller combines the electronic and the organic, darkness and beauty, aggression against sensuality, with the ability to find its home in the mosh pit as easily as on the dj's turntable. The debut album ranges from the guitar-based electronic rock of &quot;Stay With Me (Unlikely)&quot; and &quot;Switchback&quot; to the unique blending of heavily distorted guitars and aggression with drum &amp; bass and trance in &quot;The Last Firstborn&quot; and &quot;Own Little World.&quot; The styles are further contrasted by the electro-orchestral Depeche Mode-esque &quot;So Sorry to Say&quot; and the hauntingly beautiful down tempo track &quot;Welcome to the End.&quot;\n\nThe Celldweller album, released independently, debuted at 17 on the Billboard Internet Sales Chart and won Album of the Year honors at the Just Plain Folks Music Awards. The album has garnered Top 40 Metal Radio charting and ?I Believe You? reached 11 on the R&amp;R Alternative Specialty Show Chart. Guest appearances include Jarrod Montague of Taproot, Kenny James, Fluffy Starr, and mixes by Ben Grosse and Grant Mohrman.\n\nThe artist, performer, producer, songwriter, programmer, and re-mixer Klayton has an extensive musical history beginning in the early nineties, with work on such projects as: Circle of Dust, Argyle Park, Chatterbox, Criss Angel, Level, Klank, AP2, and Prong. Klayton took home 7 awards at the 2004 Just Plain Folks Music Awards, including, Producer of the Year, Album of the Year, 1 Industrial Song of the Year, and 1 Metal Song of the Year.","torrent":{"xt":"urn:btih:04dd32a97772655d9873c77676ba2d95416d6518","amp;dn":"Celldweller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04dd32a97772655d9873c77676ba2d95416d6518","infoHashBuffer":{"type":"Buffer","data":[4,221,50,169,119,114,101,93,152,115,199,118,118,186,45,149,65,109,101,24]},"announce":[],"urlList":[]}}