{"title":"[Kung Fu] The Princess Blade (2002) - DVD/Rmvb","uid":3762090,"size":318662901,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0522fcb8f3b4165491ce7e7fabec90ad5fac1998&amp;dn=%5BKung+Fu%5D+The+Princess+Blade+%282002%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"JamesKees","files":7,"time":1186188879,"description":"The Princess Blade (2002)\n\nHKFlix Says:  \t4 Stars\n\nThis film is beautifully shot, and features a haunting score by Kenji Kawai (&quot;Avalon&quot;) and solid performances all around. The stand-out feature of this film, however, is the incredible sword fight choreography by Donnie Yen. Must-see material.\n\nAvg. Rating: \t\n  3.2 / 5 (based on 15 ratings).\n\nPlot:\tYuki is an orphan raised by a clan of assassins. When she discovers that her mother was murdered by her leader, Byakurai, she tries to kill him but fails. Forced to escape, she teams up with a member of the rebel forces to get her revenge.\n\nOverview:\tIn an unknown country closed off from the outside world for well over 500 years, the ruling dictatorship enlists the help of the Takemikazuchi family, a clan of skilled assassins who sought asylum from their nation years ago. The most highly trained member of the family is Princess Yuki, killing dissidents and rebels who attempt to thwart the ruling body.\n\nOne day Yuki discovers a dark secret that changes her life forever: her mother may have been killed by her own leader, a member of her adopted nation&amp;#039;s ruling class. Soon, Yuki is fighting for her life, enlisting help from the most unlikely of allies--a rebel named Takashi--while her own family attempts to hunt her down.\n\nA wild ride into a dark, apocalyptic future, where law is upheld with the power of the samurai sword, &quot;Princess Blade&quot; is a stylish and spectacular ride featuring some of the most mind-blowing fighting and special effects sequences ever seen.\n\nCast: \tHideaki Ito  ||  Yumiko Shaku  ||  Shiro Sano  ||  Yoichi Numata  ||  Kyusaku Shimada  ||  Yoko Maki \n\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:0522fcb8f3b4165491ce7e7fabec90ad5fac1998","amp;dn":"%5BKung+Fu%5D+The+Princess+Blade+%282002%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0522fcb8f3b4165491ce7e7fabec90ad5fac1998","infoHashBuffer":{"type":"Buffer","data":[5,34,252,184,243,180,22,84,145,206,126,127,171,236,144,173,95,172,25,152]},"announce":[],"urlList":[]}}