{"title":"[Kung Fu] Lackey And The Lady Tiger aka Fearless Kid And The Lad","uid":3905831,"size":420690910,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:056aa68b2397721eaa250a57b46f9d6a1bbc68ee&amp;dn=%5BKung+Fu%5D+Lackey+And+The+Lady+Tiger+aka+Fearless+Kid+And+The+Lad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":7,"time":1195844189,"description":"Lackey And The Lady Tiger aka Fearless Kid And The Lady Tiger (Shek Kin, 1980) - Rmvb\n\nThe main character I&amp;#039;m not sure what his name is, but he&amp;#039;s the Lackey. So Lackey spends most of the movie getting beaten up. On one such occasion he&amp;#039;s saved by Helen, a girl who disguises herself as a boy. She tells Lackey that her name is Allan and she agrees to teach him kung fu. Helen/Allan has learned kung fu from her grandfather, Yujo. He&amp;#039;s a master of the staff, but he wouldn&amp;#039;t teach her his Fishing Staff. Once again Lackey is beaten up, again, by a kung fu instructor. Lackey is beaten is a staff fight. Lackey asks Allan/Helen to teach him how to use a staff. She doesn&amp;#039;t know, so makes up some bogus moves. Lackey runs into Yujo and after some stuff, Yujo takes Lackey as a student and teaches him Fishing Staff. Now, Shir Bar is released after ten years in prison and is looking for some pay back. Lackey meets up with Shir Bar as he&amp;#039;s beating up a women he used to work with. And surprise, when Lackey steps in, he gets beat up. The women tells Lackey to counter this he must learn from a cat. So Lackey starts throwing a cat around into the air to see how it lands. When Lackey and Helen/Allan meet next, Lackey accidentally grabs her breasts and the gig is up. Helen runs off. Shir Bar shows up a Yujo&amp;#039;s because Yujo is the one who defeated him and sent him to prison. Yujo is about to be beaten when Lackey shows up. Then as Lackey is about to be beaten, Helen shows up. Helen tricks Shir Bar and she and Lackey double team Shir Bar. \n\nLackey and the Lady Tiger is the only starring role for Cheung Wing Fat aka Mars. Mars worked on Jackie Chan&amp;#039;s famous stuntman team. Luckily, he went on to bigger and better things than this movie. It&amp;#039;s all right, but nothing spectacular. Mars seems to run around with a stupid look on his face most of the time. That&amp;#039;s when he&amp;#039;s not getting beat up. The hand to hand fighting is average, nothing really good. But there is some staff fighting that&amp;#039;s okay. Of course it&amp;#039;s a kung fu comedy, but the comedy isn&amp;#039;t really funny. Maybe it&amp;#039;s because there was no toilet humor like fart jokes. You can&amp;#039;t go wrong with a fart joke! In one scene the music is playing Rock Around The Clock and Helen is running around singing something, I don&amp;#039;t know what. It was weird. I was a bit disappointed this movie wasn&amp;#039;t a bit better. Hwang Jang Lee throws in some cool moves as usual, but goes out like a punk in the end. This movie is mediocre as best. I&amp;#039;ve said it once and I&amp;#039;ll say it again, you can&amp;#039;t go wrong with a fart joke. \n\n&quot;Review&quot; by Keith\n\nCast: Cheung Wing Fat, Ta Niu, Shek Kin, Hwang Jang Lee, Lin Ying \n\nDirector: Siu Lung and Norman Law \n &lt;a href=&quot;\nhttp://www.kungfumovies.net/15509.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kungfumovies.net/15509.html&lt;/a&gt;\n\n_________________\nTo Share is to Care! So it seems. Do not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d9b3b8b4bcaab2bcbcaa99b1b6adb4b8b0b5f7bdbc&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) for a re-seed!\n","torrent":{"xt":"urn:btih:056aa68b2397721eaa250a57b46f9d6a1bbc68ee","amp;dn":"%5BKung+Fu%5D+Lackey+And+The+Lady+Tiger+aka+Fearless+Kid+And+The+Lad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056aa68b2397721eaa250a57b46f9d6a1bbc68ee","infoHashBuffer":{"type":"Buffer","data":[5,106,166,139,35,151,114,30,170,37,10,87,180,111,157,106,27,188,104,238]},"announce":[],"urlList":[]}}