{"title":"BBC This World 2007 - Mystery Flights","uid":3779703,"size":670480818,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0570745046ec75f962c3cf6017308b67c34deaed&amp;dn=BBC+This+World+2007+-+Mystery+Flights&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Firesnake2007","files":1,"time":1187660770,"description":"This World is the BBC&amp;#039;s current affairs program. Episode aired May 24, 2007.\n\nfrom hxxp://news.bbc.co.uk/2/hi/programmes/this_world/6683467.stm\n\n[quote]This World pieces together the jigsaw of &quot;extraordinary rendition&quot;, the alleged illegal CIA transfer of terror suspects to secret prisons in Europe.\n\nIn far Eastern Poland in 2002 and 2003 strange planes landed on an old disused runway in a secluded forest. Nine times.\n\nWas Poland a staging point in the network of secret prisons established by the United States in their &quot;extraordinary rendition&quot; programme? Did these mystery flights bring al-Qaeda suspects to Poland?\n\nPoland is not alone: it is alleged that the CIA flew their planes to 29 different countries; that there were 300 CIA landings in Europe alone, 80 in Britain.\n\nSo did European governments know about these mystery flights?\n\nExtraordinary rendition\n\n&quot;It is unlikely&quot; says lawyer Clive Stafford Smith, &quot;that the British, European and American governments will tell us the truth&quot;.\n\nThis World&amp;#039;s Olenka Frenkiel reports on the plane spotters, civilians, judges, lawyers and journalists piecing together the jigsaw of &quot;extraordinary rendition&quot;.\n\nThe CIA use the term for taking prisoners abroad for interrogation, a policy the US administration defends as a necessary tool in the &quot;War on Terror.&quot;\n\nIt denies that prisoners are taken to be tortured.\n\nSearch for truth\n\nIn a BBC exclusive, Olenka interviews the former head of the CIA in Europe, Tyler Drumheller, who believes the truth will soon be revealed. &quot;These things have a way of coming out&quot; he says, &quot;and then I won&amp;#039;t look like the gangster I seem today&quot;.\n\nSlowly Europe&amp;#039;s democracies are cranking into action in a belated attempt to hold their own governments to account.\n\nThe former President of Poland Aleksander Kwasniewski and the former Polish Defence Minister Radoslaw Sirkorski have denied that Poland and the military airbase in question were involved.\n\nThe UK Government has said it does not know and has no way of finding out who was aboard the 80 CIA flights which landed on British soil.[/quote]","torrent":{"xt":"urn:btih:0570745046ec75f962c3cf6017308b67c34deaed","amp;dn":"BBC+This+World+2007+-+Mystery+Flights","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0570745046ec75f962c3cf6017308b67c34deaed","infoHashBuffer":{"type":"Buffer","data":[5,112,116,80,70,236,117,249,98,195,207,96,23,48,139,103,195,77,234,237]},"announce":[],"urlList":[]}}