{"title":"Capstan Shafts - Environ Maiden [2007] MP3 192kbps","uid":4002110,"size":55244991,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:060690506ddd54ef56e05d8100036515eb6c9456&amp;dn=Capstan+Shafts+-+Environ+Maiden+%5B2007%5D+MP3+192kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dkords","files":29,"time":1201627956,"description":"The Capstan Shafts&amp;#039; first album for Rainbow Quartz, Environ Maiden, does nothing to separate them from the Guided by Voices comparisons that 2006&amp;#039;s Euridice Proudhon made inescapable. Dean Wells is still writing short, ultra-hooky rock opera excerpts, recording them quickly and simply with little or no fidelity, and singing them in a Robert Pollard-esque pretend-English accent. The 29 songs clock in at under 40 minutes and sport silly/witty titles like &quot;Snakeskin Belt Through Loose Hoops,&quot; &quot;Drop Dead Innocuous,&quot; and &quot;My Family Was Welsh, I&amp;#039;m Just Tired.&quot; You could write it off as hero worship or copycat-ism, but once again Wells dodges any negative connotations by being just as witty, tuneful, and fun as Pollard/GBV without any of the frustrating arty tendencies or annoying attempts at being a real rock band. It&amp;#039;s just Wells in his bedroom cranking out songs that sound like fuzzy snippets from a &quot;Sixties at 6:00&quot; show on an oldies radio station but better because he leaves out all the bothersome things like intros, verses, and solos. Each song is as good as the last, and if you don&amp;#039;t like the one playing, wait a few seconds and the next hit will come rolling along. Environ Maiden is a perfect tonic for anyone longing for the return of Guided by Voices, but also a nice bonus for anyone who ever wished GBV would quit fooling around and just deliver a solid record from beginning to end.","torrent":{"xt":"urn:btih:060690506ddd54ef56e05d8100036515eb6c9456","amp;dn":"Capstan+Shafts+-+Environ+Maiden+%5B2007%5D+MP3+192kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"060690506ddd54ef56e05d8100036515eb6c9456","infoHashBuffer":{"type":"Buffer","data":[6,6,144,80,109,221,84,239,86,224,93,129,0,3,101,21,235,108,148,86]},"announce":[],"urlList":[]}}