{"title":"Mr Big (UK, 1975) - Sweet Silence","uid":3363068,"size":70985728,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:091b19070092411e17494c458bf4b55a010f214b&amp;dn=Mr+Big+%28UK%2C+1975%29+-+Sweet+Silence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Alocacoc","files":12,"time":1122732194,"description":"Recorded at: Rockfield Studios. Overdubbed and mixed at Air Studios.\n\nProduced by: John Punter\n\nTrack listing: Time Base / Wonderful Creation / Golden Lights / Uncle John 'B' / I Ain't Been A Man / Sweet Silence / Zambia / Enjoy It / Violet May / For The Fun To Find / Appeared A Shining Throne / Throne Second Amendment\n\nComments: all songs written by Dicken \n\nDICKEN - lead vocals, acoustic &amp; electric guitars, harmonica, cow bell\nPETER CROWTHER - bass &amp; acoustic guitar\nVINCE CHAULK - drums, percussion &amp; backing vocals\nJOHN BURNIP - drums, percussion\n\nEMI Japan first issued &quot;Sweet Silence&quot; on compact disc in 1991, in their &quot;Past Masters&quot; series.\n\n&quot;Kerrang&quot; (issue 2, August 1981) -\nIf you remember Mr.Big at all it'll probably be because of their 1977 wimp-out chart hit 'Romeo'. &quot;I am the morning, you are the light. You make the morning such a beautiful thing&quot; crooned vocal leader Dicken with sickening sentimentallity, as if he was singing the verse of a Valentines day card. It's icredible to think that two years earlier, in the context of their debut album 'Sweet Silence', Mr.Big produced a track that even today can stand up proudly alongside the likes of 'Paranoid', 'Smoke on The Water' and 'Whole Lotta Love' as an all time heavy metal classic. You think I'm kidding? No way, Jose. If an HM DJ with an eye for the bargain bins picked up this LP, he would discover a real Soundhouse showstopper at the end of side one. It's the title track and goes like this; 'Aaaagh you look so sweet - Gotta move into rock 'n' roll beat - Such a crazy honey blowin'' my mind - Sweet Silence all MIIIINE!' Dicken, far from being the tender romantic balladeer, spitsout the lyrics like a mouthful of broken teeth and the band, spurred on by two drummers (Glitter Band style) create a racket so frantic, so crazed, so thunderous behind him that they sound like the modern day Plasmatics. And after he's sung the essential vocal lines, Dicken just spits, slurps and farts into the microphone like some noisome, ill-mannered spikey-hair. 'Sweet Silence' is a glorious momentin what is, truthfully, overall an erratic and prettylacklustre LP. Songs like 'I Aint Bin A Man' hint at the disappointingly soft-hearted standpoint that was to come. Such a shame, because Dicken had (still has in fact, even with his current band Broken Home) one helluva rock 'n' roll voice, a real Noddy Holder holler that'd be perfectly suited to metallic material. So if you're reading this Dick, stuff the soppiness and just SCREAM! That's my valueless advice.\n\n&quot;Record Collector&quot; (issue 259 - March 2001) -\n(by Tim Jones) The 70s Brit band rather than the 80s US outfit, this Mr Big were led by multi-talented vocalist/guitarist/composer Jeff Dicken, who was backed by a solid trio of musicians implementing his grandiose musical vision. In 1975's &quot;Sweet Silence&quot;, Dicken created a Styx-like fantasy concept album, running to 12 numbers, most of which are skewed pomp rock with hints of period pop and vaudeville. The opening &quot;Time base&quot; romps along with whining guitar, music hall vocals and radiophonic effects, before an airy acoustic pop-rocker, &quot;Wonderful Creation&quot;, in which Dicken sounds like a cross between Noddy Holder gingerly crossing a barbed wire fence and Rod Stewart on helium. The mad Jimmy Barnes-isms continue on the brass-edged &quot;Golden Lights&quot; and &quot;Uncle John B&quot; includes a kazoo! But don't let that put you off. The title track emulates SAHB by way of &quot;Radar Love&quot;, with highly amusing Brian Johnson-with-flu voclas, and other cuts are more direct rockers, with &quot;Zambia&quot; a salsa-marinated Kula Shaker. &quot;Throne Second Amendment&quot; rounds things off in mystical fashion with a chorale that could come from 'Red Sonja'. An acquired taste, but well worth sampling. \n","torrent":{"xt":"urn:btih:091b19070092411e17494c458bf4b55a010f214b","amp;dn":"Mr+Big+%28UK%2C+1975%29+-+Sweet+Silence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"091b19070092411e17494c458bf4b55a010f214b","infoHashBuffer":{"type":"Buffer","data":[9,27,25,7,0,146,65,30,23,73,76,69,139,244,181,90,1,15,33,75]},"announce":[],"urlList":[]}}