{"title":"Slysoft CloneDVD Mobile 1.1.6.0","uid":3898546,"size":9046360,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:09319f2ef7921f7ce82ec3fab5064d0c4f580fbc&amp;dn=Slysoft+CloneDVD+Mobile+1.1.6.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Highstate","files":2,"time":1195423066,"description":"CloneDVD mobile converts your DVD movies quickly and easily into a format that your portable device (Sony PSP, Apple iPod Video, iAudio X5, Creative Labs ZEN Vision, etc) can play. You can also convert your DVDs to other file formats, such as DivX, XviD, AVI, MP4, etc. \n\nWatch your movies on the go\nWith CloneDVD mobile you can put your favourite movies or TV series on your mobile video equipment and watch them wherever and whenever you want. Let the kids watch their favourite cartoons in the car. \n\nIncorporating the user-friendly interface of Elby&amp;#039;s CloneDVD and the well-engineered open source project MEncoder as the conversion engine makes CloneDVD mobile a fast, easy-to-use and quality product that is very reasonably priced. \n\nCopying a DVD to your mobile video machine is achieved in a few mouse clicks and without the need to rip it to your hard-disk. Note that copying protected DVDs also requires AnyDVD. \nFeatures\nConvert movie DVDs to play on mobile video equipment like the Sony PSP, Apple iPod Video, iAudio X5, Creative Labs ZEN Vision, etc\nConvert movie DVDs to other file formats like DivX, XviD, AVI, MP4, etc. \nUtilises a high quality picture conversion engine\nSupports multi-angle movie DVDs\nVideo Preview shows an overview of all selectable DVD titles \nTarget size freely adjustable \nSupports chapter trimming\nVery easy to use: Our unique Filmstrip assistant will guide you step-by-step through all settings - easy for beginners\nPicture snapshots while converting \nLogging window available \nStable, fast and does not require an ASPI driver","torrent":{"xt":"urn:btih:09319f2ef7921f7ce82ec3fab5064d0c4f580fbc","amp;dn":"Slysoft+CloneDVD+Mobile+1.1.6.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09319f2ef7921f7ce82ec3fab5064d0c4f580fbc","infoHashBuffer":{"type":"Buffer","data":[9,49,159,46,247,146,31,124,232,46,195,250,181,6,77,12,79,88,15,188]},"announce":[],"urlList":[]}}