{"title":"BRANDED 8-10 The Mission [retr0tv]","uid":3991884,"size":942837807,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:095b26ddc518f28a7755c2e86b3ef090aae233c0&amp;dn=BRANDED+8-10+The+Mission+%5Bretr0tv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"flixer","files":4,"time":1201049558,"description":"8. The Mission pt1  (3/14/1965)\nJason McCord is asked to return to Washington at the request of an old flame whose father happens to carry some influence. It seems that a number of people in various businesses want to have the treaty negotiated by General Reed vacated so a new treaty, more beneficial to the current business interests, can be made. The only way to do this is to declare Gen. Reed incompetent. Since the only officer who could testify against Reed is McCord, the businessmen need his help, help that Jas refuses to give.\nAs he storms out of the building, members of the Secret Service approach McCord. The President wants to meet with the former Captain to offer him a mission that could avert a war with Mexico.\n\n9. The Mission pt2  (3/21/1965)\nMcCord manages to meet with and infiltrate the Mexican bandits under the command of a rogue Mexican General. Jason convinces the bandits that his knowledge of military procedure will give them an edge in their most audacious attack yet; the theft of gold from a US Army fort.\nThe plan calls for McCord to lead the group into the fort disguised as an Army unit.\n  \n10. The Mission pt3  (3/28/1965)\nMcCord turns on the Mexican bandits as they try to steal the gold from the Army fort. Unfortunately, the Commanding Officer recognizes McCord and decides that the coward of Bitter Creek deserves hanging as much as the others. Despite pleas to contact Washington, the C.O. plans to go through with hanging all of the men, including McCord.\n \nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:095b26ddc518f28a7755c2e86b3ef090aae233c0","amp;dn":"BRANDED+8-10+The+Mission+%5Bretr0tv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"095b26ddc518f28a7755c2e86b3ef090aae233c0","infoHashBuffer":{"type":"Buffer","data":[9,91,38,221,197,24,242,138,119,85,194,232,107,62,240,144,170,226,51,192]},"announce":[],"urlList":[]}}