{"title":"VIPER - Theatre Of Fate","uid":4002485,"size":50396611,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a02b4d516c72883c7b123e329e25aa85b68a88a&amp;dn=VIPER+-+Theatre+Of+Fate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vassileios","files":10,"time":1201642438,"description":"This band is known primarily as the former band of Angra singer Andre Matos. The material here is strong enough to stand out on its own merits, though. This album should be especially interesting to Angra fans because of obvious similarities to the Angra debut. In fact, Matos reportedly left Viper when the band wanted to go in a different direction, while Matos pushed to continue the stylish neo-classical/power/progressive sound of this album. He did just that after finding the rest of Angra members.\n\nThe pictures of band members in the insert are quite informative. The goofy-looking twin brothers, Yves(guitar) and Pit(bass) Passarell, are immediately recognizable. It really looks like the same guy posed in 2 different outfits (could that really be the case here?). I remember reading somewhere that the band hired Matos because he looked a lot like Bruce Dickinson. Well, it&amp;#039;s true, in the hairstyle, at least. The first time I saw Dickinson&amp;#039;s Tears of the Dragon video, I actually thought it was Matos (great vid btw). Dickinson once performed the song along with Matos at an Angra concert.\n\nThis is the band&amp;#039;s second album. There is also a 2-on-1 version available with the debut, Soldiers of Sunrise. If it weren&amp;#039;t for the fact that I got this through a trade I would&amp;#039;ve probably gotten that disc at some point. Now, however, I probably won&amp;#039;t bother, since the Maidenesque debut is generally described as inferior to this release. The style here is Euro/power/neoclassical/Helloweenish. Most songs are written by the bassist Pit Passarell. Some orchestrations are present throughout. Generally, this is a few steps below Angra&amp;#039;s debut, Angels Cry, in quality, but somewhat similar in style. Most tracks are fast and mid-tempo tunes, with one ballad. The songs have good to decent melodies, but nothing exceptional.\n\nThe guitar leads and solos are the main highlights here. Very well done with a euro/neo-classical/Maidenish touch. The rhythm sound is not very strong, which is typical of low to mid level bands of this style.. The vocals are exactly what Matos would be expected to sound at such a young age. He lacks the power that develops on the Angra albums. However, the uniquely pleasant tone that makes him stand out from other high pitched singers is already present.\n\n\n1.Illusions. A great instrumental intro that stands out as a good song on its own (unlike too many of these things in other places).\n2. At Least A Chance. A decent mid-tempo track with nice solos.\n3. To Live Again. Same as above.\n4. A Cry From The Edge. Excellent song that starts out with just one guitar repeating the main melody. Then some acoustics and more of the same excellent melody for about a minute. When the vocals kick in, it turns into a more average flow. A surprising semi-thrashy groove after the solo.\n5. Living For The Night. Matos sings a nice slow melody with little instrumentation for about a minute and does a good job. Then it picks up with faster instrumental and vocal parts. Backing orchestrations, although not complex at all, clearly add some depth to these tunes.\n6. Prelude To Oblivion. Classy leads lift this song. Choir-like vocal parts are a nice touch too.\n7. Theater Of Fate. The shrill vocals belting out the same melodies start to become somewhat annoying, but the uplifting neo-classical instrumentals save the day yet again.\n8. Moonlight. A variation on Beethoven&amp;#039;s famous Moonlight Sonata, this is the only song penned by Matos. This is a great piano-punctuated ballad with a violin solo.","torrent":{"xt":"urn:btih:0a02b4d516c72883c7b123e329e25aa85b68a88a","amp;dn":"VIPER+-+Theatre+Of+Fate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a02b4d516c72883c7b123e329e25aa85b68a88a","infoHashBuffer":{"type":"Buffer","data":[10,2,180,213,22,199,40,131,199,177,35,227,41,226,90,168,91,104,168,138]},"announce":[],"urlList":[]}}