{"title":"catherine austin fitts - building local economic structure","uid":3369562,"size":27644447,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0a575bb95bd12955bfe8d3fcc5b08a38d546bfdb&amp;dn=catherine+austin+fitts+-+building+local+economic+structure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mtnorbeach","files":1,"time":1124003991,"description":"Catherine Austin Fitts on investing in local economies. Fitts uses her experience in Washington DC politics and international commerce to join in building local economic structures that are life giving and not life depriving.\n\nCan also be downloaded directly from: http://www.radio4all.net/index.php?op=download&amp;program_id=10635&amp;file_id=19393&amp;nav=&amp;\n\nAs President of Solari, Inc., Catherine is currently spearheading the Solari Circles Campaign to help make healthy local living economies the best investment worldwide.\n\nCatherine previously served as Managing Director and Member of the Board of Directors of the Wall Street investment bank, Dillon, Read &amp; Co., Inc. She also served as Assistant Secretary of Housing/Federal Housing Commissioner at HUD in the first Bush Administration, and was the President and Founder of Hamilton Securities Group, Inc., a broker-dealer/investment bank and software developer that successfully completed $12 billion of transactions and $500 billion of portfolio strategy prototyping the solari model. Catherine has a BA from the University of Pennsylvania, an MBA from The Wharton School, and studied Chinese at the Chinese University of Hong Kong. Catherine publishes the column Mapping the Real Deal for Scoop Media in New Zealand.","torrent":{"xt":"urn:btih:0a575bb95bd12955bfe8d3fcc5b08a38d546bfdb","amp;dn":"catherine+austin+fitts+-+building+local+economic+structure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a575bb95bd12955bfe8d3fcc5b08a38d546bfdb","infoHashBuffer":{"type":"Buffer","data":[10,87,91,185,91,209,41,85,191,232,211,252,197,176,138,56,213,70,191,219]},"announce":[],"urlList":[]}}