{"title":"Dredg - Catch Without Arms","uid":3777831,"size":74312647,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0bf86a8a95043d7db02736a23d745c906e82c058&amp;dn=Dredg+-+Catch+Without+Arms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"javan287","files":2,"time":1187498086,"description":"Dredg is an American progressive alternative band from Los Gatos, California.\n\nHistory\n\nDredg&amp;#039;s first studio album, Leitmotif, was released by the Universal music label on September 11, 2001. Prior to that, it had been self-released by the members of the band. After the album gained retail space, dredg acquired an almost immediate cult following,[citation needed] owing much to Leitmotif&amp;#039;s unique sound and concept. A movie has been planned to be released, as a music video for the entire album, though the project has been stalled.\n\nIndustry Demos is a collection of four songs from 2001 that dredg recorded before they were signed to a record label. The four songs are &quot;Of the Room&quot;, &quot;Redrawing the Island Map&quot;, &quot;Running Through Propellers&quot;, and &quot;The Papal Insignia.&quot;\n\nEl Cielo, their second album, which was released on October 8, 2002, is also a concept album. Prominent influences on the album&amp;#039;s concept and themes are painter Salvador DalÃƒÂ­&amp;#039;s life and a particular painting, Dream Caused by the Flight of a Bumblebee around a Pomegranate One Second Before Awakening (the first track on the album is named &quot;Brushstroke:dcbtfoabaaposba&quot;).\n\nOn June 21, 2005, dredg&amp;#039;s third album, Catch Without Arms, was released; a video for the single &quot;Bug Eyes&quot; was released. For the spring of 2006, dredg played on the Taste of Chaos tour, which also featured Deftones, Atreyu, Thrice, and Story of the Year as headlining bands. Also, dredg headlined their own tour with Ours and Ambulette to hit cities that they did not tour in during the Taste Of Chaos tour (they came on the Taste Of Chaos tour about mid-way through).\n\nDredg also composed the score for the 2006 independent film, Waterborne. [1]\n\nIn addition to music, Dredg also creates artwork, which is available for viewing on the band&amp;#039;s official website. Drew Roulette&amp;#039;s works have twice appeared on shirts released by Artus Clothing.\n\nOn May 11, 2006, Dredg recorded their performance for a live CD entitled Live at the Fillmore. Dredg announced in a MySpace bulletin on October 9, 2006 that the CD is available for pre-sale [2] and that it will be released on November 7 2006. Remixes that currently exist are Dan The Automator&amp;#039;s &quot;Sang Real&quot; and Serj Tankian&amp;#039;s &quot;Ode to the Sun.&quot; Both songs are off Catch Without Arms. The &quot;Sang Real&quot; remix is being made available as an added bonus for purchasing Live at the Fillmore off of iTunes. It is currently unknown what will become of the &quot;Ode to the Sun&quot; remix, or if the &quot;Sang Real&quot; remix will see wider release.\n\nIn the beginning of August 2006, dredg announced that they would be playing two &quot;special events&quot; back-to-back on September 14 and September 15, 2006 at The Catalyst in Santa Cruz, California. It was later revealed that the special events would be Leitmotif performed in its entirety on the first night and El Cielo in its entirety on the second night. Both nights would also features selections from Catch Without Arms. Recordings of these shows can be obtained via archive.org in FLAC format (the links can be found on the news page of traversing.net). Videos of the two shows have been edited and are currently available on various BitTorrent trackers. An early version of &quot;It&amp;#039;s not worth it&quot; was performed on each night.\n\nOn November 7 through November 10, 2006, Dredg debuted a new song, &quot;Ireland,&quot; at in-store performances that were held in California to promote the release of their first live album, Live at the Fillmore. Along with the new song, selections from Catch Without Arms and El Cielo were played, as well as &quot;The Warbler,&quot; which has only been officially released as a live track on the Fillmore CD.\n\nThe band appeared in the 2007 membership list for The Coterie with honorary membership.\n\nOn February 14, 2007, dredg issued a new update on their website detailing production on a new album. dredg also released several working song titles to go along with &quot;Ireland.&quot; The titles listed were: &quot;Hurricane Felix&quot;, &quot;Pieces of Gold&quot;, &quot;Wondrous Miracle&quot;, &quot;Fleeing to Mexico&quot;, &quot;It&amp;#039;s Not Worth It&quot;, &quot;Long Days and Vague Clues&quot;, &quot;2001&quot;, and &quot;Fucking Smile Pt. 2.,&quot; the final song being a reference to a b-side from the El Cielo sessions entitled &quot;Fucking Smile.&quot; In the same announcement, dredg said that they will debut some of the new songs during a handful of live shows in California, during the first week of April.\n\nAt said shows, new songs, as labeled on the set lists, included &quot;Push Away,&quot; &quot;Ireland,&quot; &quot;It&amp;#039;s Not Worth It,&quot; &quot;Quotes,&quot; &quot;Wu,&quot; and some short musical interludes. Variations of &quot;Symbol Song,&quot; &quot;Whoa Is Me&quot; and &quot;Movement I&quot; were also played with the main guitar parts replaced with a horn section consisting of Ben &quot;King&quot; Perkoff on Tenor Saxophone and Terry &quot;The Bari&quot; Forgette on Baritone Saxophone. &quot;Matroshka (The Ornament)&quot; was performed for the first time during these four shows.\n\nOn July 8, 2007, frontman Gavin Hayes posted a MySpace bulletin with new information on a forth-coming album and tour. The band will tour the West Coast in September and then enter the studio to finish off the fourth studio album for a first half release in 2008. Hayes said that the band has 12-15 songs that may or may not make the final cut, with more songs expected to be written during the recording process. Of the songs previously performed or mentioned in other updates, only &quot;Ireland&quot;, &quot;Quotes&quot;, &quot;Wondrous Miracle&quot;, and &quot;Push Away&quot; are listed as being worked on. A new song titled &quot;Light Switch&quot; also might make the cut.\n\nMoniker\n\nThe name dredg comes from the English word dredge, which in its verbal usage, means to unearth or widen/deepen a river or channel (the device used for doing this is also called a dredge). The band picked the name in its earlier, heavier days, when they thought it was very descriptive of their sound.\n\nMembers\n\n* Gavin Hayes - Vocals, Slide Guitar\n* Drew Roulette - Bass\n* Mark Engles - Guitar\n* Dino Campanella - Drums, Piano, Organ\n\nDiscography\n\nStudio albums\n\n* Leitmotif, 1999 (re-released 2001)\n* El Cielo, 2002\n* Catch Without Arms, 2005\n\nEPs\n\n* Conscious, 1996\n* Orph, 1997\n* Extended Play for the Eastern Hemisphere, 2002\n\nLive\n\n* Live at the Fillmore, 2006\n\nInternet EPs\n\n* &quot;Sony Connect Sets&quot; (2005)\n* &quot;Napster Sessions&quot; (2007)\n\nOther\n\n* Industry Demos, 2001\n* Coquette Demo, 2004\n* Bug Eyes CD Sampler, 2005\n* Bug Eyes 7&quot; Vinyl, 2005\n\nDVDs\n\n* Crickets, 2003\n* Live from the Henry Fonda Theater, 2005\n\nMusic Videos\n\n* &quot;Same Ol&amp;#039; Road&quot; (2002)\n* &quot;Of The Room&quot; (2003)\n* &quot;Bug Eyes&quot; (2005)\n\n--------------------------------------\n\nThis torrent includes Dredg&amp;#039;s 2005 album, &quot;Catch Without Arms&quot; in 192 kb/s mp3 format, fully tagged and the album art embedded into the mp3s in MediaMonkey 2.5.5.\n\nEnjoy! Please seed for as long as possible!","torrent":{"xt":"urn:btih:0bf86a8a95043d7db02736a23d745c906e82c058","amp;dn":"Dredg+-+Catch+Without+Arms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bf86a8a95043d7db02736a23d745c906e82c058","infoHashBuffer":{"type":"Buffer","data":[11,248,106,138,149,4,61,125,176,39,54,162,61,116,92,144,110,130,192,88]},"announce":[],"urlList":[]}}