{"title":"Command &amp; Conquer3 mappack. (10 maps)","uid":3763565,"size":7227321,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d2950ed1204bbbe2d7a156abd443ea51d9838c6&amp;dn=Command+%26+Conquer3+mappack.+%2810+maps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mastergnu","files":12,"time":1186321997,"description":"Command &amp; Conquer Mappack.\n=======================================\n\n\nHow do I install those maps?:\n1. Unrar maps.zip to C:\\Documents and Settings\\USERNAME\\Application Data\\Command &amp; Conquer 3 \n\nTiberium Wars\\Maps, where you exchange USERNAME with the username on your computer.\n2.  PLay the game!\n\n=======================================\nMaps featured:\n2 players:\nBreach\nPicture: http://img234.imageshack.us/img234/6714/breachcj7.jpg\nA small desert map. There is four different ways to the opponent. Two very tight ways on the sides of the map where there is only room for one tank widthwise. One wide way straight forward under a bridge, and one over the bridge. Each player starts with two blue tiberiums fields and four tiberium spikes.\n\n\n3 players:\nArrie17-de\nPicture: http://img234.imageshack.us/img234/6127/arrie17dehm2.jpg\nA red zone map with great atmosphere. Designed for three players where each player start with 2 green tiberium fields and then will have to fight for the other six tiberium spikes and two tiberium fields.\n\nCenter of Attention\nPicture: http://img222.imageshack.us/img222/3406/centerofattentionkq7.jpg\nA grass map with only one way to the other opponents, a medium-large tableland in the middle. Though, since the map is very tight you might still be able to shoot on the opponents over the rivers that divide each other. Much action promised on this map. \n\n4 players\nEat tiberium\nPicture: http://img171.imageshack.us/img171/923/eattiberiumot8.jpg\nA very dark misty map. At the beginning, 112 tiberium spikes will explode leaving most the map covered in green tiberium, forcing each player to harvest to be able to expand.\n\nFour Seasons\nPicture: http://img167.imageshack.us/img167/9346/fourseasonsvq3.jpg\nFour different start positions, each with their one exclusive design. One park, one tarmac, one desert and one forest-position. In the middle there is 4 tiberium fields. The one who manages to take control of theese will have a large advantage for the victory.\n\nFour way Fighting\nPicture: http://img215.imageshack.us/img215/7821/fourwayfightingap8.jpg\nA symmetrical map. Four different islands all connected to each other, with three different natural bridges going from each island to another. Each player starts with two blue tiberium fields and will have to expand to someone else territory to get more.\n\nDeep\nPicture: http://img171.imageshack.us/img171/7498/deeppd4.jpg\nTwo sides with two players on each side and a small river dividing them. You will have to fly to get to the other side. Air-battles are hard. Superweapons, stealth and the elimination of your opponents tiberium spikes will be keys to win.\n\nDeep2\nPicture: http://img234.imageshack.us/img234/7448/deep2vj9.jpg\nSame as above, but with two small land-passages to get over to the other side.\n\nInto the Breach\nPicture: http://img167.imageshack.us/img167/5951/intothebreachnm0.jpg\nA snow-map. This is inspired by a Warhammer 40k-map with the same map. Mountains are dividing the map in two, with a large breach as the only way to get to the other side. No player have any tiberium fields for themselves. On each side of the map there are two to share between the players and in the breach there is one more. Controlling that one will be a key to victory.\n\n6 players\nBambi fields\nPicture: http://img234.imageshack.us/img234/1903/bambifieldsor1.jpg\nA large and beautiful six-player map, filled with details to look at. Each player starts with two green tiberium fields and a tiberium spike and there are no additional resources. If you are playing free for all, &quot;expand or die&quot; is a good summary. Playing 3vs3 there is a grass-part of the map and a sand-part that are supposed to fight against eachother. Be careful with your tiberium spikes though. Most of them are placed in positions that are very hard to defend.","torrent":{"xt":"urn:btih:0d2950ed1204bbbe2d7a156abd443ea51d9838c6","amp;dn":"Command+%26+Conquer3+mappack.+%2810+maps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d2950ed1204bbbe2d7a156abd443ea51d9838c6","infoHashBuffer":{"type":"Buffer","data":[13,41,80,237,18,4,187,190,45,122,21,106,189,68,62,165,29,152,56,198]},"announce":[],"urlList":[]}}