{"title":"Frank Zappa 8-May 1974, Edinboro State College, Edinboro, PA SBD","uid":3373546,"size":688242582,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d44294c59017742028e357c77b11f67a86d057b&amp;dn=Frank+Zappa+8-May+1974%2C+Edinboro+State+College%2C+Edinboro%2C+PA+SBD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zappateer","files":16,"time":1124803289,"description":"8-May 1974, Edinboro State College, Edinboro, PA \n125 min, SBD, A-/B+ \nCosmik Debris, Pygmy Twylyte, Idiot Bastard Son, Cheepnis, Inca Roads, Montana, Dupree's Paradise (incl. Octandre, Blue Moon, Lohengrin, Can't Afford No Shoes riff), It Can't Happen Here, Hungry Freaks Daddy, You're Probably Wondering Why I'm Here, How Could I Be Such A Fool?, Wowie Zowie, Let's Make The Water Turn Black, Harry You're A Beast, Orange County Lumber Truck, Oh No, Son Of Orange County/More Trouble Every Day (parts on R&amp;E), Camarillo Brillo \n\n\nLineage: Sbd &gt; cassette &gt; cassette &gt; cdr &gt; flac\n\n\n*NOISE REDUCTION AND OTHER AUDIO ENHANCEMENTS !\nIf you like noise and distortion do not download !\n                    \n                        *WARNING/GUARANTEE\n \nThis Torrent contains audio which a truly free society would neither fear nor suppress.In some socially retarded areas, audio fanatics and ultra-conservative lossless organizations violate your First Amendment Rights by attempting to bad mouth noise reduction. We feel that this is un-Constitutional and un-HUMAN.\n As an alternative to these government-supported programs (designed to keep you docile and ignorant), zappateer is pleased to provide stimulating digital audio entertainment for those of you who have outgrown the noise and distortion of poorly transferred and mastered audience recordings.\n The language and concepts contained herein are GUARANTEED NOT TO CAUSE ETERNAL TORRENT IN THE PLACE WHERE THE GUY WITH THE HISS AND THE DISTORTION AND OVER EQ'ED CRAP SEED their TORRENTS (www.zappateerS.com )\n This guarantee is as real as the threats of the Audio fundamentalists who use attacks on noise reduction in their attempt to transform the zappa fans into a society of mp3 sourced noisey nincompoops (in the name of stupidity). If there is a hell, its hiss and noise waits for them, Not us.\n\n *\nMy transfers are done with audigy 2 sound card 24 bit 96 khz TRANSFERRED @ 48 KHZ  24 bit\nsony d-6 cassette and monster cables all mastering editing and sample conversion done with sony soundforge and waves direct x 24 bit plugins cds were burned using soundforge cd architech\n\n\nFOR THOSE OF YOU WHO LIKE MY TORRENT THANKS AND ENJOY !\n\nTHOSE THAT DO NOT ITS REALLY SIMPLE GO FUCK YOURSELF !\n\n\n\ngot requests check out the list !\n\nhttp://home.swipnet.se/fzshows\n\n\n\nYES FOLKS THATS RIGHT I HAVE ALL THESE SHOWS 50% OF THEM FROM MULTIPLE SOURCES !\n\n\n\nMAYBE NEXT I WILL GET SOME RARE VIDEO'S OUT","torrent":{"xt":"urn:btih:0d44294c59017742028e357c77b11f67a86d057b","amp;dn":"Frank+Zappa+8-May+1974%2C+Edinboro+State+College%2C+Edinboro%2C+PA+SBD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d44294c59017742028e357c77b11f67a86d057b","infoHashBuffer":{"type":"Buffer","data":[13,68,41,76,89,1,119,66,2,142,53,124,119,177,31,103,168,109,5,123]},"announce":[],"urlList":[]}}