{"title":"downy - Mudai 3 [2003] MP3 192kbps","uid":4008384,"size":58101763,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d52f1a3cb657a6c92cc9e145e830006b8e4fc36&amp;dn=downy+-+Mudai+3+%5B2003%5D+MP3+192kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dkords","files":10,"time":1201912395,"description":"01 - tetsu no fuukei\t\t\n02 - Anarchy Dance\t\t\n03 - jojoufu\t\t\n04 - keijijougaku\t\t\n05 - akatsuki nite...\t\t\n06 - [ ]\t\t\n07 - zen\t\t\n08 - tsuki\t\t\n09 - meitei Freak\n &lt;a href=&quot;\nhttp://www.nippop.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nippop.com/&lt;/a&gt; says:\nRock bands have been using images to spice up their live performances ever since the psychedelic light shows of the &amp;#039;60s. But Downy is probably unique among rock bands in having one member (Zakuro) whose job description is ?image producer?. The aim of Zakuro and the four other members of Downy during their live shows is to create ?an amalgam of sound and images,? in which the highly atmospheric, hypnotic and at times menacing sound of the band is complemented by Zakuro&amp;#039;s relentless barrage of surreal imagery. Downy doesn&amp;#039;t use conventional stage lighting during live shows; instead, images are projected onto a white curtain at the back of the stage, with the possibility of improvisatory effects being created between the music and the images. Downy&amp;#039;s music stands on its own, however. A mesmerizing blend of loops, understated drum-and-bass, acidic guitar and lead singer Robin Aoki?s sometimes melancholy, sometimes apocalyptic voice, Downy&amp;#039;s musical style is reminiscent of Radiohead, but is generally more spacey and ethereal than Thom Yorke and co. Sometimes, though, Downy pulls out all the stops and gets down to a kind of hard metallic thrashing that brings Joy Division to mind. In 2001 Downy released their first album, Mudai (which means ?Untitled? ? Downy have used the same non-title for the three albums it has released since their debut set), and since then they&amp;#039;ve become highly respected by the Japanese underground music cognoscenti. A key contributor to Downy&amp;#039;s soundcscapes is engineer Toshihiko Miyoshi, who has worked with DJ Krush, Tha Blue Herb and Zeebra.","torrent":{"xt":"urn:btih:0d52f1a3cb657a6c92cc9e145e830006b8e4fc36","amp;dn":"downy+-+Mudai+3+%5B2003%5D+MP3+192kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d52f1a3cb657a6c92cc9e145e830006b8e4fc36","infoHashBuffer":{"type":"Buffer","data":[13,82,241,163,203,101,122,108,146,204,158,20,94,131,0,6,184,228,252,54]},"announce":[],"urlList":[]}}