{"title":"Tanki Vtoroj mirovoj: T-34 protiv Tigra (RUSSIAN) [Simuljator ta","uid":3922806,"size":905488373,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d8bf8623575af777c980d364ce8b3b53e9a1e49&amp;dn=Tanki+Vtoroj+mirovoj%3A+T-34+protiv+Tigra+%28RUSSIAN%29+%5BSimuljator+ta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ex_Exist","files":2,"time":1196905763,"description":"God vypuska: 2007 \nZHanr: Tankovyj simuljator \nRazrabotchik: G5 Software \nPlatforma: PC \nOpisanie: Otgremela bitva na Kurskoj duge, sovetskie tankovye chasti zajavili o sebe kak o groznoj sile, a nemeckie vojska nachali otstuplenie. Operacija &quot;Bagration&quot; 1944 goda stala odnoj iz kljuchevyh operacij SSSR v hode protivostojanija sovetskoj i fashistskoj voennoj tehniki na territorii Belorussii. Igra pozvolit posmotret&amp;#039; na jeto sobytie glazami dvuh protivoborstvujuwih storon: v dvuh razlichnyh kampanijah za SSSR i za Vermaht, po shest&amp;#039; missij kazhdaja, igroku budut predostavleny dva znakovyh dlja togo vremeni tanka. Postignut&amp;#039; vse premudrosti upravlenija znamenitym sovetskim srednim tankom T-34 i tjazhelym nemeckim tankom T-6 TIGR iz kresla voditelja, koordinirovat&amp;#039; dejstvija svoego jekipazha s mesta komandira tanka, vesti razrushitel&amp;#039;nyj ogon&amp;#039; po protivniku s mesta navodchika, vybiraja podhodjawij snarjad iz neskol&amp;#039;kih vidov boepripasov - vse jeto vozmozhno kak pri vide ot pervogo lica, tak i s vneshnej kamery. \n \nOdnim iz interesnyh novshestv igry javljaetsja detal&amp;#039;no prorabotannyj inter&amp;#039;er tankov, dostupnyh dlja upravlenija. Osnovyvajas&amp;#039; na foto-materialah, rasskazah ochevidcev i pri aktivnom uchastii zapadnogo kom&amp;#039;juniti, kokpity byli maksimal&amp;#039;no priblizheny k original&amp;#039;nym kak po vneshnemu vidu, tak i po funkcional&amp;#039;nosti. S ljubogo mesta: voditelja, navodchika ili komandira - vozmozhno, nabljudat&amp;#039; za rabotoj vseh jelementov i organov upravlenija. Dvizhuwiesja rychagi, migajuwie lampochki, drozhawie strelki priborov, process zarjadki orudija - vse jeto prorabotano do melochej i pozvoljaet igre byt&amp;#039; polnocennym simuljatorom. \n \nV sozdanii lokacij byli ispol&amp;#039;zovany mnogochislennye memuary uchastnikov, opisanija operacii Â«BagrationÂ», a takzhe bol&amp;#039;shoe kolichestvo illjustrativnyh materialov, po kotorym vosstanavlivalas&amp;#039; ne tol&amp;#039;ko mestnost&amp;#039;, no i obrazcy tehniki i jekipirovki, predstavlennye v igre. Dlja vossozdanija realistichnogo upravlenija i fiziki dvizhenija tankov i ostal&amp;#039;noj voennoj tehniki ispol&amp;#039;zovalas&amp;#039; samaja podrobnaja tehnicheskaja dokumentacija. Pri dvizhenii tanka uchityvajutsja mownost&amp;#039; dvigatel&amp;#039;noj ustanovki, kolichestvo peredach i peredatochnye chisla transmissii, massa tanka, sceplenie gusenic s gruntom, centr massy tanka, stroenie podveski. Realistichnaja ballistika prinimaet vo vnimanie massu i tip snarjada, ego nachal&amp;#039;nuju skorost&amp;#039;, silu tjazhesti. \n \nIgroka ozhidaet ne tol&amp;#039;ko maksimal&amp;#039;naja realistichnost&amp;#039; predstavlennoj tehniki, no i realistichnost&amp;#039; boja, harakternogo dlja teh let. JEto dostigaetsja za schet ispol&amp;#039;zovanija v boju bronetransporterov, avtomobilej, artillerii, samoletov i, konechno zhe, tankov. V uslovijah boja ispol&amp;#039;zujutsja realistichnye specjeffekty: vzryvy, dym, razrushenie ob#ektov s razlichnoj stepen&amp;#039;ju nanosimyh povrezhdenij. Dlja razrushenija ob#ektov igrok volen primenit&amp;#039; ne tol&amp;#039;ko osnovnoj kalibr tanka i bortovoj pulemet, no i ispol&amp;#039;zovat&amp;#039; korpus kak taran. Na pole boja igrok mozhet smotret&amp;#039; iz kabiny v ee realistichnom ili virtual&amp;#039;nom ispolnenii, a takzhe ispol&amp;#039;zovat&amp;#039; vozmozhnost&amp;#039; vida ot tret&amp;#039;ego lica ili izmenjaemyj vid kamery. \n \nV igre realizujutsja takie graficheskie jeffekty kak dinamicheskie teni, selfshading, bump maps, specular maps, depth of field, jeffekty glow i bloom. Tehnologii, kotorye ispol&amp;#039;zujutsja v igre, pozvoljajut vossozdat&amp;#039; teatr voennyh dejstvij na territorii svyshe 40 kv. km, a takzhe vyvesti na nej desjatki tysjach derev&amp;#039;ev samoj vysokoj detalizacii. \n \nKljuchevye osobennosti igry: \n \n* Nastojawij tankovyj simuljator. Upravlenie tankom s mest: voditelja, navodchika, komandira; upravlenie ot pervogo ili ot tret&amp;#039;ego lica. CHestnaja fizika dvizhenija tankov i vzaimodejstvija ih s okruzhajuwim mirom, realistichnaja ballistika. Autentichnye kokpity: detal&amp;#039;no prorabotannyj inter&amp;#039;er tankov, animirovannye organy upravlenija i datchiki. \n\n* Tanki, dostupnye dlja upravlenija: T-34 i &quot;Tigr&quot;. Tehnika v igre: T-34/76, T-34/85, Pz.IV, Pz.VI Tiger, Sd.Kfz 251, M3A1, ZIS-5, Opel Blitz, ZIS-3, Pak.40, Il-2, \nFW-190 \n* Setevaja igra. LAN i cherez Internet (GameSpy) do 16 igrokov odnovremenno. Dva rezhima: skirmish i cooperative. \n* Realistichnaja grafika i ogromnye landshafty: za grafiku otvechajut vse sovremennye tehnologii v ramkah DirectX9, a razmery landshaftov pozvoljajut s legkost&amp;#039;ju zabludit&amp;#039;sja na territorii. \n* Razrushaemost&amp;#039; na urovnjah: stroenija, tehnika, derev&amp;#039;ja - razrushajutsja ne tol&amp;#039;ko ot popadanija snarjada, no i ot vzaimodejstvija pri stolknovenijah i naezdah. Vysokokachestvennye jeffekty: vzryvy, zadymlenie, bliki, raznye uslovija osvewenija. \n* Dve kampanii po 6 missij: odna za SSSR, vtoraja za Vermaht. Dopolnitel&amp;#039;nye urovni dlja mnogopol&amp;#039;zovatel&amp;#039;skoj igry. \n\nSistemnye trebovanija: \nMinimal&amp;#039;nye: CPU 3.0 GGc; 512 Mb RAM; nVidia GeForce 6600/ ATI Radeon 9600 ili analogichnye \nOptimal&amp;#039;nye: CPU 3.8 GGc; 1024 Mb RAM; nVidia GeForce 8800GT/ ATI Radeon X1600\n ","torrent":{"xt":"urn:btih:0d8bf8623575af777c980d364ce8b3b53e9a1e49","amp;dn":"Tanki+Vtoroj+mirovoj%3A+T-34+protiv+Tigra+%28RUSSIAN%29+%5BSimuljator+ta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d8bf8623575af777c980d364ce8b3b53e9a1e49","infoHashBuffer":{"type":"Buffer","data":[13,139,248,98,53,117,175,119,124,152,13,54,76,232,179,181,62,154,30,73]},"announce":[],"urlList":[]}}