{"title":"The Spikedrivers","uid":4004514,"size":55010686,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e3dd5b31b0a56210a0169d82ff11b36609dc6f8&amp;dn=The+Spikedrivers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ontic","files":12,"time":1201744670,"description":"In 2003 a new sound sprang up in the Rust Belt; a raucous, down-and-dirty sound, an intoxicating and gritty sound that pulled people in droves to the dance floors across the Midwest. It was the sound of The Spikedrivers playing their unique blend of swinging, bluesy, upbeat, country-fried rock Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½nÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ roll. Front man Jesse HenryÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s unique, original and down-home song writing meets the electrified ruckus and wild precision of the backing band similar to what might have been if Woody Guthrie had led NRBQ.\n\nIn 2007 with one live album and their first studio album just released The Spikedrivers took their show on the road. They played in eleven states rocking the shores of Massachusetts, the bright lights of New York, and the fields of Illinois. The band gained fans across the East Coast and the Midwest. Along the way The Spikedrivers released their second live CD, Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½Live in New York CityÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ which showcased how easily The Spikedrivers can grab hold of an audience in a packed club and turn them instantly to avid fans.\n\nThe Spikedrivers front man is Jesse Henry, who was raised Mennonite in rural Northwest Ohio and who spent his early years working on grain elevators and learning songs of the great American Troubadours. He brings his electrifying stage presence and musicianship wherever he roams. Megan Palmer, a registered nurse by day, turns fiddle playing superhero by night; serenading the audience with a sultry voice and ravishing them with white-hot fiddle leads. Steve Sweney, best known for his cosmic guitar work with the band Ekoostik Hookah, gets to showcase a different side of his playing. He strips down to just amp and guitar and listeners get to relish the raw tone and intensity. John Boestler the guitar wizard is the newest member but brings 40-plus years of experience as well as being SweneyÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s early mentor. The rhythm section and backbone holding it all together are Nate Anders and Steven Fox. A vibraphonist and college educator, Nate beats the skins like a pack of hounds is on his tail all the while booming baritone harmony. Fox brings his lightning fast bow acrobatics and hard-thumping sound on the upright bass to adventurous levels as well as singing his sideburns off.\n\nIn the coming year The Spikedrivers look to continue their success on the road spreading their infectious joy to all who will listen, and to some who wonÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½t. Also, they will return to the studio to release their second studio album filled with ear turning tunes sure to have people dancing in their homes waiting for the next live performance. We hope to see you there.\n\nBuy The Spikedrivers\\\\\\&amp;#039; self-titled studio debut at CD Baby:","torrent":{"xt":"urn:btih:0e3dd5b31b0a56210a0169d82ff11b36609dc6f8","amp;dn":"The+Spikedrivers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e3dd5b31b0a56210a0169d82ff11b36609dc6f8","infoHashBuffer":{"type":"Buffer","data":[14,61,213,179,27,10,86,33,10,1,105,216,47,241,27,54,96,157,198,248]},"announce":[],"urlList":[]}}