{"title":"Pilot Guides - Finland and the Baltic States [RQ]","uid":3756893,"size":1083662764,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0f9352e51721dbcc4313b75b4a5ed017d67f887c&amp;dn=Pilot+Guides+-+Finland+and+the+Baltic+States+%5BRQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rundaqvisten","files":1,"time":1185728900,"description":"Neil Gibson journeys through the Baltic States of Lithuania, Latvia and Estonia and then to Finland. He begins his journey in Vilnius, the capital of Lithuania. It is the biggest Baltic capital and its large Russian population means it&amp;#039;s hard to forget that until the beginning of the 1990s Lithuania was under Soviet rule.\n\n\nAfter looking around a waste ground full of crumbling Soviet statues that were pulled down and vandalised when Lithuania declared its independence, Neil visits the huge Garunai flea market. Traders come from all over Eastern Europe and it&amp;#039;s possible to pick up some good bargains - as long as you can pay in American dollars.\n\nNeil discovers that paganism is experiencing a revival in Lithuania. He travels to the small town of Kernave to help celebrate the biggest event in the Pagan calender - Midsummer&amp;#039;s night.\n   \nTravelling north, Neil makes one more stop in Lithuania - the city of Siauliai, famous for its hill of more than a million crosses. He meets a woman who explains that pilgrims have come here for over 500 years to leave crosses in the memory of those who have died. It survived the Soviet era despite being bulldozed at least three times.\n\n\nNeil hops on a bus and travels over the border into Latvia. He discovers an Olympic bob-sleigh track, where he has the terrifying experience of travelling three quarters of a mile in just a minute.\n \n\nIn Riga, the capital of Latvia, also known as the &amp;#039;Paris of the Baltics&amp;#039;, Neil buys some amber, a gem which is washed up on the Baltic coastline. Just outside Riga is Salaspils, the former concentration camp. Thousands of Eastern Europeans were held here during World War II before being transported to other concentration camps, and the site is now a memorial to the thousands who died.\n\nEstonia is the next stop and Neil goes to Setumaa in the south east of the country, home to the Setus. Since 1940 Setumaa has been divided between Russia and Estonia, but despite this it is still like a separate country, with its own language, culture and religious traditions. The Setus are famous for their unearthly throat singing, as Neil discovers when he arrives in time for the Setu Song Festival.\n\n\nNext Neil hitches a lift in a motorbike sidecar, west to Parnu on the Baltic coast, where he stays on an Estonian farm. He then takes a ferry to the Estonian Islands to visit a famous Shaman, Vigala Sass. Sass explains his form of Shamanism to Neil and performs a cleansing ritual intended to keep Neil safe for the rest of his journey.\n\nAfter a quick stop in medieval Tallinn, capital of Estonia, Neil continues his journey to Finland. After some sightseeing in the capital, Helsinki, he travels north to scenic Karelia. Neil spends the night sleeping in a lean-to in the forest and sets off to meet Finland&amp;#039;s most famous bear hunter, Vaino. Vaino has killed 36 bears and has kept all their skulls.\n\nNeil&amp;#039;s journey ends in Sonkarjarvi, where the annual Wife Carrying Competition is taking place. Neil staggers along the course carrying his wife for the day, hoping to win the prize of a mobile phone and, the biggest incentive - the wife&amp;#039;s weight in beer. If that is, he lives to claim it!\n \n","torrent":{"xt":"urn:btih:0f9352e51721dbcc4313b75b4a5ed017d67f887c","amp;dn":"Pilot+Guides+-+Finland+and+the+Baltic+States+%5BRQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f9352e51721dbcc4313b75b4a5ed017d67f887c","infoHashBuffer":{"type":"Buffer","data":[15,147,82,229,23,33,219,204,67,19,183,91,74,94,208,23,214,127,136,124]},"announce":[],"urlList":[]}}