{"title":"Custom.Guitar.Hero.2.with.GH1andGH80s.XBOX360-SL-X","uid":4007267,"size":7572902899,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:0fe688c58801f310b0a7ed907e504abd56f99219&amp;dn=Custom.Guitar.Hero.2.with.GH1andGH80s.XBOX360-SL-X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"slutsta","files":77,"time":1201895106,"description":"Custom.Guitar.Hero.2.with.GH1andGH80s.XBOX360-SL-X\n              \n\nAfter the positive reception to the first custom Guitar Hero release, SL-X now brings you the original Guitar Hero\nand the expansion Guitar Hero: Rocks the 80&amp;#039;s in a single DVD compilation. That&amp;#039;s right, ALL 60 songs from both games&amp;#039;\ncareer paths have been converted for use on the X-Box 360. Due to the editing contstraints of the Guitar Hero II X-Box\n360 ISO, these songs are in no particular order based off tiers. We did not bother with the bonus tracks from the original\nGuitar Hero and the developers were too lazy to include any bonus tracks on the 80&amp;#039;s disc anyway. All song support all\ndifficulty levels. All songs include Face-off and Pro Face-off multiplayer modes. All songs from Guitar Hero: Rocks\nthe 80&amp;#039;s contain bass tracks for multiplayer co-op. Throw out your Playstation 2 and enjoy this hot SL-X release!!!\n\nTier 1 \nThe Exies - Hey You Surrender GH 1 E,M,H,X \nDeep Purple - Smoke on the Water Possum Kingdom GH 1 E,M,H,X \n.38 Special - Hold on Loosely Heart-Shaped Box GH 80s E,M,H,X \nRed Hot Chili Peppers - Higher Ground Salvation GH 1 E,M,H,X \nJoan Jett - I Love Rock &amp; Roll Strutter GH 1 E,M,H,X \nShout at the Devil Shout at the Devil E,M,H,X \n\nTier 2 \nExtreme - Play With Me Mother GH 80s E,M,H,X \nOzzy Osbourne - Bark at the Moon Life Wasted GH 1 E,M,H,X \nWhite Zombie - Thunderkiss &amp;#039;65 Cherry Pie GH 1 E,M,H,X \nWoman Woman E,M,H,X \nIncubus - Stellar You Really Got Me GH 1 E,M,H,X \nLimozeen - Because It&amp;#039;s Midnite Tonight I&amp;#039;m Gonna Rock You Tonight GH 80s E,M,H,X \n\nTier 3 \nStevie Ray Vaughn - Texas Flood Carry On Wayward Son GH 1 E,M,H,X \nBlue Oyster Cult - Godzilla Search and Destroy GH 1 E,M,H,X \nDio - Holy Diver Message in a Bottle GH 80s E,M,H,X \nQueens of the Stone Age - No One Knows Billion Dollar Babies GH 1 E,M,H,X \nThe Donnas - Take It Off Them Bones GH 1 E,M,H,X \nWhite Lion - Radar Love War Pigs GH 80s E,M,H,X \n\nTier 4 \nBad Religion - Infected Monkey Wrench GH 1 E,M,H,X \nTwisted Sister - I Wanna Rock Hush GH 80s E,M,H,X \nMotorhead - Ace of Spades Girlfriend GH 1 E,M,H,X \nThe Ramones - I Wanna Be Sedated Who Was in My Room Last Night GH 1 E,M,H,X \nCan&amp;#039;t You Hear Me Knockin&amp;#039; Can&amp;#039;t You Hear Me Knockin&amp;#039; E,M,H,X \nFlock of Seagulss - I Ran (So Far Away) Sweet Child O&amp;#039; Mine GH 80s E,M,H,X \n\nTier 5 \nEric Clapton - Crossroads Rock and Roll Hoochie Koo GH 1 E,M,H,X \nQueen - Killer Queen Tattooed Love Boys GH 1 E,M,H,X \nPoison - Ain&amp;#039;t Nothin&amp;#039; but a Good Time John the Fisherman GH 80s E,M,H,X \nAnthrax - Caught in a Mosh Jessica GH 80s E,M,H,X \nThe Go-Go&amp;#039;s - We Got the Beat Bad Reputation GH 80s E,M,H,X \nMegadeth - Symphony of Destruction Last Child GH 80s E,M,H,X \n\nTier 6 \nAsia - Heat of the Moment Crazy on You GH 80s E,M,H,X \nTrippin&amp;#039; On a Hole in a Paper Heart Trippin&amp;#039; On a Hole in a Paper Heart E,M,H,X \nFaster Pussycat - Bathroom Wall Dead! GH 80s E,M,H,X \nScandel - The Warrior Killing in the Name GH 80s E,M,H,X \nBoston - More Than a Feeling Freya GH 1 E,M,H,X \nDead Kennedys - Police Truck Stop GH 80s E,M,H,X \n\nTier 7 \nKrokus - Ballroom Blitz Madhouse GH 80s E,M,H,X \nSkid Row - 18 and Life The Trooper GH 80s E,M,H,X \nIron Maiden - Wrathchild Rock This Town GH 80s E,M,H,X \nHelmet - Unsung Laid to Rest GH 1 E,M,H,X \nPsychobilly Freakout Psychobilly Freakout E,M,H,X \nThe Vapors - Turning Japanese YYZ GH 80s E,M,H,X \n\nTier 8 \nJudas Priest - Electric Eye Beast and the Harlot GH 80s E,M,H,X \nPantera - Cowboys From Hell Carry Me Home GH 1 E,M,H,X \nBurning Brides - Heart Full of Black Institutionalized GH 1 E,M,H,X \nMisirlou Misirlou E,M,H,X \nAccept - Balls to the Wall Hangar 18 GH 80s E,M,H,X \nThe Police - Synchonicity II Free Bird GH 80s E,M,H,X \n\nTier 9 (Bonus) \nBlack Sabbath - Ironman Raw Dog GH 1 E,M,H,X \nArterial Black Arterial Black E,M,H,X \nJimi Hendrix - Spanish Castle Magic Collide GH 1 E,M,H,X \nSum41 - Fat Lip Drink Up GH 1 E,M,H,X \nEddie Money - Shakin&amp;#039; Elephant Bones GH 80s E,M,H,X \nRatt - Round and Round Fall of Pangea GH 80s E,M,H,X \nFTK FTK E,M,H,X \nZZ Top - Sharp-Dressed Man Gemini GH 1 E,M,H,X \nDavid Bowie - Ziggy Stardust Kicked to the Curb GH 1 E,M,H,X \nFranz Ferdinand - Take Me Out Push Push (Lady Lightning) GH 1 E,M,H,X \nLaughtrack Laughtrack E,M,H,X \nBilly Squier - Lonely is the Night Less Talk More Rokk GH 80s E,M,H,X \nThe Romantics - What I Like About You Jordan GH 80s E,M,H,X \nMr. Fix It Mr. Fix It E,M,H,X \nThe New Black The New Black E,M,H,X \nScorpions - No One Like You One for the Road GH 80s E,M,H,X \nParasite Parasite E,M,H,X \nEdgar Winter Group - Frankenstein Radium Eyes GH 1 E,M,H,X \nQuiet Riot - Bang Your Head Red Lottery GH 80s E,M,H,X \nX - Los Angeles Six GH 80s E,M,H,X \nSoy Bomb Soy Bomb E,M,H,X \nOingo Boingo - Only a Lad The Light That Blinds GH 80s E,M,H,X \nAudioslave - Cochise Thunderhorse GH 1 E,M,H,X \nTrogdor Trogdor E,M,H,X \nWarrant - Seventeen X-Stream GH 80s E,M,H,X \nJudas Priest - You Got Another Thing Comin&amp;#039; Yes We Can GH 1 E,M,H,X \n\n\n\nSupport Harmonix, be sure to own a genuine copy of Guitar Hero 2!","torrent":{"xt":"urn:btih:0fe688c58801f310b0a7ed907e504abd56f99219","amp;dn":"Custom.Guitar.Hero.2.with.GH1andGH80s.XBOX360-SL-X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe688c58801f310b0a7ed907e504abd56f99219","infoHashBuffer":{"type":"Buffer","data":[15,230,136,197,136,1,243,16,176,167,237,144,126,80,74,189,86,249,146,25]},"announce":[],"urlList":[]}}