{"title":"Sahara Michael Palin","uid":4002936,"size":281460058,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1033b582a6cac37dfeae66bcc486c99f2a70556e&amp;dn=Sahara+Michael+Palin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"siinns","files":1,"time":1201659397,"description":"Fifty years after he was given his first book, Tales from the Arabian Nights, consummate traveler and Monty Python founding member Palin trekked to Francophone Africa, believing that the Sahara embodies &quot;the thin line between survival and destruction, the power to take life or to transform it.&quot; Fortunately for his readers, the Sahara seems to have transformed Palin (Around the World in 80 Days, Full Circle). This tie-in to the Bravo series airing in April consists of Palin&amp;#039;s journal entries, full of his trademark self-deprecating humor (writing about the far-removed city of Djenne, which a British tour group nonetheless infiltrated, Palin confesses that &quot;I know I shouldn&amp;#039;t feel this way, but when I&amp;#039;m asked if I&amp;#039;ve ever been to Stoke-on-Trent all my romantic illusions of desert travel begin to wilt&quot;). But Palin is also a piquant political observer (he notes that African women may be &quot;by nature more direct, more open, more honest and considerably less submissive than their menfolk expect them to be&quot;), and the Sahara&amp;#039;s exoticism frequently inspires him to craft beautiful descriptions (the bizarre &quot;battleship-grey&quot; baobab trees &quot;look like some prehistorical arboreal throwback, gnarled and twisted like old prize-fighters&quot;). Readers looking for engaging, detailed insight to the Sahara will hit paydirt here, although newcomers to Palin&amp;#039;s work may find themselves dismayed by his ubiquitous appearance in the photographs that dot nearly every page of this book.\n\n8 CDs.\nRAR.","torrent":{"xt":"urn:btih:1033b582a6cac37dfeae66bcc486c99f2a70556e","amp;dn":"Sahara+Michael+Palin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1033b582a6cac37dfeae66bcc486c99f2a70556e","infoHashBuffer":{"type":"Buffer","data":[16,51,181,130,166,202,195,125,254,174,102,188,196,134,201,159,42,112,85,110]},"announce":[],"urlList":[]}}