{"title":"[Kung Fu] In The Line Of Duty 6 aka Forbidden Arsenal (1991) - D","uid":3776163,"size":434750687,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:10f15c034aea00c7f862e3fcf9a3344d88816de2&amp;dn=%5BKung+Fu%5D+In+The+Line+Of+Duty+6+aka+Forbidden+Arsenal+%281991%29+-+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1187370532,"description":"In The Line Of Duty 6 aka Forbidden Arsenal (1991) - REMASTERED\n\nPlot:\tCynthia Khan plays a tough Hong Kong cop who teams up with two cops from Taiwan and Mainland China to bust a ring of dangerous international gun-smugglers.\n\nOverview:\tInspector Cheng Ao-Chun, a Taiwan sharpshooter, is on a mission to investigate an underground arsenal on Hai Han Island in Hong Kong. As it has been regarded as a base of coordinating all arms deals, public security officer Hua Chun Yung, a nimble fighter from China, is on the same mission. Thus, the two become undercover agents inside the syndicate. In one arms deal, Cheng and Hua have their identity exposed by Hong Kong inspector Yeung. Despite the Hong Kong government authorities&amp;#039; wish to repatriate them, the two insist on staying on security grounds. Hong Kong government submits but has asked Yeung to spy on their movements secretly in the territory. However, the three with different backgrounds confront against each other. Hua gets acquainted and falls in love with Edna, who is the sister of ringleader Marco. On the other hand, Hua tries to trap Marco through their relationship. Marco is eventually arrested during a fight with Yeung. The four are in deep emotion, as Yeung and Edna see Cheng and Hua off on their homeward journey.\n\nCast: \tCynthia Khan  ||  Waise Lee Chi-Hung  ||  Garry Chow Ging-Yeung  ||  Robin Shou Wan-Bo  ||  Rachel Lee Lai-Chun  ||  Do Siu-Chun  ||  Hui Siu-Hung  ||  Tse Wai-Kit  ||  Phillip Kwok Chun-Fung  ||  Ridley Tsui Bo-Wah  ||  Leung Gam-San  ||  Kong Long  ||  Lee Sam  ||  Rocky  ||  Lau Shung-Fung \n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:10f15c034aea00c7f862e3fcf9a3344d88816de2","amp;dn":"%5BKung+Fu%5D+In+The+Line+Of+Duty+6+aka+Forbidden+Arsenal+%281991%29+-+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10f15c034aea00c7f862e3fcf9a3344d88816de2","infoHashBuffer":{"type":"Buffer","data":[16,241,92,3,74,234,0,199,248,98,227,252,249,163,52,77,136,129,109,226]},"announce":[],"urlList":[]}}