{"title":"Venom - Demon (demo 1980) @ 160kbs [alcohol666]","uid":3363484,"size":13715456,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11e3fbea2340a807536b9c146ff672de4992402f&amp;dn=Venom+-+Demon+%28demo+1980%29+%40+160kbs+%5Balcohol666%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"satanshoer","files":3,"time":1122821124,"description":"Great sounding Demo from the legends of blackmetal - 80%\nWritten by unorthodoxkilla on February 27th, 2004\n\nWow what a great sounding demo. Very clean sounding and very professional. The tracks are Angel Dust ,Raise the Dead and Red Light Fever. I could see Angel Dust being on the 1st demo but was surprised by the other two tracks Especially since raise the dead Was not released untill the Black Metal album. The first track Angel Dust is really well done with a more distinctive sounding bass track, i really like this version it's a bit different voacally as well. but it is close to the Welcome to Hell version. Raise the Dead demo version is not as good as the Black metal version the music is different as the vocals and lyrics. The black metal version is more dark and evil like we are used to also the chours is done better as is a lively guitar solo. However i do find the demo version an interesting alternative. On the demo it sounds more like a rock anthem.\nLastly Red Light Fever demo is really good in fact it may be just as good if not better then the Welcome to hell version, it's more in your face and a lot more rock sounding, with great soloing in tact. The overall tempo on the demo is quite slower then the faster rendition that's found on welcome to hell .\nOverall i really enjoyed the demo, it actually has good audio production and some interesting takes on some classic songs Legions Unite !!\n\n\ninfo:[url]http://www.metal-archives.com[/url]","torrent":{"xt":"urn:btih:11e3fbea2340a807536b9c146ff672de4992402f","amp;dn":"Venom+-+Demon+%28demo+1980%29+%40+160kbs+%5Balcohol666%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11e3fbea2340a807536b9c146ff672de4992402f","infoHashBuffer":{"type":"Buffer","data":[17,227,251,234,35,64,168,7,83,107,156,20,111,246,114,222,73,146,64,47]},"announce":[],"urlList":[]}}