{"title":"Coast to Coast Radio Program! Commercial Free! Jan 6th thru Jan","uid":3994229,"size":990864868,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:11e9c31d27191588260c16632fe66fa2837d0361&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jan+6th+thru+Jan+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":90,"time":1201219763,"description":"I know, I know, WWWAAAYYY LATE!!! Sorry to all those out there who have been expecting these. I hope you all enjoy the last 18 broadcasts brought to you by none other than STOKEMAN! Download, SEED, and Enjoy! Until we meet again....\n\nSunday January 6th, 2008\nThe Field, Miracles &amp; Heart Emotions\nAuthor Gregg Braden discussed the science behind miracles, the existence of an energy field that connects everything, and the power of heart-based emotion. Miracles appear inexplicable to the laws of nature as we understand them, yet they could be linked... \nHost: George Noory\nGuest(s): Gregg Braden\n\nMonday January 7th, 2008\nMothman &amp; the Antichrist\nAuthor L. A. Marzulli discussed his research into the &amp;#039;Luciferian Conspiracy,&amp;#039; as well as Mothman encounters. The conspiracy, he explained, concerns a satanic entity who wants to be worshipped; he&amp;#039;ll take the form of the Antichrist, coming initially...\nHost: George Noory\nGuest(s): L. A. Marzulli, Robert Felix\n\nTuesday January 8th, 2008\nA Skeptic&amp;#039;s Investigations\nParanormal investigator and columnist Joe Nickell shared his skeptical take on a variety of cases. Differentiating his approach, he said that &quot;mystery mongers&quot; often have their minds made up that something inexplicable is taking place in so-called... \nHost: George Noory\nGuest(s): Joe Nickell, Isaac Bonewits\n\nWednesday January 9th, 2008\nConcealed Carry of Guns\nFounder of the think tank Good For The Country, Inc., John Longenecker presented the case for concealed carry of handguns in the United States. If a person is in a situation such as a school or mall shooting, there is a period of time (at least four... \nHost: George Noory\nGuest(s): John Longenecker, Paola Harris\n\nThursday January 10th, 2008\n2008 &amp; Compatible Numbers\nNumerologist Glynis McCants offered a forecast of what&amp;#039;s in store for 2008, reviewed her past comments about 2007, and spoke about number compatibilities. We are entering a &quot;1&quot; year (2 + 0 + 0 + 8 = 10 = 1). &quot;I&amp;#039;m excited about this year,&quot; she said,... \nHost: George Noory\nGuest(s): Glynis McCants, Daniel Durda\n\nFriday January 11th, 2008\nTime Travel\nIn the first hour and a half, George spoke with Steven Gibbs about his Hyper Dimensional Resonator (HDR), a machine that Gibbs claims makes time travel possible. Gibbs said the HDR was developed by his counterpart from an alternate future Earth and given... \nHost: George Noory\nGuest(s): Open Lines, Steven Gibbs\n\nSaturday January 12th, 2008\nAlien Contact &amp; End Times\nIan spoke with Miriam Delicado about her contact with extraterrestrial beings, their message for the world, and how it ties into the Hopi&amp;#039;s Blue Star Prophecy and the End Times. Delicado described a childhood abduction experience in which she was...\nHost: Ian Punnett\nGuest(s): Miriam Delicado, James Chiles\n\nSunday January 13th, 2008\nWizardry, Sorcery &amp; Strange Creatures\nPracticing Wizard Oberon Zell-Ravenheart talked about elements of magic and wisdom, as well as real and mythical creatures. In his recent book A Wizard&amp;#039;s Bestiary, he catalogues a variety of critters and creatures. The legendary sea monsters known as... \nHost: Ian Punnett\nGuest(s): Oberon Zell\n\nMonday January 14th, 2008\nEarth Changes Special\nA group of experts discussed earthquakes, volcanic eruptions, and climate change, and shared their predictions as to what we might expect in 2008 and beyond. First, geologist Jim Berkland and author/earthquake &amp;#039;sensitive&amp;#039; Cal Orey spoke...\nHost: George Noory\nGuest(s): Stan Deyo, Jim Berkland, Robert Trombley, Cal Orey, Peter Davenport, Peggy Sue Gerron\n\nTuesday January 15th, 2008\nAnimal Communications\nAppearing during the middle two hours, animal communicator Amelia Kinkade discussed her work helping humans understand the thoughts and emotions of animals through telepathy. Such communications can be viewed on the quantum level-- instead of separate... \nHost: George Noory\nGuest(s): Amelia Kinkade, Carol Simontacchi\n\nWednesday January 16th, 2008\nEdgar Cayce &amp; The Universe\nAstronomy writer James Mullaney discussed his book Edgar Cayce and the Cosmos, which examines the &quot;Sleeping Prophet&amp;#039;s&quot; readings about the universe. As a scientist, he was initially skeptical about the Cayce material (which was delivered in a trance state),...\nHost: George Noory\nGuest(s): James Mullaney, Seth Shostak\n\nThursday January 17th, 2008\nTheories of Atlantis\nAuthor Brad Steiger discussed his landmark work, Atlantis Rising, which was one of the first books to cover the study of lost civilizations and alien contact. Atlantis serves as a symbol in our collective conscious and represents a world or global civilization... \nHost: George Noory\nGuest(s): Brad Steiger, Dr. Doris Rapp\n\nFriday January 18th, 2008\nExtinction of Amphibians &amp; Coral Reefs\nDuring the first hour, investigative reporter Linda Moulton Howe discussed the ongoing decline of amphibians as well as the extinction of coral reefs. Nearly half of the world&amp;#039;s 6,000 amphibian species could be extinct by the end of this century,... \nHost: George Noory\nGuest(s): Open Lines, Linda Moulton Howe\n\nSaturday January 19th, 2008\nAlternate Quranic Text\nExpert in ancient manuscripts, Glenn Kimball discussed the life of Islamic Prophet Muhammad, the origin of the Quran, and new information about a lost photographic archive of an alternate Quranic text. Kimball also shared evidence that King Arthur&amp;#039;s brother... \nHost: Ian Punnett\nGuest(s): Glenn Kimball\n\nSunday January 20th, 2008\nBilly Meier&amp;#039;s ET Contacts\nUS media representative for ET contactee Billy Meier, Michael Horn, joined host George Knapp (email) for a discussion on the evidence to support the authenticity of Meier&amp;#039;s claims, and the new documentary The Silent Revolution of Truth. The film traces..\nHost: George Knapp\nGuest(s): Michael Horn\n\nMonday January 21st, 2008\nAliens &amp; the Antichrist\nAppearing during the middle two hours, author John Milor discussed his biblical research into aliens and the Antichrist. UFOs were mentioned in the Bible-- described as flying chariots with horses on fire, he said. According to his reading of... \nHost: George Noory\nGuest(s): John Milor, Gerald Celente\n\nTuesday January 22nd, 2008\nAlternative Energy Methods\nAerospace and defense systems developer Sir Charles Shults spoke about his latest research into alternative energy development. He&amp;#039;s formed an alliance with Worlds Nest to bring recycling of water and generation of power into homes and businesses world... \nHost: George Noory\nGuest(s): Charles Shults\n\nWednesday January 23rd, 2008\nSecret Door V\nA set of surprise guests joined us for one segment each in this special 4-hour program. In order of appearance: Dr. Betty Martini spoke about Hawaii&amp;#039;s attempt to ban Aspartame. The sweetener is addictive, leaches serotonin from the brain, and is... \nHost: George Noory\nGuest(s): Dr. Betty Martini, Michael Shedlock, Linda Moulton Howe, Scott Flansburg, David B. Sereda, Jim Karol, Lionel Fanthorpe, Howard Bloom","torrent":{"xt":"urn:btih:11e9c31d27191588260c16632fe66fa2837d0361","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jan+6th+thru+Jan+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11e9c31d27191588260c16632fe66fa2837d0361","infoHashBuffer":{"type":"Buffer","data":[17,233,195,29,39,25,21,136,38,12,22,99,47,230,111,162,131,125,3,97]},"announce":[],"urlList":[]}}