{"title":"300 SeCtIoN8 {Sharego.net}","uid":3760060,"size":1583339510,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1389b26ba0d27d141a15b61bc861ab568aea15c1&amp;dn=300+SeCtIoN8+%7BSharego.net%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SharegoRG","files":4,"time":1186009915,"description":"SeCtIoN8 SharegoRG is proud to bring you\n300\n\nx264 video, both the original audio track and the Directors commentary in AAC, the original chapters from the DVD and a nice versatile MP4 container.\n\nThis is for all those who love h.264 quality!\n\nIt is spring, 480 BC Persian King Xerxes, continuing his fathers, Darius, master plan to conquer the Hellenic city-states, arrives in Hellas. The previous Persian invasion and diplomatic attempts have already turned most northern Hellas tribes and states to the Persian side. But the people of Athens and Sparta, the largest Hellenic powers at the time, feel quite insulted by the Persian emissaries requesting their surrender to Xerxes and slay them. In Sparta, King Leonidas consults the local oracle, which gives two options: either a spartan king will have to be sacrificed or Sparta will be burned to the ground. A year earlier (481, BC) a panhellenic consortium of all southern city-states have already recognized the superiority of the spartan army (the best organized and trained army at the time) and have announced King Leonidas supreme commander of the combined Hellenic army. It is then decided that a small force should block Xerxes&amp;#039; way to southern Hellas in the Thermopylae passage.This passage was at that time 12 meters wide.The great historian Herodotus, possibly exaggerating, states that there were 1700000 Persians(their true number could be anywhere around 100000 and 1000000) against 7000 Hellenic hoplites and slaves, including the 300 men of the spartan king elite guard. King Xerxes waited for 4 days for the Hellenes to be frightened and eventually surrender and was quite astonished by his opponents complete apathy who Iwere following their daily program practicing and making their hair! After that Xerxes tried to convince Leonidas to drop weapons, give up his position, kneel before him and live on as a local governor under Xerxes. King Leonidas replied &quot;molon lave&quot;, which means &quot;Come and get them&quot;. Then the 3 days battle begun with the 300 Spartans, and 700 thespians (the other Hellenes where sent by Leonidas to protect passages to their flanks) slaying thousands of Persians with minimal losses. The whole Persian campaign would have fail if there wasn&amp;#039;t Efialtes who showed Xerxes a secret passage to the Hellenic flanks. After a final battle lead by king Xerxes himself the Hellenic force was completely slain and their heroism and glory was written forever in history. From the beginning of the battle the Hellenes buried their dead in the spot they fell dead. After the battle signs where made for the dead of each Hellenic faction. For the pelloponisians generally (including the 300 Spartans) the sign reads(free translation) &amp;#039;In this place 4000 thousand pelloponisians fought 30 millions), for the 300 Spartans(lakaedaemonians) especially the sign reads(free translation) &amp;#039;Oh foreigner tell the lakaedaemonians that we are buried here obeying their laws&amp;#039; meaning that they never hesitated and never retreated from the enemy. The impact of the battle was enormous for both sides. The Persians&amp;#039; morale dropped to zero and the Hellenes lost their fear for the Persian conqueror and organized their defense. After several successful battles the Hellenes ultimately defeated the Persian army and repelled their invasion in the Battle of plataea in 479 BC.\n\nIMDB link: &lt;a href=&quot; http://www.imdb.com/title/tt0416449/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0416449/&lt;/a&gt;\n\nAlright. Let&amp;#039;s have some Q and A:\n\nQ: Section 8, why are your mp4 releases so large?\n\nA: I can spell it out real simply. They are of very high quality. They have not been resized and shrunk to a horizontal resolution of 640 like many releases. They retain their original horizontal resolution of 720. If you compare these releases to the original DVD material I think you will be hard pressed to notice a difference. The difference is transparent to the human eye. I encode my movies to be the same quality as the original material when viewed on my 92 inch HD screen.\n\nDon&amp;#039;t forget to visit us at www.sharego.net!\n\nAVInaptic Report:\n\n[ About file ]\n\nName: 300.mp4\nDate: 1/08/2007 16:58:25\nSize: 1,583,327,161 bytes (1509.978 MB)\n\n[ Generic info ]\n\nPlay duration: 03:53:02 (13982.07 s)\nContainer type: MP4/MOV\nMajor brand: ISO Base Media version 1\nCreation time: 31/07/2007 20:54:52 UTC\nModification time: 31/07/2007 20:54:52 UTC\nNumber of streams: 3\nType of stream nr. 1: video (avc1) {GPAC ISO Video Handler}\nType of stream nr. 2: audio (mp4a) {Main}\nType of stream nr. 3: audio (mp4a) {Commentary}\nAudio streams: 2\n\n[ About quality ]\n\nResolution: HIGH (720 x 368)\nWidth: multiple of 16 (GOOD)\nHeight: multiple of 16 (GOOD)\n\n[ Video track ]\n\nCodec: avc1\nResolution: 720 x 368\nFrame aspect ratio: 45:23 = 1.956521\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 45:23 = 1.956521\nFramerate: 23.976023 fps\nNumber of frames: 167616\nBitrate: 1613.598995 kbps\n\n[ Audio track nr. 1 ]\n\nCodec: mp4a\nBitrate: 128.968701 kbps\nChannels: 2\nSample rate: 24000 Hz\n\n[ Audio track nr. 2 ]\n\nCodec: mp4a\nBitrate: 65.161682 kbps\nChannels: 2\nSample rate: 24000 Hz","torrent":{"xt":"urn:btih:1389b26ba0d27d141a15b61bc861ab568aea15c1","amp;dn":"300+SeCtIoN8+%7BSharego.net%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1389b26ba0d27d141a15b61bc861ab568aea15c1","infoHashBuffer":{"type":"Buffer","data":[19,137,178,107,160,210,125,20,26,21,182,27,200,97,171,86,138,234,21,193]},"announce":[],"urlList":[]}}