{"title":"ABEXO SUITE ALL COMPLETE","uid":3943362,"size":9388615,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1572805d96c5d71dfa22aa724f98a9bce21fdeb2&amp;dn=ABEXO+SUITE+ALL+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":11,"time":1198306288,"description":"ABEXO Memory Defragmenter and Process Tweak v2.4\n\n\n\nGet more computer memory (RAM) and CPU with Abexo Memory Defragmenter and Process Tweak.\nDefragment or compress to free the wasted RAM. Don&amp;#039;t let CPU hungry programs slow down your computer.\nWindows Vista compatible!\n\n-- Abexo Memory Defragmenter and Process Tweak is a utility software to make your computer run faster and avoid system performance bottle-necks. \n-- Abexo Memory Defragmenter and Process Tweak is in fact a two-in-one product; a memory defragmenter and a process tweaker, both aimed at making your computer more responsive and avoid system lockups (system freeze).\n\nComputer memory defragmenter also called computer RAM defragmenter, RAM/memory booster, RAM/memory optimizer, etc. is a utility software to free up wasted RAM and report the free computer memory. Memory Defragmenter also prevents Windows crashes since Windows crashes mainly occur if there is no free computer memory (RAM).\n\nThe other part, process tweaker or process manager is responsible for controlling the programs running on your computer. It tries to share the CPU cycles among programs equally or based on your preferences. A CPU intensive operation can cripple your system.\n\nAbexo Memory Defragmenter and Process Tweak comes pre-configured, however experienced users can configure every aspect of the operations.\n\n\n\n\nMemory Defragmenter Specifications\n- Supported platforms: Windows Vista and Windows XP\n- File size: 780 KB\n- Current version: 2.4\n\n---------------------------------------------------------------------------------\n\nABEXO Registry Cleaner v5.3.0.0\n\n\n\nMake your computer run faster with Abexo Registry Cleaner.\nBack up, clean up and defragment Windows registry the easy way. Windows Vista compatible!\n&quot;Abexo Registry Cleaner is a useful utility that can insure your computer runs as efficiently as possible.&quot; - Computer Power User Magazine\n\nA problem with the Registry that becomes an issue on many systems is the way the Registry manages itself. By time Windows registry gathers a lot of invalid entries that cause system complications and slow down your computer significantly and there is no cleanup ability within the Registry to remove bad or outdated entries.\n\nAbexo Registry Cleaner removes the obsolete registry entries and fixes the errors. Included in Abexo Registry Cleaner is a registry defragmenter also called compressor which removes the empty spaces after a registry cleanup and thereby reduces Windows registry size. Registry defragmentation increases the performance of your computer dramatically. \n\nRun Abexo Registry Cleaner after cleaning your registry with registry cleaners of other companies and see how many more registry errors Abexo Registry Cleaner will find.\n\n\n\n\nRegistry Cleaner Specifications\n- Supported platforms: Windows Vista and Windows XP\n- File size: 957 KB\n- Current version: 5.3\n\n----------------------------------------------------------------------------------\n\nABEXO Defragmenter Pro &amp; Lite Plus v5.0\n\n\n\nUse Abexo Disk Defragmenter Lite/Pro/Plus to automate the tasks needed to defragment and optimize your hard disk.\nIncludes disk cleanup functionality to create better defragmentation results.\n\nAbexo Disk Defragmenter Lite/Pro/Plus is a software to automate the necessary steps for an efficient and problem-free disk defragmentation. \n-- Does defragmenting your hard disk take too long time?\n-- Does your screen saver interfere when you defragment your hard disks?\n-- Does &quot;Drive&amp;#039;s content changed: restarting ...&quot; sound familiar?\n-- Does &quot;Windows cannot defragment this drive because ...&quot; sound familiar?\n-- Did you know that besides disk defragmentation, a disk optimization would tremendously speed up computer performance?\n-- Did you know that Windows pagefile (swapfile), besides slowing down the disk defragmentation process, is the main reason for poor results after disk defragmentation?\n-- Did you know that defragmenting ~500 MB of Temporary Internet Files, index.dat files and junk files is waste of time and you should do a disk cleanup before defragmenting disks?\n\nAbexo Disk Defragmenter Lite/Pro/Plus is a one-click solution for all these problems and much more.\n\nThe Pro versions of Abexo Disk Defragmenter include command line capability for automation purposes.\n\nDisk clean up\n\n-- empty recycle bin contents\n-- protected marked-for-deletion files (managed by utilities like Norton)\n-- installation temporary files\n-- Web browser files (including content cache, cookies, most-recently-visited file, URL history, Web form and login lists)\n-- zero-length files created as markers by applications\n-- temporary build files from applications\n-- backup application files (Office *.bak files, for example)\n-- log files (usually marked as *.log)\n-- memory dump files (from system crashes)\n-- Windows swap and prefetch cache files\n-- Windows run history file and My Documents history\n-- Microsoft Outlook backup files and *.dat files\n-- Windows temp folders (usually under C:Windows)\n-- Disk indexing files\n\nDo you need any of these temporary files? The short answer is no: any file that needs to exist (such as system temporary files) will be automatically recreated after you delete them, often taking up much less disk space. Getting into the habit of cleaning up your temporary files can restore hundreds of megabytes (sometimes even gigabytes) to your hard drive, reduced fragmentation effects on files (hence speeding up your system) and help you control how you system behaves.\n\nAbexo Disk Defragmenter Specifications\n- Supported platforms: Windows XP\n- File size: 2.5 MB\n- Current version: 5.0\n\nhave fun and enjoy The Joker\n\n","torrent":{"xt":"urn:btih:1572805d96c5d71dfa22aa724f98a9bce21fdeb2","amp;dn":"ABEXO+SUITE+ALL+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1572805d96c5d71dfa22aa724f98a9bce21fdeb2","infoHashBuffer":{"type":"Buffer","data":[21,114,128,93,150,197,215,29,250,34,170,114,79,152,169,188,226,31,222,178]},"announce":[],"urlList":[]}}