{"title":"PHP Designer 2007 Professional v5.5 Incl Keymaker-CORE","uid":3774869,"size":18455986,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1915d5a6fdbf6db43f5ac1c1a6ce07b9a7bd385a&amp;dn=PHP+Designer+2007+Professional+v5.5+Incl+Keymaker-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1187270788,"description":"Another day, another web page design software package being released. This time the release being PHP Designer 2007 Professional, by CORE. Although this is another studio package for developing PHP, this one does look a bit better than the ordinary. For most people who would use this I think it will bring back the VB/VB.net coding days? See what you think..\n\nphpDesigner 2007 Professional is a powerful PHP IDE (Integrated Development Environment) / PHP editor for both beginners and professional developers that enhances the process of editing, analyzing and publishing applications and websites powered by PHP and other web languages.\n\nDesigned to boost your productivity and simplify complex coding projects through intelligent set of editing tools that includes full support for PHP 5.2, syntax highlighters, intelligent nested code completion and code tip that are displayed as you type, so you do not need to look into documentation to see classes and function attributes, project manager, code snippets, the large built-in code-libraries, highlights (un)matching brackets and tags and numerous tools and wizards to speed of your development.\n\nProgram Features:\n\n    * Everything you need, all in one IDE for developing high performance web solutions!\n    * Boost your productivity and reduce your work effort!\n    * Take advantage of popular open-soruce technologies!\n    * Assist you in learning PHP!\n","torrent":{"xt":"urn:btih:1915d5a6fdbf6db43f5ac1c1a6ce07b9a7bd385a","amp;dn":"PHP+Designer+2007+Professional+v5.5+Incl+Keymaker-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1915d5a6fdbf6db43f5ac1c1a6ce07b9a7bd385a","infoHashBuffer":{"type":"Buffer","data":[25,21,213,166,253,191,109,180,63,90,193,193,166,206,7,185,167,189,56,90]},"announce":[],"urlList":[]}}