{"title":"PC Tools Internet Security v2008-YAG","uid":3936540,"size":28320262,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:19422cf6a4d2edeab821276addbad2a4f1bd43ea&amp;dn=PC+Tools+Internet+Security+v2008-YAG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1197836359,"description":"PC Tools Internet Security is another one of so called ?all-in-one? security applications. It contains Anti-Spyware, AntiVirus, Firewall and Spam protection. Not sure if it?s good comparing to big names such as Kaspersky or Nod32, but probably it?s worth something.\n\nDescription:\n\nPC Tools Internet Security combines the award-winning security technologies from PC Tools, including Spyware Doctor AntiSpyware, AntiVirus, Firewall Plus and Spam protection, to provide complete integrated protection for your PC.\n\nPC Tools Internet Security includes both antispyware and antivirus protection and has the most advanced update feature that continually improves its Spyware and Virus fighting capabilities on a daily basis. As threats gets more complex to avoid detection, PC Tools Internet Security responds with new technology to stay one step ahead.\n\nPC Tools Internet Security is advanced technology designed especially for individuals, not experts. It is automatically configured out of the box to give optimal protection with limited interaction so all you need to do is install it for immediate and proven ongoing protection.\n\nFeatures:\n\n    * PC Tools Internet Security Suite 2008 offers powerful Anti-Spyware, Anti-Virus, Firewall and Spam protection in one application.\n    * Detects, removes and blocks all types of Spyware, Adware, Viruses, Trojans, Worms, Keyloggers and other threats.\n    * Frequent updates ensure that you are always protected against the latest known threats.\n    * Protection from hackers, intruders and unauthorized software/network communication.\n    * Spam filtering for protection against unsolicited email.\n    * Easiest to use with intelligent automatic protection, as well as being configurable.\n\n\nRelease Name: PC.Tools.Internet.Security.v2008-YAG\nSize: 27MB\n\n-------------------------------------------------------------------------------\n\n    Don&amp;#039;t Forget To Join The Forum @ Deadly-Hackers!\n \n   &lt;a href=&quot; http://deadly-hackers.org/forum&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://deadly-hackers.org/forum&lt;/a&gt;\n\n-------------------------------------------------------------------------------\t\t","torrent":{"xt":"urn:btih:19422cf6a4d2edeab821276addbad2a4f1bd43ea","amp;dn":"PC+Tools+Internet+Security+v2008-YAG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19422cf6a4d2edeab821276addbad2a4f1bd43ea","infoHashBuffer":{"type":"Buffer","data":[25,66,44,246,164,210,237,234,184,33,39,106,221,186,210,164,241,189,67,234]},"announce":[],"urlList":[]}}