{"title":"Alpinestars-BASIC in FLAC lossless audio","uid":3871754,"size":345212581,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:198b091c809bde959d85a9188b0f3c9c62f7fd52&amp;dn=Alpinestars-BASIC+in+FLAC+lossless+audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"BenderB.Rodriguez","files":15,"time":1194134722,"description":"Some Great Electronica from Teh Pwnerer.\n\nHere is what an Amazon.com reviewer has to say:\n\nB.A.S.I.C.\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; is the explosive debut album from much lauded Manchester electronic outfit the Alpinestars. Founding members Glyn Thomas and Richard Woolanger first met 5 years ago while playing in separate bands that happened to share the same rehearsal space. Realizing they had more in common with each other than they did their own bands, the lads joined forces and formed their own \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;little electro group with full drums and bass\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; long before it became fashionable to do so. The band soon got their big break when the promoter at Manchester\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s famed Homoelectric club booked them for an hour long live set. Nearly dazzling the crowd with their atmospheric blend of warm liquid beats, the Alpinestars managed to secure a monthly residency at the club and land a recording contract with local imprint Faith &amp; Hope all in the same night. After releasing a string of critically acclaimed singles in 1999 and 2000, the Alpines took their live show on the road, opening for Death in Vegas, Doves, Badly Drawn Boy and Saint Etienne and performing at Creamfields, Glastonbury, Leeds, Reading and other high profile festivals. At the end of 2000, the band unleashed the critically acclaimed \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;77 Sunset Strip\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; which won single of the week honors in NME and set the stage for the release of their prescient debut long player \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;B.A.S.I.C \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;. \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;B.A.S.I.C \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; (Beginner\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s All Purpose Symbolic Instruction Code) is a flawlessly executed album of state of the art synthesized pop and kaleidoscopic electro grooves brimming with unbridled energy and emotional content. A blinding neon fusion of high frequency synth soundscapes, sleazy robo disco, bleak industria, and lovingly crafted acoustic guitar ballads that keep the rich Manchester musical legacy intact.","torrent":{"xt":"urn:btih:198b091c809bde959d85a9188b0f3c9c62f7fd52","amp;dn":"Alpinestars-BASIC+in+FLAC+lossless+audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"198b091c809bde959d85a9188b0f3c9c62f7fd52","infoHashBuffer":{"type":"Buffer","data":[25,139,9,28,128,155,222,149,157,133,169,24,139,15,60,156,98,247,253,82]},"announce":[],"urlList":[]}}