{"title":"Evergrey - A Night To Remember DVD disc 2 .iso","uid":3774467,"size":8293220352,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:199b881d220883d503fb2253e8ca5f51d403d8da&amp;dn=Evergrey+-+A+Night+To+Remember+DVD+disc+2+.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neonblack77","files":1,"time":1187231300,"description":"The second DVD includes all 6 of the group&amp;#039;s videos to date:\n1. For Every Tear That Falls\n2. The Masterplan\n3. Blinded\n4. I&amp;#039;m Sorry\n5. More Than Ever\n6. A Touch Of Blessing\n\n...as well as backstage-material, in-depth interviews with each of the members,\ngear-talk, live material from the beginning of their career, festivals, old demo\nsongs and tons of pictures!\n\nThis DVD is absolutely phenomenal... I own good amount of concert DVDs and have seen a good amount more, and one thing is for certain, this DVD stands out lightyears ahead of just about any concert DVD I&amp;#039;ve ever seen. For both Evergrey fans and non-Evergrey fans, the sheer amazing look and professionalism displayed throughout this DVD must be respected. This goes for both the actual performance quality and the overall show and video production.\nEvergrey is an incredible band, and this DVD perfectly showcases their strengths... the addition of a 3-person backing choir and a string quartet (on 6 songs) brings the quality of their music to an even higher level. Everyone is spot on in their performance. If you like Evergrey&amp;#039;s music in the studio, you can&amp;#039;t dislike this.\nAnd then there&amp;#039;s the video production. This is quite possibly the best looking concert DVD you&amp;#039;ll ever see... Both the way it was shot and the way it was edited attribute to an overall stunning package.\nDo not underestimate the power of this DVD. I&amp;#039;ve seen this DVD transform people with just one watch. More than a few of my friends have gone from not caring about the band to being very big fans with just one viewing of this DVD... it&amp;#039;s clearly an amazing gift for any Evergrey fan, as well as anyone who appreciates quality showmanship.","torrent":{"xt":"urn:btih:199b881d220883d503fb2253e8ca5f51d403d8da","amp;dn":"Evergrey+-+A+Night+To+Remember+DVD+disc+2+.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"199b881d220883d503fb2253e8ca5f51d403d8da","infoHashBuffer":{"type":"Buffer","data":[25,155,136,29,34,8,131,213,3,251,34,83,232,202,95,81,212,3,216,218]},"announce":[],"urlList":[]}}