{"title":"Ghosts.Of.Cite.Soleil.2006.LIMITED.DVDSCR.XViD-QuidaM","uid":3774722,"size":741190914,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1bd9778126b7d841417d81ce4740d079b305266f&amp;dn=Ghosts.Of.Cite.Soleil.2006.LIMITED.DVDSCR.XViD-QuidaM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fuctndabrain","files":52,"time":1187257563,"description":"In the slum of CitÃƒÂ© Soleil, President Aristide&amp;#039;s most loyal supporters were ruling as kings. The five major gang leaders were controlling heavily armed young men; the ChimÃƒÂ©res. The Secret army of President Jean-Bertrand Aristide. &quot;Ghosts of CitÃƒÂ© Soleil&quot; is a film about Billy and Haitian 2pac. Two brothers. Gang Leaders of the ChimÃƒÂ©res. \n\n\n\n\n\n&quot;I admired &amp;#039;Ghosts Of Citi Soleil&amp;#039;. If anybody followed the news in Haiti a few years ago, it&amp;#039;s dictator, Aristade was deposed, leaving the country in a state of chaos. This &quot;cinema verite&quot; documentary concerns two brothers on opposite sides of the whole ugly scene (one, pro Aristade,the other, con). Both brothers are involved in vicious street gangs, although there is still a sense of brotherly love between the two, despite the odds. The film documents a warts &amp; all approach to the whole gang problem that makes daily life a misery in the ghetto where it all takes place (it&amp;#039;s very gritty, complete with a firecracker string of f-bombs, gun violence &amp; general ugliness). The great Wyclef Jean not only composed the incidental score to the film, but also has some on screen time, as well (for those who have been living in a cave for the last ten or more years now, Jean is a musician,producer,arranger, and former member of the Fugees). If I have any quirks about this film, it&amp;#039;s sometime hard to pin a bead on the film&amp;#039;s camera work (the hand held camera work does tend at times to shake around a little too much). Apart from that,for anybody who has an iron clad will (and doesn&amp;#039;t get too offended by rough language), Ghosts Of Citi Soleil is a grim, but interesting window into another culture,generally ignored by America.&quot;","torrent":{"xt":"urn:btih:1bd9778126b7d841417d81ce4740d079b305266f","amp;dn":"Ghosts.Of.Cite.Soleil.2006.LIMITED.DVDSCR.XViD-QuidaM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bd9778126b7d841417d81ce4740d079b305266f","infoHashBuffer":{"type":"Buffer","data":[27,217,119,129,38,183,216,65,65,125,129,206,71,64,208,121,179,5,38,111]},"announce":[],"urlList":[]}}