{"title":"THE HIGH CHAPARRAL 3-4 [retrOtv] ","uid":3994605,"size":615360559,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1c424305e8a0668daad897de814a80b8a8cc15ae&amp;dn=THE+HIGH+CHAPARRAL+3-4+%5BretrOtv%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flixer","files":3,"time":1201250600,"description":"THE HIGH CHAPARRAL 3-4\n\n 3. The Ghost of Chaparral   9/17/1967\nVictoria&amp;#039;s efforts to overcome husband John Cannon&amp;#039;s memory of his first wife are thwarted when Apaches lay siege to their ranch, and she is kidnapped. Victoria is exchanged for an injured Apache and receives two opportunities to live in safety and leave the husband who doesn&amp;#039;t love her. Former suitor Anthony Grey rides in with an offer to take her to England, as Indians attack in earnest. Don Sebastian, her father, arrives with armed vaqueros to break the siege and insists his daughter return to the safety of her home in Mexico.\n  Guest star: Patrick Horgan (Anthony Grey, Lord Ashbury), Joaquin Martinez (Little Cloud), Carlos Rivas (Jorge)\n\n4. Best Man for the Job  9/24/1967\nJohn Cannon must decide whether to send his son to possible death to save their besieged ranch. Three army deserters, who have murdered Apaches on Cannon land, are taken prisoner by Indians. Captain Dabney fails in an effort to rescue the men, but gains Apache hostages, including a female relative of Cochise. When Captain Dabney refuses to trade prisoners, and as the Apaches prepare to execute the deserters (as well as Sam, who is also an Apache hostage), Cannon must decide whether to hand son, Billy Blue, the perilous job of secretly returning Dabney&amp;#039;s hostages to Cochise. Guest Stars: Warren Stevens as Captain Dabney, Nino Cochise, grandson of Cochise as Cochise.\n  Guest star: Lane Bradford (Gilcher), Ron Hagerthy (Morgan), Steve Raines (Cowboy #1), Warren Stevens (Captain Thomas Dabney), Rush Williams (Cowboy #2) \n\nWhat I upload next is determined by the number of people who show interest.\nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:1c424305e8a0668daad897de814a80b8a8cc15ae","amp;dn":"THE+HIGH+CHAPARRAL+3-4+%5BretrOtv%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c424305e8a0668daad897de814a80b8a8cc15ae","infoHashBuffer":{"type":"Buffer","data":[28,66,67,5,232,160,102,141,170,216,151,222,129,74,128,184,168,204,21,174]},"announce":[],"urlList":[]}}