{"title":"SRS Audio Sandbox x86 v1.7","uid":3925039,"size":6522200,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c8581250724294536de63c30e884b33e8d80631&amp;dn=SRS+Audio+Sandbox+x86+v1.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drone1969","files":3,"time":1197038966,"description":"SRS Audio Sandbox will provide amazing audio immersion and maximum thump for a personalized audio experience!\n\n    * Sleek easy-to-use interface design with energizing sonic-like pulses\n    * Realistic &amp; enjoyable surround sound\n    * Enjoy deep, rich bass\n    * Choose from many cool presets for all your music, videos and games\n    * Custom settings for headphones &amp; desktop or surround speakers\n    * Compatible with all music, videos &amp; games on the PC\n    * Compact mini mode display option\n      Product Spec Sheet  \n\n\nEnhances a variety of content\nThe SRS Audio Sandbox was designed recognizing audio has become more important as many people use their PC for entertainment, both at home and on the road. With SAS you can customize your audio experience based on music, movie, video or game content.\n\t\t\n\n    \nAudio enhancement &amp; surround sound technologies that work perfectly with each content selection\n\n\n      SRS WOW HD - improves the audio performance of compressed and uncompressed audio by expanding the size of the audio image in the horizontal and verticle sound field and creating a deep, rich bass response. The patented techniques in SRS WOW HD also retrieve information lost in the mixing process to create a more natural audio experience\n\n      SRS TruSurround XT - accurately reproduces multichannel content over two speakers for a realistic surround sound experience\n\n      SRS Circle Surround II - creates multichannel surround sound from any audio source, including mono and stereo, when played over a 5.1 or 6.1 speaker playback system\n\n      SRS Headphone 360 - delivers true 5.1 surround experience over headphones \n\n    \nAdvanced audio enhancement features so you can tune and customize your music, movie or video\n\n      SRS 3D - 3D stereo enhancement for mono or stereo content\n\n      SRS 3D Center Control - a zoom lens that dynamically extracts and positions the dialog in the foreground or background of the audio mix\n\n      SRS TruBass - bass maximization\n\n      SRS FOCUS - optimize speaker output to compensate and reposition audio placement\n\n      SRS Definition - delivers a more lively and brilliant sound by highlighting the high frequency details originally presented in the audio source\n\n      SRS Dialog Clarity - makes the vocals easier to understand over surround audio effects (for movies and video) \n\n    \nSurround Sound regardless of speaker configuration\n\n      For users that have a 5.1 and or 6.1 surround sound configuration, the SRS Audio Sandbox creates true multichannel surround sound from any audio source, including stereo and mono. Conversely, for those computer setups commonly using only two speakers, the SRS Audio Sandbox takes multichannel content and uses a virtualizer to create place phantom speakers around the room, providing a realistic and enjoyable surround sound experience. \n","torrent":{"xt":"urn:btih:1c8581250724294536de63c30e884b33e8d80631","amp;dn":"SRS+Audio+Sandbox+x86+v1.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8581250724294536de63c30e884b33e8d80631","infoHashBuffer":{"type":"Buffer","data":[28,133,129,37,7,36,41,69,54,222,99,195,14,136,75,51,232,216,6,49]},"announce":[],"urlList":[]}}