{"title":"The Skull","uid":3930447,"size":62148964,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1c9e47be48f01e17a165c2e899e76a99252a9e48&amp;dn=The+Skull&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"butcherboys","files":8,"time":1197420824,"description":"When it first fell like a fiery star from Heaven in 1985, Trouble&amp;#039;s second album The Skull descended to much darker and drearier climes than what the band had done before. While 1984&amp;#039;s Psalm 9 had featured some mark of glorious hope amidst the band&amp;#039;s wicked doom, The Skull was much less positive and truly captured what a band like Trouble could do in the doom genre. As one of the style&amp;#039;s only Christian acts, Trouble had the unique opportunity to draw inspiration from the fear of a very angry, Old Testament God; the end result is a massive album that sounds like fire from Heaven burning everything to a glowing shell of its former prestige.\n\nThe chilling dirge that is &quot;Pray for the Dead&quot; is like the first spark of divine punishment. The band cascades in on a mighty storm cloud of furious guitar wanking, all before leading into a gargantuan groove. Simplistic and monotone, it is much like the Limbo or Purgatory it effectively describes; epic, unending, and filled with legitimate sorrow. The song&amp;#039;s diabolical bridge, the likes of which snakes behind Eric Wagner&amp;#039;s increasingly manic vocals, lead into a fantastic fist-pumping solo and an excellent first song.\n\n&quot;Fear No Evil&quot; is not unlike &quot;Assassin&quot; off Psalm 9. It instantly launches into blistering, sludge-drenched speed; I hesitate to call it proto-thrash but again my mind keeps screaming the phrase at me. This is purist heavy metal of the most basic, traditional sense; loud, fast, hard, and rocking. The majestic solo will convert many a naysayer, and the song&amp;#039;s scream along chorus of &quot;FEAR---NO---EVIL&quot; is perhaps the album&amp;#039;s most cathartic and inspiring moment. Great freaking stuff.\n\n&quot;The Wish&quot; sees the band show a reflective side with a serene acoustic passage and some mild distortion leading into one of the biggest pendulum riffs I have ever had the pleasure of hearing. Swinging back and forth like a mace made from a mountain and used by a giant, this track is some of the thickest doom ever committed to tape. A bridge of introverted, meandering, and psychedelic acoustic guitar leads into a blistering finger-festival on the guitar frets, and this moment of what can best be described as violent joy lasts for an eternity of ever-increasing awe at what one is hearing. From here, things somehow fluidly morph into another song without any flaw in the transition. It is definitely epic, and worthy of some serious praise and worship (pun intended).\n\n&quot;Truth Is/What Is&quot; is a straightforward piece of doom/groove wizardry that is a bit on the forgettable side. It is a decent enough song but the preceding anthems were so exquisite this one serves as something of a letdown. An ambling slice of ballsy hard-rock styled doom ends the song as Wagner wails and howls like a man possessed by demons. This stunning finale is so interesting (see the following firestorm of speedier metal too) that I can see myself digging this song on its own more than on the album, so who knows? Maybe I will like it more later on....for now, it is a nice piece of filler and pretty solid stuff.\n\nThe crushing &quot;Wickedness of Man&quot; kickstarts things with a set of throbbing percussion and rollicking bass; as the roaring guitars attack like pouncing lions, one&amp;#039;s natural reaction is to cower in pants-spoiling fear. The song however chooses to toy with you; first it bats you back and forth with paws of patient, sadistic doom. Just when you think it can&amp;#039;t get any more bleak, the band bites your jugular with some seriously brutal riffing. Towards its surprising end, the song slowly spirals into a vortex of trance-inducing crunch not unlike Cathedral. Great stuff.\n\n&quot;Gideon&quot; is a blitzkrieg of fire and brimstone come to slay the masses. The song is rocking and the drums are thunderous. The song has a habit of ebbing and flowing between menacing potential buzz and vicious kinetic fury. A wailing solo towards song&amp;#039;s climax sounds like it was coming out of a wishing well, but it kind of adds to the effect and gives the song a very mystic feel. It is an interesting twist indeed, and leaves me wondering what comes next.\n\nWhat does come next is the mighty wrath of &quot;The Skull.&quot; A march of tribal percussion plods along as a moody dirge of clean guitars waft by like snatches of dust in the sunlight. The song pulls no punches in its subject matter; as enormous doom cascades down into the deepest realms of your soul, a terrible tale is told of Christ&amp;#039;s betrayal at the hands of Judas. When Wagner finally looses his absurdly high wails one last time, the song switches into a sort of oozing beatdown that pummels you with layer after layer of subtle devastation. It definitely ends the album with an untoppable grand finale that should blow plenty of minds.\n\nWhereas Psalm 9 had more of God&amp;#039;s love, The Skull has more of God&amp;#039;s righteous anger. In my opinion, The Skull is a much more endearing album due to the passionate fire that Trouble put forth here. As both were reissued last month, one might be forced to choose between the two. The drive, focus, and intensity deep within the soul of The Skull makes it a much better album, and if God was a metalhead (and most assuredly, I&amp;#039;d say he is) I&amp;#039;m guessing this is one of his favorites. Pick it up and see if you agree.\n\nTrack Listing\n1. Pray for the Dead\n2. Fear No Evil\n3. The Wish\n4. Truth Is/What Is\n5. Wickedness of Man\n6. Gideon\n7. The Skull","torrent":{"xt":"urn:btih:1c9e47be48f01e17a165c2e899e76a99252a9e48","amp;dn":"The+Skull","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c9e47be48f01e17a165c2e899e76a99252a9e48","infoHashBuffer":{"type":"Buffer","data":[28,158,71,190,72,240,30,23,161,101,194,232,153,231,106,153,37,42,158,72]},"announce":[],"urlList":[]}}