{"title":"Anuranon","uid":3985326,"size":878798848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1cbfb0e0ab7897abb58d1f37014e801c93d52577&amp;dn=Anuranon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mainak1985","files":1,"time":1200778452,"description":"Actors: Rahul Bose\n        Raima Sen\n        Rituparna Sengupta\n        Rajat Kapoor \n\nLanguage : Bengali\n\nArchitect Rahul Bose arrives in Sikkim to build a resort. Raima Sen, married to the man who is ploughing in money for the project, happens to be there too. The two have known each other for long, but the lonely hills sow the seeds of a relationship.\n\nAd film-maker Aniruddha Roy Chowdhury has chosen the resonance of relationships to start his feature film-making career. Pairing Rahul with Rituparna Sengupta and Raima with Tota Roy Chowdhury, Anuranon (working title) will delve deep into the shades of bonds forged in and out of wedlock.\n\n?A relationship between a man and a woman need not necessarily be that of husband-wife or boyfriend-girlfriend. My film is about the untold resonance embedded in a relationship. But we will also explore the relationship with nature. Kanchenjunga is the third character here,? says Aniruddha, having finished his first shoot schedule in Sikkim.\n\nCinematographer Sunil Patel, the man behind Salaam Namaste and Hum Tum, has canned ?some amazing? shots of the Kanchenjunga at sunrise and sundown, and during moonlit nights.\n\n?Making feature films is every ad film-maker?s dream and I have been toying with the idea for the past three to four years,? says Aniruddha, who co-wrote the screenplay with a friend. Anuranon will feature music composed by tabla exponent Tanmoy Bose and Asish Rego from Mumbai.\n\nThe Calcutta schedule starts from December 4-5; a foreign trip with the cast and crew is also on the cards. Barun Chanda and Shantilal Mukherjee are among the other cast members.","torrent":{"xt":"urn:btih:1cbfb0e0ab7897abb58d1f37014e801c93d52577","amp;dn":"Anuranon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cbfb0e0ab7897abb58d1f37014e801c93d52577","infoHashBuffer":{"type":"Buffer","data":[28,191,176,224,171,120,151,171,181,141,31,55,1,78,128,28,147,213,37,119]},"announce":[],"urlList":[]}}