{"title":"Advanced Energy Research Organization (AERO), LLC","uid":3889218,"size":839023002,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ce563aecef475a1b40a8c734897fe2b2cf09504&amp;dn=Advanced+Energy+Research+Organization+%28AERO%29%2C+LLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shottie","files":11,"time":1194974274,"description":"Advanced Energy Research Organization (AERO), LLC ( http://www.aero2012.com ) is a new research and development group formed to develop and strategically protect new energy and propulsion technologies. It is our goal, utilizing a unique strategic approach, to bring forth these new environmentally sound technologies to replace virtually all fossil fuel, internal combustion and ionizing nuclear technologies within 20-30 years.\n\n\\\\\\\\\\\\\\&quot;Never doubt that a small group of thoughtful, committed people can change the world; indeed, it is the only thing that ever has.\\\\\\\\\\\\\\&quot;\n\n- Margaret Mead, anthropologist\n\n\nAbout AERO\n\nAdvanced Energy Research Organization (AERO), LLC was founded by Steven M. Greer, M.D., in July 2007. AERO is a new research and development group which will develop and strategically protect new energy and propulsion technologies that will completely replace oil, gas, coal, and nuclear power.\n\nAERO is the group that is most strategically ready to develop, disclose and establish the long-suppressed technologies that will enable us to establish a truly sustainable civilization on Earth.\n\nIt is time that humanity move on to its next level of development. This cannot happen with the internal combustion engine and fossil fuels. Time is short. Indeed time- and obscurity- are elements that must be overcome for success to occur.\n\nCompany Officers\n\nSteven M. Greer, M.D., President and Chief Executive Officer\n\nTheodore Loder III, Ph.D., Chief Technology Officer\n\n\n------------------------------------------------------------------------------------------------------------------------\n\n** August 20, 2007 - AERO CEO Dr. Steven Greer gave a presentation in Bethesda, Maryland, at a meeting (the Advanced Energy Technology Colloquium) to review advanced energy and related technologies. Several other presentations were given at this time by scientists, and other experts, that are all involved with a massive scientific and technological movement that will radically change the world for the better within the next year, and forever onward. All of these filmed presentations have been archived on Google Video, and this torrent consists of converted copies (.flv to DivX .avi). These important presentations, including detailed information that has been recently added (featuring Lt. Col. Tom Bearden, Prof. Dr-Ing. Meyl and others), have been archived at Green Salon: http://www.green-salon.co","torrent":{"xt":"urn:btih:1ce563aecef475a1b40a8c734897fe2b2cf09504","amp;dn":"Advanced+Energy+Research+Organization+%28AERO%29%2C+LLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ce563aecef475a1b40a8c734897fe2b2cf09504","infoHashBuffer":{"type":"Buffer","data":[28,229,99,174,206,244,117,161,180,10,140,115,72,151,254,43,44,240,149,4]},"announce":[],"urlList":[]}}