{"title":"Folge 67 Columbo - Das Aschenpuzzle (divX6, TV-RIP, german) [by","uid":3356560,"size":588566528,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1d2dc4a121104c8027957f35e8b151aca4bfe7a5&amp;dn=Folge+67+Columbo+-+Das+Aschenpuzzle+%28divX6%2C+TV-RIP%2C+german%29+%5Bby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Salomon2802","files":1,"time":1121422578,"description":"Krimi &amp;middot; Die skrupellose Starkolumnistin Verity Chandler wird von ihrem Ex-Liebhaber Eric Prince, einem eiskalten Bestattungsunternehmer, umgebracht, weil sie damit drohte, pikante Details aus seiner Vergangenheit zu ver&amp;ouml;ffentlichen und ihn damit zu ruinieren. Prince verbrennt die Leiche und legt eine falsche Spur, die darauf hindeuten soll, dass Kokain-Dealer Verity Chandler umgebracht haben. Doch Lt. Columbo, der die Ermittlungen in diesem Fall &amp;uuml;bernimmt, l&amp;auml;sst sich nicht so leicht t&amp;auml;uschen... Verity Chandler, eine f&amp;uuml;r ihre Skrupellosigkeit in Hollywoods h&amp;ouml;chsten Kreisen gef&amp;uuml;rchtete Starkolumnistin, wohnt dem Begr&amp;auml;bnis von Chuck Houston bei, einem von Hollywoods bekanntesten Stars, der auch ein grosser Kriegsheld war. Die Ein&amp;auml;scherung findet im Hause des eiskalten Beerdigungsunternehmers Eric Prince statt, der einst Verity Chandlers Liebhaber war, sie dann jedoch wegen einer anderen verstiess. Verity ist nicht nur wegen Chuck Houstons Beerdigung in Princes Haus gekommen: Sie hat endlich etwas in Princes Vergangenheit entdeckt, womit sie sich an ihrem Ex-Lover f&amp;uuml;r die Dem&amp;uuml;tigung r&amp;auml;chen kann. Verity konfrontiert Eric damit, dass sie herausgefunden hat, mit welch sch&amp;auml;bigem Verhalten er sein Gesch&amp;auml;ft begr&amp;uuml;ndet hat: Prince hat vor Jahren, als er noch ein kleiner Angestellter des Beerdigungsunternehmens war, bei der Ein&amp;auml;scherung des Stummfilmstars Dorothey Page vom Hals der Leiche eine wertvolle Diamantenkette gestohlen, die er auf dem Schwarzmarkt verkaufte und mit deren Erl&amp;ouml;s er sein eigenes Gesch&amp;auml;ft begr&amp;uuml;ndete. Diese unappetitlichen Details will Verity in ihrer n&amp;auml;chsten Sendung am Sonntagabend der &amp;Ouml;ffentlichkeit pr&amp;auml;sentieren, womit Eric erledigt w&amp;auml;re. Ausser sich vor Wut bringt Prince seine Ex-Geliebte kurzerhand um und entsorgt die Leiche, indem er sie anstatt der sterblichen &amp;Uuml;berreste von Chuck Houston ein&amp;auml;schert. Anschliessend geht er in ihr Haus, manipuliert Dateien an ihrem Computer, verw&amp;uuml;stet die Einrichtung und legt so eine falsche Spur, die darauf hindeutet, dass sie an einer Story &amp;uuml;ber Hollywoods Kokainmafia gearbeitet hat und von w&amp;uuml;tenden Drogendealern entf&amp;uuml;hrt wurde. Veritys Assistent Roger Gambles erscheint am n&amp;auml;chsten Morgen im Haus seiner Arbeitgeberin und ruft sofort die Polizei. Als leitender Beamter erscheint Lt. Columbo am vermeintlichen Tatort und beginnt in seiner unnachahmlichen Art mit den Ermittlungen. Ihm erscheint die Version, dass Drogen-Dealer die Kolumnistin entf&amp;uuml;hrt haben sollen, sofort unglaubw&amp;uuml;rdig, und er beginnt damit, die Menschen zu interviewen, die Verity Chandler zuletzt gesehen haben. Und der Erste ist ausgerechnet Eric Prince. Zwischen den beiden M&amp;auml;nnern beginnt ein spannendes Katz- und Mausspiel...\n\nMit: Peter Falk (Columbo), Rue McClanahan (Verity Chandler), Spencer Garrett (Roger Gambles), Catherine McGoohan (Rita)\nBuch: Jeffrey Hatcher","torrent":{"xt":"urn:btih:1d2dc4a121104c8027957f35e8b151aca4bfe7a5","amp;dn":"Folge+67+Columbo+-+Das+Aschenpuzzle+%28divX6%2C+TV-RIP%2C+german%29+%5Bby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d2dc4a121104c8027957f35e8b151aca4bfe7a5","infoHashBuffer":{"type":"Buffer","data":[29,45,196,161,33,16,76,128,39,149,127,53,232,177,81,172,164,191,231,165]},"announce":[],"urlList":[]}}