{"title":"(Arkanoid) Psycon Software - Cybersphere and Cybersphere Plus (P","uid":3873525,"size":3640542,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ddf1f59beeb3c786c7a17b01ffe7c5468b69ac4&amp;dn=%28Arkanoid%29+Psycon+Software+-+Cybersphere+and+Cybersphere+Plus+%28P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"preservedforposterity","files":12,"time":1194243594,"description":"Games : Windows : Full Game : English\n(Arkanoid) Psycon Software - Cybersphere and Cybersphere Plus\nA Preserved for Posterity Release\nNovember 4, 2007\n\nAs the name implies, Preserved for Posterity exists for the sole\npurpose of preserving the past, well into the future. When PfP began,\nwe weren&amp;#039;t too certain as to the best method of achieving this goal.\nAs a result, there are a few PfP releases floating around out there in\ncyberspace that should probably be deleted and forgotten due to their\nextreme inelegance and awful design. In fact, any PfP release prior to\nOctober 1, 2007 should be considered Recycle Bin fodder! Uninstall and\ndelete those old releases and keep an eye out for much improved\nreplacements - You will not be disappointed!\n\nOur intent is to locate old software, which is no longer available for\nsale (this is typically referred to as Abandonware, Orphanware, or\nsome other such moniker) and create new setups (installers) which\nallow these blasts from the past to function correctly on modern PC&amp;#039;s.\nTo achieve this, we make the best possible use of tools such as\nDOSBox, VDMSound and the ever present Windows Command Interpreter\n(when working with MS-DOS applications). Improved installers are\ncreated for older Windows based applications.\n\nThis release contains the full registered versions of Psycon Software&amp;#039;s\nCybersphere PC and Cybersphere Plus PC. Notice the PC at the end...\nthat is because these games were originally released for the Commodore\nAmiga and then later ported to the PC and MS-DOS by the author, Clay\nHellman. These games are similar to Arkanoid, Breakout, DX-Ball, etc.\nand are great fun. We have many fond memories of these games in the\nlate 1990&amp;#039;s.\n\nThis installer has been assembled with the modern PC in mind, and thus\nthese games may be played under emulation via DOSBox 0.72, partial\nemulation via VDMSound 2.1.0, or directly via the Windows Command\nInterpreter. These three options should ensure that almost any PC will\nbe able to properly execute the games.\n\nIn an attempt to make this as simple as possible, this installer will\ninstall the games and create the following program group:\nSTART&gt;PROGRAMS&gt;GAMES&gt;DOS&gt;PSYCON SOFTWARE\nWith the following subgroups:\nCMD\nDocumentation\nDOSBox\nVDMSound\n\nThe icon in the CMD group will launch the games via the Windows\nCommand Interpreter. If you are using Windows 95, 98 or ME, then\ndepending on configuration (hardware), you may or may not have sound.\nIf you are using Windows NT, 2000, XP or later, then it is almost\ncertain that you will NOT have sound. The games play fine, just in\ninfinite silence. Fear not, there is a solution to this dilemma.\nREAD ON...\n\nThe icon in the DOSBox group will launch the games via DOSBox full\nemulation. If your PC is fast enough to run DOSBox smoothly, this is\ndefinately the preferred method of running old DOS-Based games under\nany 32-bit version of Windows. All of the sound hardware required by\nthe Psycon Software games is fully emulated in DOSBox.\n\nThe icon in the VDMSound group will launch the games via VDMSound\npartial emulation. If your PC isn&amp;#039;t fast enough to run DOSBox smoothly,\nthen this is the next best option. VDMSound doesn&amp;#039;t fully emulate all\nof the sound hardware required by the Psycon Games, but it will at\nleast give you some sound with the Psycon games. Note that VDMSound is\nintended for use only with Windows NT class Operating Systems (NT, 2K,\nXP) and will not function with Windows 9x Class Operating Systems (95,\n98, ME).\n\nThe icons in the Documentation group are the little bits of info that\nare relative to the Psycon Software games.\n\nObviously, for the VDMSound shortcuts to work, VDMSound has to be\ninstalled, but don&amp;#039;t worry, it&amp;#039;s installer will launch as part of this\nsetup (during the VDMSound setup, select all options or &quot;Complete\nInstall&quot;). If VDMSound is not compatible with your system (or Operating\nSystem), you can simply cancel the VDMSound setup and the rest of this\nsetup will complete successfully (no harm, no foul) - the icons in the\nVDMSound group just won&amp;#039;t function.\n\nThe required DOSBox files are automatically installed as part of this\nsetup - no need to worry if you already have DOSBox installed -\neverything will work out just fine.\n\nThe following DIRectories (folders) are created:\nMy Documents\\Inno Setup scripts\nMy Documents\\Disk Images\\Floppy\\1.44M\nProgram Files\\DOS Applications\nProgram Files\\DOS Applications\\Psycon Software\n\nThe Inno Setup scripts folder will contain the script used to generate\nthis installer via Jordan Russell&amp;#039;s Inno Setup Compiler. The 1.44M\nfolder will contain a 1.44Mb floppy diskette image (Psycon.imz) of the\noriginal, unmodified Psycon Software files. This image was created with\nWinImage 8.10.8100. Winimage or other diskette image software is\nrequired for manipulation of the diskette image. The DOS Applications\nfolder will contain the most current version of the DOSBox application\n(as available at the time of this installers creation). All PfP\nreleases that require DOSBox will place it in this same spot. Newer\nPfP releases will then, tend to have newer versions of DOSBox. The\nPsycon Software folder will contain the actual games. You may safely\ndelete the Inno Setup scripts and Disk Images folders at any time if\nyou decide that you have no need of the setup script or original floppy\ndiskette image.\n\nThe following is borrowed from: &lt;a href=&quot;\nhttp://www.classicdosgames.com/psycon.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.classicdosgames.com/psycon.html&lt;/a&gt;\n\nCybersphere\nPsycon Software, 1996\n\nCybersphere is simply the best &quot;ball and paddle&quot; game I&amp;#039;ve ever played.\nIt&amp;#039;s like Arkanoid, but with better graphics, music, and sound. There\nare some new power-ups, as well as gems to collect for bonus points,\nand the gameplay is unusually fun. One of the power-ups temporarily\nplaces a guard rail at the bottom of the level. Each level has a\ndifferent background and walls. Even the guard rail has many different\nappearances. Naturally, multi-ball is also available. There&amp;#039;s very\nlittle empty space in the game, which seems to make it easier to keep\nthe ball in play, eliminating the frustration factor common to most\ngames of this genre. Angled corners and edges help to virtually\neliminate the problem of hitting that one last block, which is the\nscourge of the genre. To keep it challenging, some levels have\ninvisible blocks that only become visible after being hit. There are 5\nsectors with various numbers of levels and 10 bonus stages in this\ngame, with only one sector containing three levels and two bonus stages\nin the demo version.\n\nCybersphere Registered Version (70k) 15 April 1996\nCybersphere Shareware Version (47k) 15 April 1996\n\nAuthor Clay Hellman has generously released this game as freeware.\n\n\nCybersphere Plus\nPsycon Software, 1997\n\nCybersphere Plus is the sequel to Cybersphere, with all new levels and\nidentical gameplay. The graphics, music, and level design remain\nexcellent. There are 5 sectors with various numbers of levels and 10\nbonus stages in this game, with only one sector containing three levels\nand two bonus stages in the demo version.\n\nCybersphere Plus Registered Version (75k) November 1997\nCybersphere Plus Shareware Version (47k) 3 February 1998\n\nAuthor Clay Hellman has generously released this game as freeware.\n\n(Arkanoid) Psycon Software - Cybersphere and Cybersphere Plus (PfP) FULL REGISTERED VERSIONS","torrent":{"xt":"urn:btih:1ddf1f59beeb3c786c7a17b01ffe7c5468b69ac4","amp;dn":"%28Arkanoid%29+Psycon+Software+-+Cybersphere+and+Cybersphere+Plus+%28P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ddf1f59beeb3c786c7a17b01ffe7c5468b69ac4","infoHashBuffer":{"type":"Buffer","data":[29,223,31,89,190,235,60,120,108,122,23,176,31,254,124,84,104,182,154,196]},"announce":[],"urlList":[]}}