{"title":"PhotoWatermark 7.0.5.0 Retail_CrAsH.zip","uid":3777130,"size":2904554,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1e1e979c6606563218934da936dee8426f8816ad&amp;dn=PhotoWatermark+7.0.5.0+Retail_CrAsH.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"161we099","files":1,"time":1187444733,"description":"Power, speed, and flexibility! Are these what you want for your watermarking program? This new generation of PhotoWatermark Professional is redesigned from scratch and more specialized in professional watermarking. A feature centered interface setup with clearly readable buttons lets you find the proper commands easily. It supports a mixture of text and image watermarks of any complexity. A variety of styles including outline, gradient or texture fill, inner shadow, soft shadow, glow, drop shadow, 3D shadow, emboss and engrave render you watermarks that speak of professionalism. Five mechanisms (auto position, relative size, relative margin, image orientation selection and aspect ratio cropping) assure consistent look of your watermarks either on prints or screen regardless of the size and orientation of your images. Flexible Transparency setting allows you to choose how your pictures will be presented to your potential customers. Watermarks can include little macros to extract various EXIF including GPS tags and file information from individual photo. JPEG, TIFF, PNG and bitmap graphic formats are supported. A built-in watermark file manager helps you manage multiple watermarks for different purposes and switch with a single click. PhotoWatermark Professional supports a combination of batch watermarking, cropping, converting, resizing, renaming and framing. Integrated how-to tips encourages you to start watermarking in no time!","torrent":{"xt":"urn:btih:1e1e979c6606563218934da936dee8426f8816ad","amp;dn":"PhotoWatermark+7.0.5.0+Retail_CrAsH.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1e979c6606563218934da936dee8426f8816ad","infoHashBuffer":{"type":"Buffer","data":[30,30,151,156,102,6,86,50,24,147,77,169,54,222,232,66,111,136,22,173]},"announce":[],"urlList":[]}}