{"title":"La Vie de Chateau 1966 Rare Deneuve 02 eng subs","uid":3371145,"size":731546967,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e4d64081a023b21d5db9a76672faa74b42a809c&amp;dn=La+Vie+de+Chateau+1966+Rare+Deneuve+02+eng+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"Ercole","files":2,"time":1124307280,"description":"The opening credits here are groovy but misleading: a series of Richard Avedon-like photographs of Catherine Deneuve looking mid-'60s cool (complete with swinging Michel Legrand music). Actually, La Vie de Chateau is set just before D-day, 1944, on a large estate near the landing beaches. The divine Deneuve is a bored wife, whose wealthy husband (the great Philippe Noiret) wants the quiet country life. Arriving on the scene are a dashing Resistance fighter (Henri Garcin), scouting the area, and a German officer--and both swoon over the blond mistress of the chateau. Director Jean-Paul Rappeneau, best known for his Cyrano de Bergerac with Gerard Depardieu, displays a kicky style that might seem inappropriate for the subject, but the film is a complete delight: full of unexpected sight gags and New Wavey spirit. The D-day climax is both uproarious and redemptive. This film needs to be better known outside France.\n\n\n\n From the Back Cover\n\nComedy and heroics abound in Jean-Paul Rappeneau's wartime battle of the hearts starring Catherine Deneuve (Belle de Jour, Pola X), Phillippe Noiret (Cinema Paradiso, Il Postino), and Pierre Brasseur (Children of Paradise, King of Hearts).\n\n\n\nThe year is 1944. Along Normandy's shores, Jerome, a world-weary lord, and Marie, his ravishing but bored wife, live in rustic tranquility. Unexpectedly, their world is turned upside down when a German outfit bivouacs themselves in their ramshackle chateau. Soon, Marie finds herself being pursued by both the German commanding officer and a French spy working covertly to plan the D-Day attacks. With so many men vying for her affection, what's a married girl to do?\n\n\n\nAVI File Details\n\n========================================\n\nName.........: La.Vie.de.Chateau.1966.XviD.FZB\n\nFilesize.....: 697 MB (or 714,336 KB or 731,480,064 bytes)\n\nRuntime......: 01:29:19 (160,609 fr)\n\nVideo Codec..: XviD\n\nVideo Bitrate: 1033 kb/s\n\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\n\nAudio Bitrate: 50 kb/s, monophonic VBR \n\nFrame Size...: 624x368 (1.70:1) [=39:23]","torrent":{"xt":"urn:btih:1e4d64081a023b21d5db9a76672faa74b42a809c","amp;dn":"La+Vie+de+Chateau+1966+Rare+Deneuve+02+eng+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e4d64081a023b21d5db9a76672faa74b42a809c","infoHashBuffer":{"type":"Buffer","data":[30,77,100,8,26,2,59,33,213,219,154,118,103,47,170,116,180,42,128,156]},"announce":[],"urlList":[]}}