{"title":"Jane - Here We Are (German Melodic Progressive 1973 @320)","uid":3371347,"size":95653618,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1eba80fa4f9e4ac2ce80306dc0e343d43e6a69cc&amp;dn=Jane+-+Here+We+Are+%28German+Melodic+Progressive+1973+%40320%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"test78","files":10,"time":1124347007,"description":"Search for test78 to find my other uploads\n\nJane was a Krautrock band that played slow, hypnotizing even, progressive blues rock with nice arrangements and instrumentations. The vocals are a little accented, but anyone interested in well crafted, well played and well written early, bluesy progressive need look no further. Great melodies, great playing and after all this time still a good sound, make this is a good starter for Jane. \n\n\nWhere most albums have a knack to end with their longest track, on this Jane starts with it's longest track. Redskin is indeed about Indians, as showsn by the fireside music and the chanting people. The song is like a long jam with a lot of organ (quite usual with Jane) and also some more experimental influences that make sure that Redskin is just one of those blues rock tracks that just go on. The sound of Jane is blues rock with more complicated song structures, more attention to melody and also more varied instrumentation. Still the music still has that laid back bluesy feel to it. \n\nThe next track Out In The Rain is rather close to pop in a sense although it has a very peaceful keyboard intermezzo with a soothing bassline and a beautiful build up with a delicate melody continued into a great laid back guitar solo. These components make this is an interesting track for progressive lovers, but I wouldn't have said this from the beginning. \n\nDandelion shows that the vocals of Jane are not unaccented, but in my opinion this is no problem when one wants to appreciate the band. Like the previous tracks the melodies are okay. \n\nMoving is somewhat darker and more psychedelic and reminds me of the first album Together. The drums are quite loud here, and the guitar is the lead instrument although the latter part of the track contains some distorted keyboards. \n\nWaterfall also contains many of the Jane ingredients: nice themes, a full organ sound, a rocking guitar, bouncing drums and an overall sound that a first listen sounds like it has been developed right there in the studios, but showing compositional qualities. The same holds for Like A Queen and the last track of the actual album, the titletrack. Here the vocals return, but still the highlight of the track is the orgiastic ending with every instrument playing at the top if it's...well...lungs. \n\nThe first two bonus tracks are alternate versions of songs from the first album. On this track the earlier singer Bernd Pulst can be heard. He has a very typical voice that can hardly be imitated. His vocals are probably more accented, but I like them. Daytime is a very good track from the first album containing good melodies, good licks and riffs and an organ to round it all off. Still, the longer album version is preferred. Hangman from Together is instrumental abnd more straightforward stomping bluesrock. \n\nThe single version of Here We Are lacks the momentousness of the original. The vocals are also cleaner on this single version. A short version of the instrumental Redskin completes this release.\n\n\n\n320kbs\n\n\nTracklist:\n\n1. Redskin (8:53) \n2. Out in the rain (5:38) \n3. Dandelion (2:17) \n4. Moving (3:53) \n5. Waterfall (4:24) \n6. Like a queen (2:38) \n7. Here we are (5:35) \n8. Daytime (single) (3:31) \n9. Hangman (instrumental) (3:59) \n10. Here we are (single) (3:48) \n11. Redskin (single) (2:41)\n\nEnjoy!\n\n","torrent":{"xt":"urn:btih:1eba80fa4f9e4ac2ce80306dc0e343d43e6a69cc","amp;dn":"Jane+-+Here+We+Are+%28German+Melodic+Progressive+1973+%40320%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eba80fa4f9e4ac2ce80306dc0e343d43e6a69cc","infoHashBuffer":{"type":"Buffer","data":[30,186,128,250,79,158,74,194,206,128,48,109,192,227,67,212,62,106,105,204]},"announce":[],"urlList":[]}}