{"title":"33 Episodes of the Gamewavepodcast","uid":3870699,"size":1261881360,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ed9e5e004523e612af937d888a7b341d50afc7b&amp;dn=33+Episodes+of+the+Gamewavepodcast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"stupid_user","files":70,"time":1194062587,"description":"Included are all the episodes of the incredible Internet radio show called the Gamewave Podcast.\n\n[img]http://www.gamewavepodcast.com/images/wavelogo.png[/img]\n\nThe Gamewave Podcast is a podcast presented in the style of a music radio show. The show plays video game style music and is presented by Joe Allen and Mike Cook, two members of the band Spheres of Chaos. The show aims to provide listeners with entertainment, as well as promoting the artists featured and video game music in general.\n\nThere are many names of different genres of music which are video game music influenced (often late 80s and early 90s video game music, as this is the most distinctive type of video game music). Some artists are heavily focused on video games while others only borrow from the sound of video games to supplement other styles of music. Video game related genre names include 8 bit, micromusic, chiptune, video game metal, nintendocore and bitpop. The use of the word gamewave refers to all styles of music influenced by video game music.\n\nSome artists use PC software to create their music, some use gaming hardware such as the Game Boy to create their sound and others use plain old instruments such as guitars and drums.\n\nMany video game bands and artists &quot;cover&quot; video game melodies, while others create original songs. All songs played on the Gamewave Podcast are originals but are inspired by video games in some way.\n\nThe views expressed on the Gamewave Podcast are not necessarily representative of the views of the artists featured.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nEnjoy!\n\nPlease check my other torrents for more like this.\n\nAny and all comments are welcome.","torrent":{"xt":"urn:btih:1ed9e5e004523e612af937d888a7b341d50afc7b","amp;dn":"33+Episodes+of+the+Gamewavepodcast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ed9e5e004523e612af937d888a7b341d50afc7b","infoHashBuffer":{"type":"Buffer","data":[30,217,229,224,4,82,62,97,42,249,55,216,136,167,179,65,213,10,252,123]},"announce":[],"urlList":[]}}