{"title":"ChangeThis - ALL manifestos to date","uid":4007142,"size":143933609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:220a45bf5a3ca08abd5560efda261e57d813bda5&amp;dn=ChangeThis+-+ALL+manifestos+to+date&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fdksafks","files":230,"time":1201890770,"description":"This torrent has ALL manifestos ever published on ChangeThis.com.\n\nLAST UPDATED: 1/2/2008\nLAST MANIFESTO PUBLISHED: 16/1/2008\n\n\n------------------\n\n&quot;About Us&quot; - ChangeThis.com\n\n\n&quot;Are you an optimist?\n\nSometimes it seems as though our disagreements over everything from politics to business to the designated hitter rule are more serious and more divisive than ever before.\n\nPeople are making emotional, knee-jerk decisions, then standing by them, sometimes fighting to the death to defend their position.\n\nAnd yet, we are optimists.\n\nPeople call the team at Change This optimists because we dont believe it has to be this way. We dont believe humans evolved to be so bad at making decisions, so poor at changing our minds, so violent in arguing our point of view. We are well aware of how split our country and our world have become, but we dont think the current state of affairs is built into our very nature.\n\nThe problem lies in the media.\n\nIn the old days, we had the time and inclination to consider the implications of a decision. Everyone wasnt in quite so much of a hurry. At the same time, most conversations (and most arguments) were local ones, conducted between people who knew each other.\n\nToday, it is very different. Television demands a sound bite. A one hundred word letter to the editor is a long one. Radio has become a jingoistic wasteland, a series of thoughtless mantras, repeated over and over and designed to fit into a typical commute.\n\nTo find out more, please download our ChangeThis manifesto.\n\n\n\n\n\n--------------------------------------------------------------------------------\n\n\nChangeThis was built in the summer of 2004 by Amit Gupta, Catherine Hickey, Noah Weiss, Phoebe Espiritu and Michelle Sriwongtong. You can read their bios in this blog entry. The original idea behind ChangeThis came from Seth Godin. You can read about him on his website.\n\nIn the summer of 2005, ChangeThis was turned over to 800-CEO-READ. In addition to selling business books, they keep ChangeThis up and running with their love and tender care. To learn more about 800-CEO-READ, read their daily blog.&quot;","torrent":{"xt":"urn:btih:220a45bf5a3ca08abd5560efda261e57d813bda5","amp;dn":"ChangeThis+-+ALL+manifestos+to+date","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"220a45bf5a3ca08abd5560efda261e57d813bda5","infoHashBuffer":{"type":"Buffer","data":[34,10,69,191,90,60,160,138,189,85,96,239,218,38,30,87,216,19,189,165]},"announce":[],"urlList":[]}}