{"title":"Kylie Minogue - White Diamond Documentary","uid":3984563,"size":1526276530,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2284e9356483fde1fbd71c79505d26ad81b06e1c&amp;dn=Kylie+Minogue+-+White+Diamond+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cluttrell","files":3,"time":1200747733,"description":"White Diamond: A Personal Portrait of Kylie Minogue is a 2007 documentary film directed and produced by William Baker. White Diamond was filmed between August 2006 and March 2007 in both Australia and the United Kingdom and follows Australian pop singer-songwriter Kylie Minogue on the road before and during her resurrected Showgirl - The Homecoming Tour, originally abandoned halfway through it&amp;#039;s original 2005 run, in Sydney, when Minogue was diagnosed with breast cancer.\n\nIntended as a document of Minogue&amp;#039;s return to the stage following her treatment and recovery from cancer, the film also features on-stage and back-stage footage and interviews with a number of Minogue&amp;#039;s tour crew, including Baker himself. Minogue&amp;#039;s sister Dannii and U2 lead Bono also feature. &quot;For most people, Neighbours, Michael Hutchence, gold hot pants and cancer equals Kylie,&quot; Baker suggests at the beginning of White Diamond. &quot;I want to rip that surface away.&quot;\n\nWhite Diamond is eponymously named after a Minogue track written by Scissor Sisters, also the sole new song performed by her on the Showgirl - Homecoming tour. The film opens with a reworked ballad version of the song. Two new recorded tracks, &quot;I&amp;#039;m Hip&quot; and &quot;You Are There&quot;, and a previously unheard 2002 Madonna track given to Minogue to record, &quot;Alone Again&quot;, are also featured on the soundtrack to the documentary.","torrent":{"xt":"urn:btih:2284e9356483fde1fbd71c79505d26ad81b06e1c","amp;dn":"Kylie+Minogue+-+White+Diamond+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2284e9356483fde1fbd71c79505d26ad81b06e1c","infoHashBuffer":{"type":"Buffer","data":[34,132,233,53,100,131,253,225,251,215,28,121,80,93,38,173,129,176,110,28]},"announce":[],"urlList":[]}}