{"title":"VA - Bravo Hits Vol.58 (2007) - Pop.","uid":3762522,"size":227703337,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:23238518035708b219725285934dce7c3bc04f45&amp;dn=VA+-+Bravo+Hits+Vol.58+%282007%29+-+Pop.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cholo24","files":43,"time":1186228046,"description":"Bravo Hits Vol. 58\n\nDisk: 1 \n1. Fergie - Big Girls Don&amp;#039;t Cry 2. Gwen Stefani - 4 In The Morning 3. Timbaland - The Way I Are 4. Monrose - Hot Summer 5. Enrique Iglesias - Do You Know? (The Ping Pong Song) 6. Marquess - Vayamos Companeros 7. Beyonce &amp; Shakira - Beautiful Liar 8. David Bisbal - Silencio 9. Mark Medlock &amp; Dieter Bohlen - You Can Get It 10. Mika - Relax, Take It Easy 11. Darin - Insanity 12. Befour - Magic Melody 13. Hot Banditoz - Que Si, Que No 14. Belle Perez - El Mundo Bailando 15. US 5 - Rhythm Of Life 16. Lemon Ice - Girl You Know It&amp;#039;s True 17. Lumidee feat. Pitbull - Crazy 18. Wally Warning - No Monkey 19. Bob Sinclar - Sound Of Freedom 20. The Disco Boys - Love You So 21. Peter Gelderblom - Waiting For \nDisk: 2 \n1. Bon Jovi - (You Want To) Make A Memory 2. Pink - Dear Mr. President 3. Ich + Ich - Vom selben Stern 4. Azad Feat. Adel Tawil - Prison Break Anthem (Ich glaub an Dich) 5. Christina StÃƒÂ¼rmer - Um bei Dir zu sein 6. Avril Lavigne - When You&amp;#039;re Gone 7. Maroon 5 - Makes Me Wonder 8. Maria Mena - Just Hold Me 9. Akon - Don&amp;#039;t Matter 10. Sarah Connor Feat. Ne-Yo - Sexual Healing 11. Tommy Reeve - I&amp;#039;m Sorry 12. Melanie C - Carolyna 13. Rapsoul - Erste Liebe 14. Pretty Ricky - (I Wanna See You) Push It Baby 15. Jan Delay - TÃƒÂ¼rlich, TÃƒÂ¼rlich 16. Die Fantastischen Vier - Einfach sein 17. Down Below - Private Soul Security 18. Killerpilze - Liebmichhassmich 19. LaFee - Heul doch 20. Revolverheld - Du explodierst 21. Sportfreunde Stiller - Alles Roger\n","torrent":{"xt":"urn:btih:23238518035708b219725285934dce7c3bc04f45","amp;dn":"VA+-+Bravo+Hits+Vol.58+%282007%29+-+Pop.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23238518035708b219725285934dce7c3bc04f45","infoHashBuffer":{"type":"Buffer","data":[35,35,133,24,3,87,8,178,25,114,82,133,147,77,206,124,59,192,79,69]},"announce":[],"urlList":[]}}