{"title":"TinTin en El Cetro de Ottokar","uid":3990885,"size":516455889,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:23f115b4f0864b3c56eab0ae364491c9d38aa673&amp;dn=TinTin+en+El+Cetro+de+Ottokar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alf1122","files":3,"time":1201034785,"description":"La trama central de El cetro de Ottokar estÃƒÂ¡ directamente inspirada en los acontecimientos histÃƒÂ³ricos: Borduria intenta anexionarse el reino de Syldavia con la ayuda de un personaje llamado Mustler. El complot consiste en aprovechar una debilidad en las tradiciones de la monarquÃƒÂ­a de este paÃƒÂ­s: el rey pierde el trono si no aparece empuÃƒÂ±ando el cetro de su antepasado Ottokar I durante el desfile del dÃƒÂ­a de San Vladimiro, fiesta nacional de Syldavia. Para ello algunos personajes prominentes de la corte syldava conspiran contra su rey para robar el cetro y forzarle a abdicar.\n\nEl Cetro de Ottokar IV es el objeto mÃƒÂ¡s preciado del pueblo syldavo. Se encuentra en el Castillo de Kropow bajo la seguridad de la guardia real. El cetro es venerado casi religiosamnete por el pueblo.\n\nTintÃƒÂ­n llega a Syldavia acompaÃƒÂ±ando a un profesor que cree que ha sido suplantado. Se entera de la trama e intenta avisar al rey pero los conspiradores evitan que pueda hablar con ÃƒÂ©l acusÃƒÂ¡ndole de ser un terrorista anarquista. Tras el robo del cetro, TintÃƒÂ­n intenta recuperarlo y lo consigue pocas horas antes del inicio del desfile, poor lo que el desastre no ocurriÃƒÂ³ y Syldavia conservÃƒÂ³ su independencia.\n","torrent":{"xt":"urn:btih:23f115b4f0864b3c56eab0ae364491c9d38aa673","amp;dn":"TinTin+en+El+Cetro+de+Ottokar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f115b4f0864b3c56eab0ae364491c9d38aa673","infoHashBuffer":{"type":"Buffer","data":[35,241,21,180,240,134,75,60,86,234,176,174,54,68,145,201,211,138,166,115]},"announce":[],"urlList":[]}}