{"title":"The Eyes of Tammy Faye (2000) Lions Gate - Documentary.wmv","uid":3764189,"size":725170082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2434a50f91886c6ce87981807586ca78df710b9d&amp;dn=The+Eyes+of+Tammy+Faye+%282000%29+Lions+Gate+-+Documentary.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"5cardstud","files":1,"time":1186360444,"description":"The Eyes of Tammy Faye (2000) Lions Gate - Documentary.wmv\nTime: 1:18:34 Size: 725,170,082 Bytes\nVideo: WMP v8 640x360 fps 5318kbps\nAudio: 0x0161 (WMA v2) 2 channel 44100Hz 64kbps CBR\n\nAmazon.com\nTammy Faye Bakker, she of the layers of makeup that made her face into a living Halloween mask, will forever remain a camp icon of &amp;#039;80s culture for many of us. Directors Fenton Bailey and Randy Barbato aren&amp;#039;t above needling Bakker for her more excessive accouterments, but The Eyes of Tammy Faye is ultimately a loving, sympathetic portrait of &quot;the first lady of televangelism.&quot; The film charts her life from traveling evangelist to the mother of three religious cable networks, and her fall from grace when husband Jim Bakker was forced out of the PTL (Praise the Lord) ministry after a scandalous affair. Always entertaining (sock puppets introduce each section) and at times surprising (did you know that Jim and Tammy were the first television ministers to reach out to the gay community and people with AIDS?), it rarely strays from Tammy Faye&amp;#039;s version of events. Jerry Falwell becomes the story&amp;#039;s sole scapegoat, but even the film&amp;#039;s best arguments don&amp;#039;t quite make Jim Bakker an innocent victim. But then it&amp;#039;s not his film, it&amp;#039;s Tammy Faye&amp;#039;s, and Bailey and Barbato seem to have fallen in love with their charismatic subject. If nothing else, they reveal the woman behind the cultural joke and celebrate a spiritual survival story. RuPaul Charles narrates, and clips from the 1990 TV movie Fall from Grace feature a young Kevin Spacey as the adulterous preacher. --Sean Axmaker\n\nProduct Description\nWitness the incredible real-life story of the spectacular rise, fall and resurrection of the &quot;Queen of the Eyelashes.&quot; Many times hilarious and oftentimes tragic, it is an amazing tale of one of the most adored and reviled women of our time.\n\nNarrated by RuPaul Charles, this award-winning film chronicles Tammy Faye&amp;#039;s personal journey from the genuine love-at-first-sight encounter with Jim Bakker and making of the most successful television ministry to being crucified in the court of public opinion.\n\nExtensive, revealing interviews by those on the inside will both shock and endear. Delve deep into the not-so-Christian scandals and million dollar lies that devastated the empire and destroyed her family.\n\nAnd be enlightened with Tammy Faye&amp;#039;s unique personal philosophies that helped her carry on... Because in spite of it all, Tammy Faye never lost hope in two things - extra thick mascara and Jesus Christ.\n\nStarring: Tammy Faye Bakker, RuPaul Charles\nDirected By: Fenton Bailey, Randy Barbato\n\nOfficial Site: www.eyesoftammyfaye.com\nIMDB:  www.imdb.com/title/tt0233687/\nReview: www.rottentomatoes.com/m/eyes_of_tammy_faye/\n\n","torrent":{"xt":"urn:btih:2434a50f91886c6ce87981807586ca78df710b9d","amp;dn":"The+Eyes+of+Tammy+Faye+%282000%29+Lions+Gate+-+Documentary.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2434a50f91886c6ce87981807586ca78df710b9d","infoHashBuffer":{"type":"Buffer","data":[36,52,165,15,145,136,108,108,232,121,129,128,117,134,202,120,223,113,11,157]},"announce":[],"urlList":[]}}