{"title":"King Naresuan Episode 1 [Thai Movie]","uid":3925292,"size":2543557576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2503f479d1695355f002356fbc05b1b961743981&amp;dn=King+Naresuan+Episode+1+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"poothaijaa","files":4,"time":1197049702,"description":"Detail\n\nDrama / Documentary\n\nKing Naresuan : Episode 1\n\nYear : 2007\n\nStarring : Wonchana Sawasdee, Chatchai Plengpanich, Jakkrit Amarat.\n\n\n(Collector&amp;#039;s Edition)\n- Full movie (3 VCDs)\n- The Making of (1 VCD)\n\n4 VCDs\nSound : Thai\nSubtitle: NONE\nRelease date : 15 May 2007\n\n\nAbout :\n\nPhitsanulok was the birthplace of one of the greatest heroes in Thai history - King Naresuan who was born in 1555. His father, King Mahathammaracha was a descendant of the Phra Ruang dynasty of Sukhothai, and his mother was Queen Phra Wisut Kasattri of the Suwannaphum dynasty of Ayutthaya.\n\nAt the age of nine, he had been taken as hostage to Burma for 6 years. King Naresuan was a great warrior king. He liberated Ayutthaya from Burma while he was the Crown Prince. He led the soldiers into battles to defend the country against Burmese invasions many times. He is also widely known among the Thais nowadays for his heroic efforts. He led the assault of a Burmese camp by climbing the wooden stockade with the blunt side of a saber in his mouth. He had a duel on elephants with the Burmese Crown Prince and slew him. He took the offensive against Burma and also dealt with the Cambodians who made a series of raids. King Naresuan extended Ayutthaya&amp;#039;s territory to include Lanna, Lanchang, Cambodia and some parts of Burma. He enforced strict discipline on his soldiers and the people. During his reign, Ayutthaya was a very secure and powerful state.\n\nApart from being a great warrior, King Naresuan also played a significant role in foreign relations and trade. Realizing the importance of foreign trade, he sent envoys to China and Spain, and cultivated friendly relations with the Europeans. Ayutthaya concluded a treaty of friendship and commerce with Spain, which was the second treaty that Siam made with a European Power. (The first European power with which Siam had a treaty was Portugal.) Under this treaty, Spaniards had the right to reside, to trade and to practice their religion in Siam. At the end of his reign, he exposed Ayutthaya to another western nation - the Dutch.\n\nKing Naresuan deserved the honor of being &quot;the Great&quot;. He not only restored the national independence but also made Siam such a powerful country that no enemy threatened the walls of Ayutthaya again for a period of one hundred seventy three years.\n\nThree of King Naresuan&amp;#039;s weapons and belongings have constituted a part of the Royal Regalia down to the present. The first is the musket with which he shot the Burmese leader in one of the battles to defend Ayutthaya against Burma. Second is the saber that he carried in his mouth during his assault on the Burmese camp at Ayutthaya. The last is the leather hat with a brim cut-off in the shape of a crescent moon, which he was wearing when he engaged in a duel on elephants with the Crown Prince of Burma.","torrent":{"xt":"urn:btih:2503f479d1695355f002356fbc05b1b961743981","amp;dn":"King+Naresuan+Episode+1+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2503f479d1695355f002356fbc05b1b961743981","infoHashBuffer":{"type":"Buffer","data":[37,3,244,121,209,105,83,85,240,2,53,111,188,5,177,185,97,116,57,129]},"announce":[],"urlList":[]}}