{"title":"WingMakers Music (*.CCD)","uid":3354762,"size":383285204,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:250b37824ac9fafad6a6023eeef5ca848ff5d331&amp;dn=WingMakers+Music+%28%2A.CCD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"azja","files":4,"time":1121074682,"description":"The music of Chamber 10 weaves compositional patterns and sounds from all corners of the globe -- geographically and historically -- into a universal anthem of the Wholeness Navigator. It is a complex staging of compositions that will guide your consciousness into the realm of unity in which we all derive and originate. \n\nChamber 10, in the context of the human genome, is analogous to the genetic structure of the human chromosome 10. This chromosome regulates, in large measure, the condition of well-being within the human instrument and its relationship to physical, emotional, and mental forms of stress. \n\nChamber 10 is being released now, during this period of increased stress and turmoil, as a means to facilitate a renewed connection within people to their state of wholeness and unity. It is from this state of experience that stress and fear are diminished, and one's immunity system enhanced. \n\nIt is suggested to listen to this music a minimum of seven, uninterrupted times, in a comfortable position, eyes closed, and yielding to the journey it will invoke within you. Listening with headphones is recommended. During this journey feelings will undoubtedly arise, and as they do, bless them as you would any source of kindness. They will become signposts in your musical adventure. \n\nThere are 38 musical compositions within Chamber 10 that flow together seamlessly. These musical &quot;stanzas&quot; express the flowing movement and multi-faceted expression of the Wholeness Navigator. They are bridges through which you can travel between worlds and dimensions. \n\nThis is not meditative music whose purpose is to relax your mind and body. The music of Chamber 10 is designed to call forth that part of you that is eclipsed by your human personality and the human dimension of experience. It is an aural data stream that causes a resonance of the unity vibration that is stored inside all humans. \n\nMay this music bring you an awakening of how we are woven from the same source, and may you experience the heart of your consciousness, if only for a moment in time. \n","torrent":{"xt":"urn:btih:250b37824ac9fafad6a6023eeef5ca848ff5d331","amp;dn":"WingMakers+Music+%28%2A.CCD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"250b37824ac9fafad6a6023eeef5ca848ff5d331","infoHashBuffer":{"type":"Buffer","data":[37,11,55,130,74,201,250,250,214,166,2,62,238,245,202,132,143,245,211,49]},"announce":[],"urlList":[]}}