{"title":"Discovery - Unsolved History 2x18 - Flight KAL-007","uid":3973026,"size":366925824,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:253c8ff4a881b7989108ded3a720a39531ba4217&amp;dn=Discovery+-+Unsolved+History+2x18+-+Flight+KAL-007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zvvzvvv","files":1,"time":1200100064,"description":"Unsolved History is history the way it was! Through detailed examination of archeological and forensic evidence, existing photographs, authentic artifacts, and carefully selected interviews from eyewitnesses and experts ? events are reconstructed and historical questions are finally answered.\n\nSeptember 1, 1983 ? a Korean Airlines 747, carrying 269 people, is shot down while flying through Soviet airspace. Everyone on board is killed, including 61 Americans. Twenty-three casualties were children under the age of twelve. The Soviets claim the plane was on a spy mission and that their actions were justified. The United States insists that Russia fired without provocation.\n\nJoin the Unsolved History team as they launch a new investigation into this tragedy, using technology and forensic science not available 20 years ago. Through careful re-examination of existing photographic, oceanographic and electronic records, experts set out to determine whether the KAL-007 disaster was simply a case of mistaken identity on the part of the Russian anti-aircraft ? and whether flaws in the jet&amp;#039;s navigational gear caused it to veer into unauthorized airspace. Plus, investigators look into the most puzzling aspect of all: Why was so little of the wreckage, including the remains of the passengers, never found?","torrent":{"xt":"urn:btih:253c8ff4a881b7989108ded3a720a39531ba4217","amp;dn":"Discovery+-+Unsolved+History+2x18+-+Flight+KAL-007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"253c8ff4a881b7989108ded3a720a39531ba4217","infoHashBuffer":{"type":"Buffer","data":[37,60,143,244,168,129,183,152,145,8,222,211,167,32,163,149,49,186,66,23]},"announce":[],"urlList":[]}}