{"title":"Pinnacle Studio v 9.4.3 Patch Only","uid":3371794,"size":70729900,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:265057430fa0f94273ec969a0edb832699b6250b&amp;dn=Pinnacle+Studio+v+9.4.3+Patch+Only&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MontyPython","files":1,"time":1124446894,"description":"Pinnacle recommends installing the 9.4.3 patch for all previous Studio 9 and Studio 9 Plus versions. Studio 9.4.3 is the latest version of Studio 9 to be released. Click here to go to the 9.4.3 download page. Make sure you look at the fix list below before downloading and installed the patch.\n\nThe history of fixes in ALL previous Studio 9 patches is listed below. All of the fixes below are also incorporated into the latest version of Studio 9.\n\nFixes in 9.4.3 from 9.4.2\n# AV Synch (audio drift) with 32KHz-12bit audio DV AVI captures is fixed\n# DC10+ scene detection is no loneger off by two frames\n# Several DVD Import issues fixed\n# Import of AVI files with MP4S CODEC (MS MPEG4 flavor) is now properly supported\n# Overlay image transparency in Picture in Picture no longer appears washed out\n# Fixed interlacing problem with HFX transitions on DV output\n# Improved edit performance and responsiveness\n# High memory utilization and CPU utilization issuess fixed\n# Crash when accessing SmartSound/Sound Effects is fixed\n# Guided tour prompt is available at startup\n# Uninstall now uninstalls patch and base installation properly\n# Corrected problems with Output to tape with h DVC150b and Moviebox USB\n# Fixed jittery output of some MPEG files with Moviebox DV\n# Fixed problem with mixed MPEG types hanging DVD playback after burning\n\nFixes in 9.4.2 from 9.4.1\n# Fixed 2 issues where trimming didn?t work correctly in 9.4.1\n\nFeatures in 9.4.1 from 9.3.5\n# Import, edit and export of DivX files\n# Import, edit and export of progressive scan MPEG-2 files\n# Import and edit video from DVD's created by Studio, DVD camcorders or set top DVD recorders\n# Video Codecs wrapped in AVI files will be supported on import: DIVX Codec (upto DIVX 5.22), XVID Codec &amp; ISO MPEG-4 Codec(3 flavors MPEG4, MPEG43 &amp; MPEG4s). Note that ISO MPEG4 import works only if the user already has the codec or downloads it from Microsoft\n# Audio Codecs wrapped in AVI files that will be supported on import: MP3 Codec (CBR), AC3 Codec (CBR).\n# Audio Codecs wrapped in MPEG2 Program Stream files that will be supported on import: LPCM Codec, AC3 Codec (CBR\n\nNOTE: DivX import requires Pinnacle Advanced Codec Pack, available for $9.99. DivX export require existing DivX codec, or Pinnacle Advanced Codec Pack, available for $9.99\n\nCapture Mode Improvements and Enhancements in 9.4.1 from 9.3.5\n# DV-1394 Captures now maintain their aspect ratio regardless of analog capture settings\n# Studio MPEG captures now contain aspect ratio info in file header for better import into other applications\n# Can now capture pre-defined length MPEG-1 over 1394\n# Fixed problem with MJPEG captures being shifted up by a few lines\n# DV Camera forward/reverse cueing now works as expected\n# Fixed DVC 120- crash w/Pcleutil.dll error when setting to PAL\n# Fixed problem with noise at the bottom of DVC 120 captures\n# Fixed DVC 120 capture hangs\n\nEdit Mode Improvements and Enhancements in 9.4.1 from 9.3.5\n# Can now apply speed effects to multiple clips\n# Fixed crashes and error messages when using video effects\n# Can now adjust length of multiple stills simultaneously\n# Improved timeline editing of titles and transitions on OVT and PVT\n# Enhanced undo/redo functionality\n# Default length for PAL titles and transitions now have logical values\n# Framegrabber now inserts into the correct timeline position with locked tracks\n# Can now import MP3s from CD\n# Enhanced support for variable bitrate MP3 files\n# Dissolves now work correctly on the overlay track\n# Improved performance during timeline scrubbing of MPEG files\n# Can now cut and paste multiple clips from Album to Timeline or Storyboard using standard shortcut keys\n\nMake Movie Mode Improvements and Enhancements in 9.4.1 from 9.3.5\n# Fixed size estimation problems when making movie/DVD\n# Its is now possible to create 8.5GB DVD images on hard disk even if there is no disc/burner in the system\n# Fixed occasional crash when burning a second DVD\n# VIDEO_TS folder name is now capitalized\n# Fixed some hangs on rendering\n# Removed superfluous messages in message.log file\n# Fixed AV synchronization problems resulting from use of MPEG files with internal timing errors\n\nOther Improvements and Enhancements in 9.4.1 from 9.3.5\n# Fixed problems upgrading from Quickstart and SE\n# Version checker no longer erroneously reports missing files after upgrading to Plus\n# Fixed uninstall/reinstall problems\n# Fixed DVC150b driver installation problem\n\n\n\nFixed in 9.3.5 from 9.3.0\n# Significant improvement in ChromaKeyer quality\n# DV camcorders are now initialized properly on French systems.\n# Can no longer trim multiple-selected clips (this caused clips to disappear)\n# Improved performance with cutting and pasting clips and transitions together.\n# DC10+ Custom settings are properly retained after selecting SECAM\n# DC10+ Capture settings and preset options are now displayed properly\n# Slow-mo effects on the overlay track are now rendered properly\n# Undoing changes to motion menus now works correctly\n# Trimming clips on the primary video track now updates linked clips correctly\n# Improved preview of Smartmovies\n# Improved DV editing performance\n# No longer creates DVD layer break in single-layer projects\n# Setting a chapter link in the same clip to multiple menus in Storyboard mode works properly\n# After undo of SmartMovie, &quot;Create SmartMovie&quot; button is no longer disabled\n# Preview for generic YUV capture devices now works properly\n# HFX transitions are properly installed locked/unlocked as applicable; previously installed HFX transitions are properly accessible in the album and in saved projects\n# Applying a time effect to a clip now works properly for all effect settings\n# Supports Dual layer DVD image creation even if the system does not have a Dual Layer burner\n# Several Operation failed errors with transitions, trimming and clip insertion addressed\n# ?J? and ?L? cuts and transitions are now handled correctly\n# Performance improvement in insertions of large number of clips from the tape album\n# UI clean up for audio and video tool boxes\n# Performance enhancements in menu, graphic and title display in the album\n# Performance enhancement in timeline playback of the project\n# Can now copy selected clips if first clip in selection is a Fade In/Out transition\n# Split clip in Storyboard and Text view now updates correctly\n# Can now export project using smart sound or CD audio\n# Fade transition is now applied correctly on audio\n# HFX filter now applies correctly\n","torrent":{"xt":"urn:btih:265057430fa0f94273ec969a0edb832699b6250b","amp;dn":"Pinnacle+Studio+v+9.4.3+Patch+Only","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"265057430fa0f94273ec969a0edb832699b6250b","infoHashBuffer":{"type":"Buffer","data":[38,80,87,67,15,160,249,66,115,236,150,154,14,219,131,38,153,182,37,11]},"announce":[],"urlList":[]}}