{"title":"Xtreme Xmugen 2.0 Final for Xbox","uid":3942715,"size":1703189531,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:27777ea8523aa2f0d8d1765dd352e0e54bca1e47&amp;dn=Xtreme+Xmugen+2.0+Final+for+Xbox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"XxRaVeNxX","files":3,"time":1198258549,"description":"Mugen is a freeware game engine that allows you to play fighting matches with an unlimited number of characters and stages. Infinitely customizable, mugen facilitates users&amp;#039; creativity and artistic skills as they create the various aspects of the game. First released in 1999 by Elecbyte, the community has thrived even in spite of the company&amp;#039;s sudden dissolution in 2003, yet rumors are abound that they are returning. M.U.G.E.N. may be the best kept secret of the gaming community!\nXmugen is the xbox version of Mugen, run under linux.\n\nWhat this version is a totally re-vamped version, that was previously uploaded. A little over 550 characters, with about 30 stages. This is a lot more organized, with all 550+ characters organized according to the game they originated from. The crashing is brought down from a minimum in the arcade, as everyone is assigned a stage/order.\n\nThere is some great music in some of the stages such as Shining Force and Snatcher from Sega CD.\n\nOnce again, nude/hentai, and pocket/chibi characters were not included.\n\nMugen is completely customizable you can pretty much customize who and when you want to fight during the arcade, and even make a certain stage a bonus stage, like in Street Fighter 2, with that &amp;#039;destroying the car&amp;#039; stage. I mean you can even have your music for stages.\n\nFor instance, the life bars have been changed, the music has been changed, and most of the sound effects have also been changed in this release.\n\n\nThe Only Thing You Need to Do to Play; Is DRAG AND DROP the xmugen folder in the Games(Make Sure It Has A Capital G) folder of the F: in your xbox.\n\nIf you want the E: version, it is in the Addon Rar; just transfer the MFJ folder from this one to that one.\n\n\nAlso about characters, they are created by sprites, people can&amp;#039;t just rip a complete character from MVC, only the sprites, which is there are so many versions of one character you may find. One Ryu may play like SSFT2, one may play like SFA, one may play like MVC, and one may be more developed than the other.(Like they got it closest to the developer and plays smoother), and one may be made up completely like an Evil Ryu. Also, their AI is built from the ground up, also..\n\nIf you know anything about Mugen, Characters seem to be traded and hoarded, but there are many &amp;#039;rare/WIPs/leaked&amp;#039; characters in this pack, just download the &amp;#039;characternfo&amp;#039; to see which characters are in here.\n\nAlso, better developed characters seems to &amp;#039;alternate modes&amp;#039; when you hold start and select them, and have &amp;#039;special intros&amp;#039; when they fight certain people.\n\n\n- XxRaVeNxX\n\n\nAlso, it is completely possible to burn this to a DVD, go to the development forum for more about this.\n\n\nAlso, when you get this installed in your Xbox, just press the Right Analog, to get pass the &amp;#039;F1&amp;#039; Screen.\n\nCredits/Thanks: \nr1sky1: For Developing this &amp;#039;Drag &amp; Drop Distribution of Xmugen\nSlude: For Creating the Xmugen Renamer\ntwo4teezee: Many sounds are ripped from his BrokenMugen\nstrikingeuphony: For assisting me in showing how to change screenpacks, which allowed me to change lifebars ;)\nSNKgal/Guybird/seanp2500: All the IRC Help/Chit Chat\n\nFYI:\n\nIf you are trying to run this through XBMC, you may run in to problems, has something to do with the cache. Use UnleashX to minimize problems.\n\nAlso, last time, it was stated that people with an Xbox 1.6 was not able to run it, yet this may be a user error, as one of the testers, plays Xmugen on a Xbox 1.6. It may be a problem using this on the F: Drive, try the E: Version instead.\n\n\nSeems the Developmental Forum has gone under, good thing, I had many essential files saved, before that happened...\n\n\nAddons&amp;#039; Rar:\nxmugen4.9-dvd_addon: Used This to Attempt to Play This From DVD\nXmugen_Renamer_2.2_(2-20-2007):When you find more characters/stages; it you need to run this program on the stages/characters to make them compatible with Xmugen.\nxmugen_4.9_[F_drive]: Stripped Version of This for the F drive; Without the Characters/Stages\nxmugen_4.9_[E_drive]:: Stripped Version of This for the E drive; Without the Characters/Stages\n\nDon&amp;#039;t Let Mugen Die!\t\t","torrent":{"xt":"urn:btih:27777ea8523aa2f0d8d1765dd352e0e54bca1e47","amp;dn":"Xtreme+Xmugen+2.0+Final+for+Xbox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27777ea8523aa2f0d8d1765dd352e0e54bca1e47","infoHashBuffer":{"type":"Buffer","data":[39,119,126,168,82,58,162,240,216,209,118,93,211,82,224,229,75,202,30,71]},"announce":[],"urlList":[]}}