{"title":"SiSoftware Sandra XII SP1 2008 1.13.12 from pro home to enterpri","uid":3933012,"size":67430571,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:27d6fcb7411114bc7c948d092f5258835215e22b&amp;dn=SiSoftware+Sandra+XII+SP1+2008+1.13.12+from+pro+home+to+enterpri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":4,"time":1197612205,"description":"SiSoftware has announced the availability of SiSoftware Sandra 2008, the latest version of its award-winning utility which includes remote analysis, benchmarking and diagnostic features for PCs, servers, PDAs1, Smart Phones1, small office/home office (SOHO) networks and enterprise networks. \n\nSiSoftware Sandra (the System ANalyser, Diagnostic and Reporting Assistant) is an information &amp; diagnostic utility. It should provide most of the information (including undocumented) you need to know about your hardware, software and other devices whether hardware or software. It works along the lines of other Windows utilities, however it tries to go beyond them and show you more of what&amp;#039;s really going on. Giving the user the ability to draw comparisons at both a high and low-level. You can get information about the CPU, chipset, video adapter, ports, printers, sound card, memory, network, Windows internals, AGP, PCI, PCI-X, PCIe (PCI Express), database, USB, USB2, 1394/Firewire, etc.\n\nNative ports for all major operating systems are available:\n* Windows 2000, XP, 2003, Vista*, Longhorn* (x86)\n* Windows x64 Edition XP/2003/Vista*/Longhorn* (AMD64/EM64T)\n* Windows 64-bit Edition 2003/Longhorn* (IA64)\n* Windows Mobile 2003/2003SE (ARM CE 4.20)\n* Windows Mobile 5 (ARM CE 5.01)\n* Windows Mobile 6 (ARM CE 5.02) \n\nAll major technologies are supported and taken advantage of:\n* SMP - Multi-Processor\n* MC - Multi-Core\n* SMT/HT - Hyper-Threading\n* MMX, SSE, SSE2, SSE3, SSSE3 - Multi-Media instructions\n* Wireless MMX - Mobile multi-media instructions\n* NUMA - Non-Uniform Memory Access\n* AMD64/EM64T/x64 - 64-bit extensions to x86\n* IA64 - Intel* Itanium 64-bit \n\nKey features:\n* 4 native architectures support (x86, x64/AMD64/EM64T, IA64/Itanium3, ARM).\n* 3 native platforms support (Windows, Windows Mobile, Windows CE4).\n* Additional platforms supported through Java RE (e.g. Linux, FreeBSD, Mac OSX, Solaris5).\n* Additional platforms supported through .NET CLR (e.g. Mono/Linux5).\n* 19 established benchmarking modules, 4 new to this version.\n* 38 detailed information modules, 4 new to this version.\n* Huge official hardware support through technology partners (Intel, AMD/ATI, SiS, VIA)\n* Future instructions set support (Intel SSE46, AMD SSE4A6) on x86 and x64/AMD64/EM64T platforms.\n* 6 charting options: combined, detailed, differences, components, performance vs. speed charts.\n* 5 language versions (English, German, French, Italian, Russian) in a single installer.\n* Enhanced Sandra Lite version (free for personal/educational use) \n\nNotes:\n1 .NET (Compact) Framework 2.0 and later supported.\n2 Sun Java SE 6 (1.6.x) and later supported.\n3 By special arrangement.\n4 By special arrangement; device SDK required.\n5 By special arrangement; Applet version only.\n6 Unreleased, next-generation pre-release platforms at publication time. \n\nNew in SiSoftware Sandra XII (2008):\nLondon, UK, August 15th 2007 - We are pleased to launch SiSoftware Sandra XII (2008), the latest version of our award-winning utility, which includes remote analysis, benchmarking and diagnostic features for PCs, servers, PDAs, smart-phones and networks.\nOver time, there has been a continued and sustained growth in software portability and the development of software that can ultimately be executed on multiple platforms without recompilation. With the use of the software virtual machine (SVM) growing, be that .NET1 or Java2, the importance of offering a benchmark that measures their performance has grown.\nThe introduction of these benchmarks will soon allow the complete suite to be available on other operating systems - not just on Microsoft Windows, as we expanded into non-x86 architectures (IA64/Itanium3, x64/AMD64/EM64T, ARM) in the previous years. We have also added additional support for Virtual Machine and Runtime Engines to open up this information now to the our users.\nNot everything in this release is virtual: as with all releases there is something very real in adding more and more support and trying to predict the new needs of our users as we achieved with each release. Support for digital certificates and cryptography, detailed information of the security settings, policies, users and groups of your computer, wireless networks and advanced charting.\n\nThis version adds the following new modules and functionality:\n* .NET Benchmarking1\no .NET Arithmetic: Shows how well the system handles .NET arithmetic operations through the .NET CLR in comparison to other typical .NET CLRs.\no .NET Multi-Media: Shows how well the system handles .NET multi-media operations through the .NET CLR in comparison to other typical .NET CLRs. \n\n* Java Benchmarking2\no Java Arithmetic: Shows how well the system handles Java arithmetic operations through the Java Runtime Engine (JRE) in comparison to other typical Java Virtual Machines.\no Java Multi-Media: Shows how well the system handles Java multi-media operations through the Java Runtime Engine (JRE) in comparison to other typical Java Virtual Machines. \n\n* Information and Diagnostics\no Virtual Machines and Runtime Engines: Information about the software Virtual Machines (VM), Runtime Engines (RE) and software engines installed on your computer.\no Cryptography and Certificates: Information about the cryptographic providers, algorithms and security certificates installed on your computer.\no Sessions: Information about the client sessions hosted by your computer under Terminal Services.\no Users and Groups: Information about the users and user group accounts registered on your computer and on your domain. \n\n* Wireless Support: Information about the wireless (802.11a/b/g/n) networks and devices in addition to the Bluetooth, IrDA (Infrared) and networking capabilities.\n\n* Enhanced Network (LAN/WAN) Capabilities\no Bluetooth Devices and Networks\no Wireless Devices and Networks\no Terminal Servers\no Universal Plug &amp; Play (UPnP) Devices and Networks \n\n* New Advanced Charting Capabilities\no Differences Chart: view the differences between the tested device and reference devices.\no Components Chart: contrast the indexes against one another for both current and reference device.\no Performance vs. Speed: contrast the results against device speed (MHz, bps, etc.); how much more performance do you get from a faste device?\no Performance vs. Power: contrast the results against device power (TDP); how much more power does a faster device consume? \n\nWith each release, we add new support and compatibility for the latest hardware, architectures and operating systems, and this is no exception. SiSoftware continues to work with hardware vendors to ensure the best support for new emerging hardware.\n\nhave fun and enjoy The Joker (Have a mery X-Mass)\n","torrent":{"xt":"urn:btih:27d6fcb7411114bc7c948d092f5258835215e22b","amp;dn":"SiSoftware+Sandra+XII+SP1+2008+1.13.12+from+pro+home+to+enterpri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27d6fcb7411114bc7c948d092f5258835215e22b","infoHashBuffer":{"type":"Buffer","data":[39,214,252,183,65,17,20,188,124,148,141,9,47,82,88,131,82,21,226,43]},"announce":[],"urlList":[]}}