{"title":"The Playing Favorites-I Remember When I Was Pretty 2oo7","uid":3920642,"size":73978091,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:27ff612308c4b4bcf30d2f23effd586ce94190b1&amp;dn=The+Playing+Favorites-I+Remember+When+I+Was+Pretty+2oo7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"staywizu","files":17,"time":1196779473,"description":"There&amp;#039;s an ongoing joke: When musicians get too wasted they start side\nprojects. These grandiose schemes usually fizzle as attention spans are\nrerouted to deal with hangovers and coming back down to reality. Occasionally\nthere are exceptions to this rule...\n\nEnter The Playing Favorites, a band born out of an idea conceived on a\ndrunken night in Japan when old pals Joey Cape and Luke Tierney were on tour\ntogether in their respective bands (Me First &amp; the Gimme Gimmes and The\nPenfifteen Club). Caffeine and/or alcohol-assisted brainstorms ensued with\nmore good friends; Tim Cullen (a solo artist and former singer/guitarist of\nSummercamp); Marko DeSantis (guitarist of Sugarcult and bassist of another\nCape band, Bad Astronaut); and Mick Flowers (who had played in Tim and\nMarko&amp;#039;s early 90&amp;#039;s band Popsicko, and bands such as The Rentals, and The\nLapdancers). The five of them originate from Santa Barbara, CA but have all\ncarved out new lives in different cities. They have such an intertwining\nhistory of musical relationships that a family tree would look more like a\nfamily forest. Soon after, the concept of making a record together grew into\na plan.\n\nEveryone synchronized their calendars and found a week of time to meet at The\nSandbox Studio in Los Angeles. With Rick Parker (Black Rebel Motorcycle Club,\nThe Shore) behind the glass they rolled up their sleeves and got right to\nwork. Time and money were of the essence the so process was as follows: set\nup the gear, throw up some microphones, learn a song, record it, pass the mic\nto the next guy that had a song, and do it again.\n3 songs a day were recorded over a period of 5 days (the final 2 days were\nused for a few basic changes), resulting in 14 inspired-by-the-moment songs;\ndiverse in style, but united by mutual respect. The raw tracks were then\nfermented for about a year; the elapsed time providing a fresh perspective on\nthe songs. Final touches were made and the record was finished.\n\nThere&amp;#039;s a refreshing honesty and authenticity to The Playing Favorites that\ncan&amp;#039;t be fabricated. Their debut album &quot;I Remember When I Was Pretty&quot; plays\nlike a tribute to a collective and possibly checkered past of a circle of\nfriends.\n\n\n\n01. Leavingtown                \n02. Everyone Else              \n03. Good Years                 \n04. Waiting                    \n05. This is the Last Train     \n06. Spill My GUts              \n07. Futuring                   \n08. Indigenous                 \n09. Drug Hugger                \n10. Stay                       \n11. Whole Lotta Nothin         \n12. The Problems Last          \n13. Wasteland                  \n14. Citizen&amp;#039;s Band             ","torrent":{"xt":"urn:btih:27ff612308c4b4bcf30d2f23effd586ce94190b1","amp;dn":"The+Playing+Favorites-I+Remember+When+I+Was+Pretty+2oo7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27ff612308c4b4bcf30d2f23effd586ce94190b1","infoHashBuffer":{"type":"Buffer","data":[39,255,97,35,8,196,180,188,243,13,47,35,239,253,88,108,233,65,144,177]},"announce":[],"urlList":[]}}