{"title":"Tears.For.You.2006.DVDRip.XviD-AXiNE","uid":3883851,"size":1469106487,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:28b3a0bf49e59604d947ab720452f09b0e3fbfb0&amp;dn=Tears.For.You.2006.DVDRip.XviD-AXiNE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"egban","files":5,"time":1194798599,"description":"     8-year old Yotaro gains a 3-year old step-sister, Kaoru, when his mother marries a jazz musician who plays in a club in Naha, Okinawa where they live. Before long Kaoru&amp;#039;s father deserts them, and not long afterward Yota&amp;#039;s mother becomes terminally ill. Her dying wish is for him to watch out for Kaoru at his grandmother&amp;#039;s place on a small island off the coast of Okinawa. He fulfills her wish and becomes very protective of his younger sister who calls him &quot;nee-nee.&quot; \n\n     Thirteen years later Kaoru returns to Naha and comes to live with him as she starts high school. Yota works hard making deliveries of vegetables from an open-air market by day, and in a restaurant (he is a licensed chef) by night to save money to fulfill his dream of having his own restaurant. He also assumes the role of pushing for Kaoru&amp;#039;s entrance to a university. This allows less time for his beautiful girlfriend Keiko, the daughter of a doctor and a medical student at Ryukyu University. It seems that Yota&amp;#039;s dreams start to come together when Mr. Kameoka sells him a place for a restaurant. \n\n     Yota works hard constructing the place, but just as he is to open, the real owner appears. Being swindled, Yota is left with a large outstanding loan. Keiko&amp;#039;s father&amp;#039;s plans do not include a working class son-in-law as he explains when he offers to pay Yota&amp;#039;s debt. Although he refuses, Yota concludes he is not best for Keiko&amp;#039;s future. \n\n     Years later he continues to overwork even after the debt is paid and Kaoru starts university study. With her feelings of love for Yota growing deeper, they mutually decide to live apart.  --Written by Brian Greenhalgh for IMDB.\n\nMain Cast: Satoshi Tsumabuki, Masami Nagasawa and Kumiko Aso.","torrent":{"xt":"urn:btih:28b3a0bf49e59604d947ab720452f09b0e3fbfb0","amp;dn":"Tears.For.You.2006.DVDRip.XviD-AXiNE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28b3a0bf49e59604d947ab720452f09b0e3fbfb0","infoHashBuffer":{"type":"Buffer","data":[40,179,160,191,73,229,150,4,217,71,171,114,4,82,240,155,14,63,191,176]},"announce":[],"urlList":[]}}