{"title":"History.Channel.Lost.Worlds.PCCD.English.","uid":3993061,"size":109088186,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a0148617b11634b5d151fed67bed3aa3e3b95fe&amp;dn=History.Channel.Lost.Worlds.PCCD.English.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spatorrent","files":2,"time":1201163654,"description":"The monuments of the ancient world are virtually brought back to life in Lost Worlds, a fantastic History Channel series that combines historical expertise and computer-generated imagery to restore ancient structures to their original condition. Just as the packaging promises, this riveting 13-part series allows viewers to &quot;explore the past rebuilt in stunning detail,&quot; following a format as richly educational as it is visually impressive. The 50-minute episodes are loosely grouped by historical epoch, beginning with the Christian emphasis of disc 1, with episodes focusing on &quot;The Knights Templar&quot; (showing the virtual reconstruction of the city of Tortosa), &quot;Jesus&amp;#039; Jerusalem&quot; (focusing on Herod&amp;#039;s temple Mount, the Via Dolorosa, and other places where Jesus traveled), and &quot;The First Christians,&quot; in which the cities of Tarsus and Ephesus are studied and rebuilt, along with the mysterious cave dwellings of Cappadocia, where some of the earliest Christian churches were built. Disc 2 moves to ancient Greece and Egypt, where new theories connect the remains of a Cretan temple to the lost city of Atlantis; &quot;Ramses&amp;#039; Egyptian Empire&quot; shows us brilliant revivals of the temples of Karnak and Abu Simbel; and &quot;Athens: Ancient Supercity&quot; focuses on 5th-century B.C. Greek structures like the Parthenon and the Senate.\n\nDisc 3 jumps forward to the architectural mysteries of World War II, uncovering the top-secret, high-security structures built in the United States to support the development and construction of the atom bomb; &quot;Hitler&amp;#039;s Supercity&quot; of Germania, the Fuhrer&amp;#039;s Greco-Roman dream that never came to pass, yet remains evident in the massive structures of the Third Reich; and &quot;Churchill&amp;#039;s Secret Bunkers&quot; beneath the streets of London, a fascinating network of underground tunnels used as an allied command center impervious to German bombing raids. Disc 4 focuses on the enigmatic histories of Europe, with episodes on &quot;The Real Dracula&quot; (rebuilding the remote Romanian castle of the notorious &quot;Vlad the Impaler&quot;); &quot;Braveheart&amp;#039;s Scotland&quot; demonstrates how 13th-century Scottish culture was far more sophisticated than its depiction in Mel Gibson&amp;#039;s popular OscarÂ®-winning film Braveheart; and &quot;The Pagans&quot; offers an in-depth history of the British Isles, where the pagan people built astonishing, spiritually vital structures like Stonehenge. A bonus episode--the series pilot--focuses on Palenque, the magnificent Mayan temple-city that rises from the jungle of Chiapas, Mexico.\n\nIn each of these episodes, historians, architects, and engineers are consulted as on-screen guides to our fascinating journeys to the past. The result is a detailed narrative that combines social, religious, political, and technological aspects of history, until the magic moment arrives when all of this information is used (along with detailed CGI imagery) to unveil these important structures in their pristine form--in many cases more colorful and architecturally impressive than anyone could imagine. All of this makes Lost Worlds a richly rewarding experience, essentially the next best thing to owning a time machine. --Jeff Shannon ","torrent":{"xt":"urn:btih:2a0148617b11634b5d151fed67bed3aa3e3b95fe","amp;dn":"History.Channel.Lost.Worlds.PCCD.English.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a0148617b11634b5d151fed67bed3aa3e3b95fe","infoHashBuffer":{"type":"Buffer","data":[42,1,72,97,123,17,99,75,93,21,31,237,103,190,211,170,62,59,149,254]},"announce":[],"urlList":[]}}