{"title":"Mad Flava- From The Ground Unda- 1994","uid":3987930,"size":468485370,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2a29d49ca84e910449b516f8e2f6ee9a4d1895ba&amp;dn=Mad+Flava-+From+The+Ground+Unda-+1994&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"undarated","files":43,"time":1200911746,"description":"In hip-hop parlance, &quot;flow&quot; is a term that refers to a rapper&amp;#039;s delivery or rhyming technique -- what a musician calls &quot;chops,&quot; a hip-hopper calls a &quot;flow.&quot; On From the Ground Unda, Mad Flava emphasizes flow, flow and more flow. While other rap CDs might concern themselves with telling some type of story or pulling the listener in with hooks or beats, the main purpose of this CD is showing off Mad Flava&amp;#039;s flows. To be sure, the members of Mad Flava (an obscure group from Dallas) have a strong technique, but unfortunately, hearing them do nothing but show it off wears thin after awhile. At first, the group&amp;#039;s rhyming skills are admirable, but the approach seems limited after being inundated with nothing but technique for over an hour. When Mad Flava does nothing but boast on song after song, you find yourself wishing they would bring some much needed variety to their lyrics. From the Ground Unda fell through the cracks, and when the 1990s were coming to an end, Flava had yet to come out with a second album.\n\n\nJust something different in my collection of music. Please seed and enjoy!","torrent":{"xt":"urn:btih:2a29d49ca84e910449b516f8e2f6ee9a4d1895ba","amp;dn":"Mad+Flava-+From+The+Ground+Unda-+1994","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a29d49ca84e910449b516f8e2f6ee9a4d1895ba","infoHashBuffer":{"type":"Buffer","data":[42,41,212,156,168,78,145,4,73,181,22,248,226,246,238,154,77,24,149,186]},"announce":[],"urlList":[]}}