{"title":"EN CARNE VIVA_DVD5","uid":4013074,"size":4643985725,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2ac879cea2b7b7549f8a405f86b81ffec3e89db4&amp;dn=EN+CARNE+VIVA_DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SONO65","files":28,"time":1202170194,"description":"TITULO ORIGINAL: In the Cut\n \nAÃƒ?O: 2003  \n \nDURACIÃƒ?N: 120 min.   \n \nPAÃƒ?S: EE.UU.\n  \nDIRECTOR: Jane Campion\n \nGUIÃƒ?N: Jane Campion &amp; Susanna Moore (Novela: Susanna Moore)\n \nMÃƒ?SICA: Hilmar Ãƒ?rn Hilmarsson\n \nFOTOGRAFÃƒ?A: Dion Beebe\n \nREPARTO: Meg Ryan, Mark Ruffalo, Kevin Bacon, Jennifer Jason Leigh, Nick Damici, Sharrieff Pugh, Frank Harts, Nancy La Scala\n \nPRODUCTORA: Screen Gems Inc. / PathÃƒÂ© Productions Ltd.\n \nWEB OFICIAL: http://www.sonypictures.com/movies/inthecut/index.html\n \nGÃƒ?NERO: Thriller. Intriga \n\nSINOPSIS: Frannie Avery, profesora de escritura creativa, vive sola en Nueva York. Inteligente y reservada, ha conseguido mantenerse al margen de los aspectos mÃƒÂ¡s ÃƒÂ¡speros de la ciudad, dedicÃƒÂ¡ndose a investigar sobre el lenguaje de la calle y la novela policÃƒÂ­aca. Pero todo esto cambia una noche, cuando Frannie sorprende sin querer un momento de intimidad entre un hombre y una mujer. La carga erÃƒÂ³tica de la situaciÃƒÂ³n la paraliza de golpe, y aunque no llega a ver el rostro del hombre, no olvidarÃƒÂ¡ el tatuaje de su muÃƒÂ±eca ni el descaro de su mirada descarada. Al poco tiempo, Frannie se entera, por boca de un policÃƒÂ­a que insiste en interrogarla, de un oscuro crimen cometido cerca de su apartamento. El detective Malloy, un hombre seductor y que a Frannie le resulta extraÃƒÂ±amente familiar, cree que ella puede saber algo. Malloy desconcierta a Frannie desde el primer momento, y aunque ella intenta mantener las distancias, lo cierto es que se siente atraÃƒÂ­da por ÃƒÂ©l.  \n\nCRITICA:Tras muchos aÃƒÂ±os haciendo casi siempre comedias, Meg Ryan cambia completamente de registro para dar vida a Frannie Thorstin, una solitaria profesora de Nueva York que descubre el lado oculto de la pasiÃƒÂ³n tras tener un encuentro erÃƒÂ³tico con un detective de la policÃƒÂ­a -Ruffalo- que investiga una serie de asesinatos en su barrio. Dirigida por Jane Campion (&quot;The Piano&quot;), sorprendiÃƒÂ³ en su estreno en USA por los desnudos de la actriz y el alto contenido erÃƒÂ³tico de algunas de sus escenas. (FILMAFFINITY)\n----------------------------------------\n&quot;Sexo sÃƒÂ³rdido en la ciudad mezclado con un total hastÃƒÂ­o dan lugar a un potente cocktail. (...) Incluso aunque &quot;In the Cut&quot; se queda corta en el intento de Campion de hacer una obra magistral, es sin duda el film mÃƒÂ¡s ambicioso e importante de los ÃƒÂºltimos meses.&quot; (Mick LaSalle: San Francisco Chronicle)\n---------------------------------------\n&quot;Meg Ryan hace un trabajo tan efectivo al evocar a esta mujer solitaria hambrienta de sexo, que hubiera sido mejor seguir esa lÃƒÂ­nea y no distraerla (a ella y a la audiencia) con el asunto de la trama criminal.&quot; (Roger Ebert: Chicago Sun-Times)\n----------------------------------------\n&quot;Decepcionante thriller erÃƒÂ³tico&quot; (Lou Lumenick: New York Post)\n----------------------------------------\n&quot;Truculento thriller en el que Meg Ryan desnuda su cuerpo y su talento. (...) un vuelco de imagen arriesgado y comprometido, que la actriz saca adelante con valentÃƒÂ­a, sinceridad y talento. (...) Recupera Campion algunos rasgos del estupendo cine norteamericano de los aÃƒÂ±os sesenta y setenta (...) recupera el buen pulso que sostuvo en &quot;Un ÃƒÂ¡ngel en mi mesa&quot; y &quot;El piano&quot;, un comienzo que parecÃƒÂ­a ya irrecuperable.&quot; (Ãƒ?ngel Fdez. Santos: Diario El PaÃƒÂ­s)\n----------------------------------------\n&quot;Policiaco sensual (...) un thriller intenso, noctÃƒÂ¡mbulo y costumbrista, lleno de sensualidad y misterio.&quot; (Alberto Bermejo: Diario El Mundo)\n\n- Reduction Level for DVD-5: 72,6%\n- Overall Bitrate : 4.256Kbs\n- Space for Video : 3.560.550KB\n- HIGH/LOW/TYPICAL Bitrates: 4.771/3.537/4.256 Kbs\n\nAUDIO: - Castellano Dolby Digital 5.1\n       - Ingles Dolby Digital 5.1\n\nSUBTITULOS: cCastellano, Ingles, Bulgaro, Croata, Hungaro, Polaco, Rumano, Serbio, Esloveno.\n\nIMAGEN: 16/9 AnamÃƒÂ³rfica.\n\nSISTEMA: PAL.\n\n","torrent":{"xt":"urn:btih:2ac879cea2b7b7549f8a405f86b81ffec3e89db4","amp;dn":"EN+CARNE+VIVA_DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac879cea2b7b7549f8a405f86b81ffec3e89db4","infoHashBuffer":{"type":"Buffer","data":[42,200,121,206,162,183,183,84,159,138,64,95,134,184,31,254,195,232,157,180]},"announce":[],"urlList":[]}}