{"title":"Coast to Coast - Robert Morning Sky - Hopi Prophecies &amp; ET","uid":3892935,"size":22108544,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2bba53122af2ef938d7f1a1cc53377b65de50bbe&amp;dn=Coast+to+Coast+-+Robert+Morning+Sky+-+Hopi+Prophecies+%26+ET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"studio11","files":4,"time":1195121464,"description":"Okay... \n\nSo it&amp;#039;s not really a Coast to Coast show but Robert Morning Sky has appeared on Arts show before. Therefore all you C2C fans will LOVE this - hence the C2C tag to get your attention. You wouldn&amp;#039;t know about the upload otherwise so forgive me for the inacurate Torrent title. The seminar was actually sponsored by the Australian Magazine, &quot;NEXUS&quot;,\n\nThis recording is quite special not to mention rare. How do I know this? Well it was personally recorded by my friend and until now, there have only been two copies in existence!\n\nThis secretly recorded seminar/talk Robert gave was in Maroochydore - Queensland Australia in February of 1992 and was infact the first time he had spoken in public about growing up on Hopi Reservation Land with Extra Terrestrials. Namely, the &quot;Blues&quot; &amp; &quot;Grays&quot;. \n\nRobert also touches on Hopi Legend, Crop Circles, The Bildeberg Group, The Trilateral Commision, Tri Star Pictures and weaves an amazing web of connections and conspiracies. Robert actually believed (at that point in time) that it was not safe to diseminate this information in the good old U.S of A. (I wonder why) LOL!\n\nRobert also shines a spotlight on the real reasons for cattle mutilation which is both astounding - and in a dark way, quite commical. Don&amp;#039;t worry, I wont spoil it for you.\n\nRoberts information was, and still is quite chilling and proved how much ahead of the field he really was. This is a must have recording for anyone who takes E.T visitation seriously.\n\nThis ones for my bud Stokeman. Many thanks mate!\n\nPLEASE NOTE: \nI&amp;#039;m on a draconian 56k dial-up so please exercise some patience.\n\nPlease seed and enjoy!","torrent":{"xt":"urn:btih:2bba53122af2ef938d7f1a1cc53377b65de50bbe","amp;dn":"Coast+to+Coast+-+Robert+Morning+Sky+-+Hopi+Prophecies+%26+ET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bba53122af2ef938d7f1a1cc53377b65de50bbe","infoHashBuffer":{"type":"Buffer","data":[43,186,83,18,42,242,239,147,141,127,26,28,197,51,119,182,93,229,11,190]},"announce":[],"urlList":[]}}