{"title":"Desmond_Morris_The_Human_Sexes_2","uid":3363127,"size":4680149376,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2c4632e9355133c17db08ce72acadf2663b72420&amp;dn=Desmond_Morris_The_Human_Sexes_2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"owtluke","files":27,"time":1122738998,"description":"THIS IS A RESEEDED TORRENT.\n\nPart 4:\nDoes society treat men and women differently? You may not like the\nunsettling answers you'll find in &quot;Passages Of Life&quot;. Compare the way\ndifferent cultures deal with boys and girls as they grow up. Some believe\nmale circumcision began as an ancient Egyptian snake worship ritual to\nensure immortality. In the Middle East, puberty brings a girl her first\nveil; in Yemen, a boy his first grown-up dagger. Watch young women turned\ninto ladies at an etiquette school in England, and young men turned into\nkillers by the U.S. Marine Corps. Witness a marriage celebration in a\nsmall Greek village - where a dowry still makes a difference. Passages\nOf Life might make you feel better about growing up... or worse.\n\nPart 5:\nIn today's world, is it rougher to be a mother... or a father? Will it\never be possible to balance work and motherhood? No matter what you\ncurrently believe, &quot;The Material Dilemma&quot; will surprise you with new\ninsight. See working mothers in Japan and England who leave their\nchildren at day-care centers. Discover the &quot;granny solution&quot; in Greece.\nExplore the &quot;paternal solution&quot; with stay-at-home fathers in America.\nHave dinner with a man from Utah who has several wives: some raise\nchildren while others pursue careers. Compare women who work in fields\nwith babies at their side, to Western women trying to balance kids and\na career. It'll soon become clear that The Material Dilemma is something\neverybody shares. \n\nPart 6:\nDo you know what side of the Battle Of The Sexes you're on? You might\nbe stunned by this eye-opening look at the recent struggle for equality\nbetween the sexes. Originally, there was a primitive balance between the\nsexes, but when people left the village for the city, the natural\nbalance disappeared. Find out the origin of honeymoons and other tools\nof male dominance like wedding rings and female circumcision. Travel to\nFinland for the annual wife-carrying contest celebrating the capture of\nwomen from other villages. Follow the rise of feminism, from \nturn-of-the-century suffragettes to the National Organization for Women.\nVisit the front lines of the gender wars with female stock traders and\nfemale firefighters who parachute into blazing California forests. Pay\nattention: what you learn here may just help you survive &quot;The Gender\nWars&quot;.\n","torrent":{"xt":"urn:btih:2c4632e9355133c17db08ce72acadf2663b72420","amp;dn":"Desmond_Morris_The_Human_Sexes_2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c4632e9355133c17db08ce72acadf2663b72420","infoHashBuffer":{"type":"Buffer","data":[44,70,50,233,53,81,51,193,125,176,140,231,42,202,223,38,99,183,36,32]},"announce":[],"urlList":[]}}