{"title":"Linda Cobb - Talking Dirty With The Queen Of Clean (audiobook)","uid":3921324,"size":69716756,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2cd593ce6a0875a993f46600fd069b7d91ce9032&amp;dn=Linda+Cobb+-+Talking+Dirty+With+The+Queen+Of+Clean+%28audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"perpetual_traveller","files":43,"time":1196809773,"description":"Want to clean a coffeepot in a flash? Unclog a sink with a simple homemade solution ? Do away with microwave odors? Banish those dust bunnies?\nLet her royal highness of housekeeping show you how to turn your home into a sparkling palace -- in no time at all!\n\nStep aside, Martha...Here comes the Queen of Clean, and her down-to-earth housekeeping guide for those of us who live in the real world. After all, the Queen has better things to do than be a slave to housework. That&amp;#039;s why she has assembled a marvelous collection of miraculous cleaning tips and surprising shortcuts that get the job done quickly and well. Without a lot of fuss, you can solve hundreds of cleaning challenges in every room of your home:\n\nRemove dust, rust, gum, fingerprints, stains, odors, and mildew\nClean leather and upholstery, carpets, windows, walls, floors, kitchen appliances, grills, and more\nDeal with damage form flooding and fire\nThe queen count her pennies too -- with inexpensive, environmentally friendly cleaning concoctions and ingredients you might never expect, including\n\nTea -- the wood cleaner you can drink!\nThe amazing rust-removing power of the onion\nLemon juice\nVinegar\nPetroleum jelly\nBaking soda\n...and the five cleaning products you should never be without!\nLet the Queen of Clean put an end to drudgery with her hints and solutions that get fabulous results -- fast!\n\nA nice little &amp;#039;cleaning bible&amp;#039; - MP3s @128","torrent":{"xt":"urn:btih:2cd593ce6a0875a993f46600fd069b7d91ce9032","amp;dn":"Linda+Cobb+-+Talking+Dirty+With+The+Queen+Of+Clean+%28audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cd593ce6a0875a993f46600fd069b7d91ce9032","infoHashBuffer":{"type":"Buffer","data":[44,213,147,206,106,8,117,169,147,244,102,0,253,6,155,125,145,206,144,50]},"announce":[],"urlList":[]}}