{"title":"Gulag USA - Concentration Camps in America - DivX","uid":3357318,"size":587980659,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2d1e58dc9908aae4f3b9883242287cfbb98c8810&amp;dn=Gulag+USA+-+Concentration+Camps+in+America+-+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rci","files":3,"time":1121560512,"description":"Concentration camps in America? Feds set to toss millions of innocent Americans into gruesome factories of torture and death?&amp;#8230; Could it be? Sounds preposterous. Yet&amp;#8230;in this video, Texe Marrs marshals overwhelming evidence so convincing it boggles the mind.\n\nWITH YOUR OWN EYES, EXAMINE THE EVIDENCE\n\n-Congressman Jack Brooks, angering Lt. Col. Oliver North and cronies by exposing the existence of top secret FEMA plan, Rex 84, a scheme to roundup American dissidents into camps and suspend the Constitution.\n\n-The forcible incarceration of innocent Japanese-Americans by socialist President Franklin D. Roosevelt in &quot;internment camps&quot;&amp;#8230;and the brutal treatment resisters received.\n\n-The 2,000-plus Communist concentration camps in the U.S.S.R., where millions perished. The testimony of a former Soviet persecutor.\n\n-Railroad cars, complete with chains and shackles, designed to transport victims to camps&amp;#8212;discovered in the U.S.A.\n\n-Sightings of actual concentration camps inside the U.S.A., with guard towers and crematoria, prepared for a signal from the elite to begin their heinous operations.\n\n-The U.S. Air Force manual (Garden Plot, Plan 55-2) outlining the operations of camps to imprison civilians.\n\n-&quot;Operation Cablesplicer&quot;&amp;#8212;the secret plan to identify and target resisters to the New World Order and arrest and incarcerate these men and women when the order is given.\n\n-The torture tools to be used in tomorrow&amp;#8217;s &quot;chambers of horror,&quot; to include high tech laser weapons, thumbscrews, chainsaws, electric shock, branding irons, skull crushers, and guillotines.\n\n-Historical examples of concentration camp horrors in Hitler&amp;#8217;s Nazi Germany, Japan&amp;#8217;s imperial regime, Pol Pot&amp;#8217;s Cambodia and in colonial Africa.\n\n-The Coming Great Day of Purification&amp;#8212;in the United States!\n\n-The satanic rationale for blood to be shed, the sick religious doctrine of the Illuminati, and the New Age plot to &quot;purify and cleanse&quot; mother earth of &quot;negative karmic influences.&quot;\n\n-The hidden U.S. history of concentration camp programs and government-sanctioned mass murder and genocide, including the occultic Phoenix Program in Vietnam, in which tens of thousands of men, women, and teenagers, convicted of no crimes, were abducted, imprisoned, tortured, raped, mutilated, and killed. These horrendous crimes were approved and supervised at the highest levels of the U.S. intelligence and military communities, with the express knowledge of our U.S. Congress and Presidents Nixon and Johnson.\n\n-The inside story of Pastor Jim Jones, his socialist Peoples Temple, and the CIA&amp;#8217;s massacre of over 900 in Guyana. Jones prison camp was, in fact, an experimental, mind control death camp, and the victims did not commit suicide&amp;#8212;they were ruthlessly murdered by a CIA hit team.\n\n-Dozens of former U.S. military installations in over 28 states converted to federal prisons and to &quot;internment camps&quot;&amp;#8212;waiting for innocent citizens who refuse to go along with the fed&amp;#8217;s plot to suspend the constitution&amp;#8217;s Bill of Rights.\n\n-Secret underground bases, subterranean &quot;cities,&quot; and miles-long tunnels and caverns in Texas, Kansas, Virginia, and elsewhere, to house millions of pre-identified citizens scheduled to be imprisoned as threats to national security.\n\n-The United Nations role in the genocidal massacre of almost one million men, women, and children.","torrent":{"xt":"urn:btih:2d1e58dc9908aae4f3b9883242287cfbb98c8810","amp;dn":"Gulag+USA+-+Concentration+Camps+in+America+-+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d1e58dc9908aae4f3b9883242287cfbb98c8810","infoHashBuffer":{"type":"Buffer","data":[45,30,88,220,153,8,170,228,243,185,136,50,66,40,124,251,185,140,136,16]},"announce":[],"urlList":[]}}