{"title":"Baby Woodrose - Dropout (Danish Garage-Psych 2001 @224Vbr)","uid":3368291,"size":51464043,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2dd3d85f52705112b5951abf81ce99ffc962270f&amp;dn=Baby+Woodrose+-+Dropout+%28Danish+Garage-Psych+2001+%40224Vbr%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"test78","files":11,"time":1123742584,"description":"Search for test78 to find my other uploads.\n\n\nI have yet to see a single reviewer mention this, so I`ll do it myself: Baby Woodrose is a psychedelic drug. Hawaiian Baby Woodrose is a climbing vine, eat a few seeds (5-12), and supposedly you`ll experience a trip thats comparable to LSD. Not as powerful or strong or visual, but it will effect/enhance your auditory senses. I wouldnt recommend it as it usually  makes people puke or upset their stomachs in other ways. *cough* Not that I in any way condone or encourage any kind of drug-use of course.\n\n\nWWW.popmatters.com, Stephen Haag:\n\nIt's a common trope in rock criticism -- noting that a band, based on its sound, must feature members with great record collections. Denmark's Baby Woodrose take this notion one step further on their covers collection, Dropout!. Based on the album's song selection it's true the band owns a kickass collection (the Sonics, Love, 13th Floor Elevators, etc.) but they appear on the cover of the album actually poring over their records (and a stack of old Playboy magazines) while lounging on a red shag carpet. \n\nIf the carpet and the album title (Dropout!, as in &quot;Tune in, turn on...&quot;) weren't clues enough for ya, Baby Woodrose has turned in a batch of '60s garage covers, specifically tunes and bands that they cite as inspiration. So, yes, Baby Woodrose has great taste in music, but more than that, with Dropout!, it's a treat to hear a garage band realize that the genre existed before '70s touchstones like Johnny Thunders and the Ramones (as influential as they are) crashed the scene. \n\nGiven the '60s bent, there's plenty of psychedelia in bloom on Dropout!. The swirling keyboard and dark guitar lines on the Painted Faces' &quot;I Lost You in My Mind&quot; point to a keen understanding of psychedelia, as does the band's tribal beat and jammy guitar on the headtrippy &quot;The World Ain't Round, It's Square&quot; (from the Savages). And the heavy, heavy roiling blues of album closer &quot;A Child of a Few Hours&quot; (West Coast Experimental Pop Art Band) captures Black Sabbath-style psychedelia. \n\nS'all good stuff, so it's odd that the band muffs a tune from the so-called first psychedelic band, the 13th Floor Elevators. Their take on &quot;I Don't Ever Wanna Come Down&quot; is too muscular, and lacks Elevators frontman Roky Erickson's otherworldly cerebrality (to coin a new term). The album's other misstep is a version of Captain Beefheart's &quot;Dropout Boogie&quot; that, to these ears, sounds too menacing. I'm not saying that Baby Woodrose should strive to create Xerox copies of the original tunes, but compared to other artists who have covered Beefheart (say, the White Stripes), Baby Woodrose fail to capture the Captain's jauntiness. \n\nWhile there's plenty of psychedelic tunes on Dropout!, some of the album's best songs don't fall under that umbrella. Love's &quot;I Can't Explain&quot; is bouncy glam, the Saint's &quot;This Perfect Day&quot; and the Stooges' &quot;Not Right&quot; are lean, mean street-fighting proto-punk; and the fuzzed-out blues stomp &quot;I'm Going Home&quot; (the Sonics) is great, though it seems more representative of swamp-blues acts like the Black Keys and Mr. Airplane Man. The obvious lesson: Garage's roots nourish many of today's acts. \n\nDropout! is a great exercise in digging through music history -- there's not an obvious song in the batch and, with any luck, you'll be inspired to learn more about the bands covered (I'm ashamed to say my knowledge of Love is woefully lacking, but thanks to Dropout! I'm spurred to remedy that). Yes, Baby Woodrose have a cooler record collection than you, but there's no reason Dropout! shouldn't be in yours. \n\n\n192Vbr\n\n\nTracklist:\n\n1. Can?t Explain (Love)\n2. I Lost You in My Mind (The Painted Faces)\n3. Who?s it Gonna Be (The Lollipop Shoppe)\n4. I Don?t Ever Wanna Come Down (The 13th Floor Elevators)\n5. The World Ain?t Round, It?s Square (The Savages)\n6. Dropout Boogie (Captain Beefheart and His Magic Band)\n7. I?m Going Home (The Sonics)\n8. This Perfect Day (The Saints)\n9. Not Right (The Stooges)\n10. A Child of a Few Hours (The West Coast Pop Art Experimental Band)\n\n\nEnjoy !\n\n","torrent":{"xt":"urn:btih:2dd3d85f52705112b5951abf81ce99ffc962270f","amp;dn":"Baby+Woodrose+-+Dropout+%28Danish+Garage-Psych+2001+%40224Vbr%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dd3d85f52705112b5951abf81ce99ffc962270f","infoHashBuffer":{"type":"Buffer","data":[45,211,216,95,82,112,81,18,181,149,26,191,129,206,153,255,201,98,39,15]},"announce":[],"urlList":[]}}