{"title":"Curse of Monkey Island - Compressed","uid":3879739,"size":390323248,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2de23a841828c2b1dc9dca4311472ef8e1cb723a&amp;dn=Curse+of+Monkey+Island+-+Compressed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"quakehead","files":1,"time":1194609293,"description":"These are the files needed to run the game Curse of Monkey Island with ScummVM.\n\nYou also need some cutscene sound files (~6.6MBbs):\nhttp://thepiratebay.se/torrent/3925152/comi-cutscene-mp3s\n\nFor those of you who don't know what ScummVM is (I was one of them!), It's a free program to run the game using it's data files.\n\nHere's an extract from their website:\n\nScummVM is a program which allows you to run certain classic graphical\npoint-and-click adventure games, provided you already have their data\nfiles. The clever part about this: ScummVM just replaces the\nexecutables shipped with the game, allowing you to play them on\nsystems for which they were never designed!\n\nSome of the adventures ScummVM supports include Adventure Soft's Simon\nthe Sorcerer 1 and 2; Revolution's Beneath A Steel Sky, Broken Sword 1\nand Broken Sword 2; Flight of the Amazon Queen; Wyrmkeep's Inherit the\nEarth; Coktel Vision's Gobliiins; Westwood Studios' The Legend of\nKyrandia and games based on LucasArts' SCUMM (Script Creation Utility\nfor Maniac Mansion) system such as Monkey Island, Day of the Tentacle,\nSam and Max and more. You can find a thorough list with details on\nwhich games are supported and how well on the compatibility\npage. ScummVM is continually improving, so check back often.\n\nAmong the systems on which you can play those games are Windows,\nLinux, Mac OS X, Dreamcast, PocketPC, PalmOS, AmigaOS, BeOS, OS/2,\nPSP, PS2, SymbianOS/EPOC and many more.\n\n\n...so this zip file has all the files required. I also compressed the *.bun and *.san files using scumm-tools; this version is a fraction of the original size.\nhttp://wiki.scummvm.org/index.php/The_Curse_of_Monkey_Island\n\nYou can get scummvm here (~2.5 mb download)\nhttp://www.scummvm.org/downloads.php\n\nTo get scummvm for Ubuntu Linux users:\nsudo apt-get install scummvm\n\nTo run the game using scummvm, run scummvm and click &quot;Add Game...&quot;.\nThen choose the directory &quot;comi&quot; where you extracted this zip file.\n","torrent":{"xt":"urn:btih:2de23a841828c2b1dc9dca4311472ef8e1cb723a","amp;dn":"Curse+of+Monkey+Island+-+Compressed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2de23a841828c2b1dc9dca4311472ef8e1cb723a","infoHashBuffer":{"type":"Buffer","data":[45,226,58,132,24,40,194,177,220,157,202,67,17,71,46,248,225,203,114,58]},"announce":[],"urlList":[]}}