{"title":"?????? - ??? Six Degrees - Singapore","uid":3366010,"size":160131450,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2e3b05c4cf6737c458955b2a4835e387da42b11a&amp;dn=%3F%3F%3F%3F%3F%3F+-+%3F%3F%3F+Six+Degrees+-+Singapore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kitten210","files":2,"time":1123297346,"description":"????????????? - ??? Lonely Planet: Six Degrees - Singapore\n???????152 mb\n???????rmvb\n???????????\n\n?????? - ??? Lonely Planet: Six Degrees - Singapore\n\n?????????????????????????????????????????????????????????????????????????????????DrWei??????????????????????????????????????????ForceVomit???????????jam???????????????????????????????????????????????????Kumar????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????\n\nPresenter Asha Gill hits the ground with fast-talking, Vespa-riding foodie KF Seetoh, the man behind Singapore food bible Makansutra. Seetoh gives Asha an insight into Singapore food as performance art, introducing her to the Elvis-quiffed chef and the dancing noodlemaker. Seetoh hooks Asha up with local Malay-surf-punks Force Vomit, who take her on their ? Liberate Singapore? campaign to promote their band at the Great Singapore Sale, Speaker? s Corner and local rave Zouk-Out. \n\nForce Vomit introduce Asha to gender-bending sari-clad, cabaret icon Kumar, who shows her how even a non-mainstream personality like himself can be accepted into the Singapore mainstream as well as his ethnic haunts in Little India. Actress Pam Oei shows Asha there is life beyond the revue in Singapore by introducing her to famed ? street wayang? Chinese opera performer Madam On in the housing estates of Punggol. The operatic legend invites Asha to a traditional wayang performance staged for the spirits during the Chinese Hungry Ghost Festival. \n\nAsha meets Seetoh? s friend Dr. Wei, to get the lowdown on good lovin? Singapore-style. The sex therapist and health entrepreneur shows Asha the romantic and not-so-romantic sides of the island, from a singles love cruise on the high seas to the Geyland redlight district and a Singapore sperm bank. A date made on the love boat leads Asha to Calvin and Jack Sim of the Singapore Restroom Association. They cajole her into joining their Happy Toilet rating campaign designed to improve the quality of public lavatories in the cleanest of clean cities. Asha joins the good citizens of Singapore doing it for themselves and ends up in an al fresco restroom at the city zoo with more wildlife than she bargained for. \n","torrent":{"xt":"urn:btih:2e3b05c4cf6737c458955b2a4835e387da42b11a","amp;dn":"%3F%3F%3F%3F%3F%3F+-+%3F%3F%3F+Six+Degrees+-+Singapore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e3b05c4cf6737c458955b2a4835e387da42b11a","infoHashBuffer":{"type":"Buffer","data":[46,59,5,196,207,103,55,196,88,149,91,42,72,53,227,135,218,66,177,26]},"announce":[],"urlList":[]}}