{"title":"[Kung Fu] Outlaws Of The Marsh aka The Water Margins - Episodes","uid":3776147,"size":5298897023,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2e990e091ab7759678425ca64bc55d54a577ef35&amp;dn=%5BKung+Fu%5D+Outlaws+Of+The+Marsh+aka+The+Water+Margins+-+Episodes+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"JamesKees","files":46,"time":1187369814,"description":"Outlaws Of The Marsh aka The Water Margin, Episodes 01-40 (1980)\n\nDescription:\n\nMost popular television serials: Outlaws of the Marsh\n43 television serials, directed by Zhang Shaolin\nStarred by Li Xuejian, Ye Mang, Zang Jinsheng, Ding Haifeng\nProduced by CCTV\nProduct Info: 43 episodes in 15 DVDs, Mandarin conversation, subtitle in Chinese\nbr&gt;DVD Format: DVD-9, NTSC, Region All (Regional codes are entirely optional for the maker of a disc. Region-free, code-free, multi-region, region all, these mean the same thing: Discs without region locks will play on any player in any country!)\n\nThe 43-part TV serial, Outlaws of the Marsh, adapted from the Chinese classic with the same name aired on CCTV&amp;#039;s prime channel during prime time in late 1997. This well-known literary work overnight became the hot topic of people&amp;#039;s conversation all over the country. Both praise and criticism made the headlines in all kinds of media.\n\nOutlaws on the Marsh is set between the years 1101 and 1125 when Emperor Song Hui Zong is in power of the Song Dynasty. He is muddleheaded and the government is actually controlled by some corrupted and flattering officials. The classic tells why and how 108 men and women banded together on a mountain surrounded by marshes in what today is Shandong Province. The classic has been noted for its vivid portrayal of a large cast of humble characters who had fallen from the upper class during internal struggles. A tragic debacle forced them to join hands and rebel against local despots and troops of a corrupt imperial government. It places Song Jiang and his bandits in the Taihang Mountains. He and his followers rub the rich and help the poor and soon a lot of poor peasants turn to him. They foil many government suppressions and encirclements and win good reputation among the peasants and terrify the government soldiers. After a few years of hard fights, there gather 108 heroes around Song Jiang. Each of them has his unique characters. Some are wise and brave while others are loyal, tough and righteous. They uphold justice and cherish filial piety. They are a host of heroes that represent the ideal and dream of creating a happy and peaceful world by taking the risk of their lives.\n\nThe TV serial was filmed in 23 cities in 13 provinces in China, staged with Song Dynasty&amp;#039;s architecture. The most well-known stories and characters were pictured, including &quot;Yang Zhi selling his sword&quot;, &quot;Stealing the birthday present&quot;, &quot;Song Jiang kills his slave girl&quot;, &quot;Fighting Fang La&quot; etc.\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:2e990e091ab7759678425ca64bc55d54a577ef35","amp;dn":"%5BKung+Fu%5D+Outlaws+Of+The+Marsh+aka+The+Water+Margins+-+Episodes+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e990e091ab7759678425ca64bc55d54a577ef35","infoHashBuffer":{"type":"Buffer","data":[46,153,14,9,26,183,117,150,120,66,92,166,75,197,93,84,165,119,239,53]},"announce":[],"urlList":[]}}