{"title":"Werewolf (1987) (TV) (FOX) 1x02 - 1x05 DVD - A Time-Capsule Rele","uid":3893264,"size":973576136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2efac3122100abae873335fbac29dbc387a254ef&amp;dn=Werewolf+%281987%29+%28TV%29+%28FOX%29+1x02+-+1x05+DVD+-+A+Time-Capsule+Rele&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"preservedforposterity","files":3,"time":1195141032,"description":"Werewolf (1987) (TV) (FOX) 1x02 - 1x05 DVD - A Time-Capsule Release\nHere are the next four episodes. My bandwidth is limited, so don&amp;#039;t give up on\nthese - you will eventually get them, and please help me seed. Once there are\nplenty of seeders, I will upload the next four episodes. These torrents should all\ndownload to the same folder on your computer. That way, all episodes will be in one\nplace and easy for you to find.\n\nEpisodes 1x02 - 1x05\n--------------------\n1X02 - &quot;Nightwatch&quot;\n1x03 - &quot;The Boy Who Cried Werewolf&quot;\n1x04 - &quot;The Black Ship&quot;\n1x05 - &quot;Spectre of the Wolf&quot;\n\nA Time-Capsule Mini-DVD Release\nNovember 15, 2007\n\nPreviously, I had intended to make this series available as KVCD&amp;#039;s,\nhowever, not all DVD players can play VCD and not all that play VCD\ncan play KVCD, so, instead, the releases will now be DVD. Most of the\n.ISO&amp;#039;s are less than 1.46Gb, and can therefore be burned to those mini\ndvd-r&amp;#039;s such as Ritek Ridata 4X 8CM/1.46GB Mini DVD-R Media, or\nVerbatim (95238) White Inkjet Hub Printable 4X 1.4GB/8cm Mini DVD-R\nMedia or similar (these are typically used in DVD CamCorders). They can\nalso be burned to any standard DVD recordable disc (4.7Gb), but it\nseems a waste of the disc capacity (even so, that&amp;#039;s what I used). Any\nCD/DVD burning application should be able to burn these ISO images to\ndisc (Nero, Roxio, PlexTools, etc.). You could also just load the ISO\nimages into Nero Image Drive (comes with Nero and is awesome) and watch\nthem on your computer or copy the files off to reburn in an application\nof your choice. The Free 7-Zip (7-zip.org) or WinImage can be used to\nextract the files from the ISO images if you wish. The simplest way to\nenjoy them is to just burn the .ISO files to a blank DVD and watch them\non your television set. They are NTSC, but these days, most DVD players\nhandle NTSC and PAL with ease, so it shouldn&amp;#039;t be an issue.\n\n\nENJOY!\n\nDO NOT READ THE FOLLOWING UNLESS YOU WANT TO SPOIL THE EPISODES (IN THE\nEVENT THAT YOU HAVEN&amp;#039;T SEEN THEM). THE FOLLOWING SHOULD ONLY BE READ\nAFTER HAVING VIEWED ALL OF THE EPISODES. IT WAS BORROWED FROM: &lt;a href=&quot;\nhttp://www.tv.com/werewolf/show/5885/episode.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tv.com/werewolf/show/5885/episode.html&lt;/a&gt;\n\n \n1X02 - &quot;Nightwatch&quot;\nFirst aired: 7/18/1987\nProduction Code: 6832\n\nEric catches up with Skorzeny at the docks. He finds a gun and has\nsilver bullets made, then lies in wait in Skorzeny&amp;#039;s boat. Meanwhile,\nRogan isn&amp;#039;t far behind.\n\nWriter:\nFrank Lupo\nDirector:\nDavid Hemmings\nGuest star:\nChuck Connors (Janos Skorzeny),\nHenry Beckman (Doc),\nFranko Toth (Deputy),\nJohn Garwood (Sheriff) \n\n\n1x03 - &quot;The Boy Who Cried Werewolf&quot;\nFirst aired: 7/25/1987\nProduction Code: 6805\n\nA young boy, fascinated with monsters and whose mother is having\nproblems with her boyfriend. nurses Eric back to health after he is\nshot by Alamo Joe.\n\nWriter:\nMark Jones\nDirector:\nLarry Shaw\nGuest star:\nCyril O&amp;#039;Reilly (Bobby),\nAnne Wyndham (Leah Harris),\nDanny Cooksey (Davey Harris),\nLen Wayland (Dr. Miller),\nMatt Roe (Policeman)\n\n\n1x04 - &quot;The Black Ship&quot;\nFirst aired: 8/1/1987\nProduction Code: 6809\n\nEric Cord looks for Janos Skorzeny at a shipping wharf. In a bar he\nmeets Otto Renfield who claims to be an old friend of Skorzeny who used\nto sail with him. He offers to show Eric some of Skorzeny&amp;#039;s things.\nRenfield takes Eric to his ship, an old rusty freighter in a ship\nwrecking yard. Otto tells Eric an old story about how he and Skorzeny\nonce tried to mug a man while out on shore leave. Unfortunately for the\ntwo of them, the man had a knife. Otto tells how he was stabbed and\nthen abandoned by Skorzeny. He reveals that he eventually lost his leg\nto gangrene from his injuries. Otto offers to give Skorzeny&amp;#039;s address\nto Eric. He leads him into the brig where he keeps an old see chest. As\nEric goes to open the chest, Otto locks the door trapping him in the\ncell. As Otto taunts Eric, he begins to transform into a Werewolf. Even\nas a Werewolf, however, Eric cannot get out of the cage. The next day\nEric remains locked in the cell. Otto returns and gives him a change of\nclothes. He tells Eric that Skorzeny is coming and leaves after Eric\ntries to ask him why he is helping Skorzeny. Later when Otto returns he\nis surprised to find Eric missing. He figures out that Eric crawled\ninto a vent and tells him that there is no way out since the vent ends\nafter only eight feet. Eric comes out and sees Otto holding a gun on\nhim. Otto tells him the gun has silver bullets. Eric backs off. Later\nOtto asks him why Eric why he is hunting Skorzeny. Eric tells him that\nhe wants to kill him. Eric asks Otto more about Skorzeny. Otto tells\nhim that while they were shipmates they&amp;#039;d always head to the roughest\nports so that no one would bother them when Skorzeny wanted to kill\nsomebody. Eric learns that Skorzeny is much older than he thought.\nOtto tells Eric that he reminds him of one of his older shipmates who\nwas killed by Skorzeny. Skorzeny made him clean up the mess and get rid\nof the body. Otto reveals to Eric that he hung around with Skorzeny\nbecause he wanted to be a Werewolf too. He wanted immortality and\npower. He tells him that he begged Skorzeny to make him a werewolf.\nSkorzeny just laughed at him. Eric figures out that Otto really wants\nto kill Skorzeny. That is why he has a gun with silver bullets. Otto\nleaves and heads to his room when Janos arrives. Janos wants Cord. Otto\ntells him that Eric escaped, Skorzeny doesn&amp;#039;t believe him. Skorzeny\ntransforms and attacks him. In the brig Cord can here the screams. He\nsees the brig&amp;#039;s keys on a table. Unfortunately they are just out of\nreach. Skorzeny heads for the while Eric finds a coat hanger. He\nstretches it to get the keys. He escapes before Skorzeny reaches the\nbrig to kill him. Later Eric searches the ship with a crowbar. He finds\nOtto wounded and bleeding. Otto asks to die. Eric takes the gun with\nsilver bullets and shoots him.\n\nWriter:\nAlan Cole, Chris Bunch\nDirector:\nJames Darren\nGuest star:\nStefan Gierasch (Otto Renfield),\nClaude Earl Jones (Mr. Klisura),\nLillian Garrett (Rita)\n\n\n1x05 - &quot;Spectre of the Wolf&quot;\nFirst aired: 8/8/1987\nProduction Code: 6807\n\nA college professor, who is an expert on werewolves and has written\nseveral books on the subject, thinks that Eric is a bit crazy when Eric\ncomes to him for help.\n\nWriter:\nCraig Tepper\nDirector:\nLyndon Chubbuck\nGuest star:\nPaul Comi (Dr. Victor DeGoethels)\n\n\n ","torrent":{"xt":"urn:btih:2efac3122100abae873335fbac29dbc387a254ef","amp;dn":"Werewolf+%281987%29+%28TV%29+%28FOX%29+1x02+-+1x05+DVD+-+A+Time-Capsule+Rele","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2efac3122100abae873335fbac29dbc387a254ef","infoHashBuffer":{"type":"Buffer","data":[46,250,195,18,33,0,171,174,135,51,53,251,172,41,219,195,135,162,84,239]},"announce":[],"urlList":[]}}