{"title":"Conan the Barbarian FullDVD","uid":3369929,"size":4685664562,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2f58ac554b7d78665d868df459d0416ae7197ee4&amp;dn=Conan+the+Barbarian+FullDVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kalin1102","files":6,"time":1124063121,"description":"Conan, el b&amp;aacute;rbaro: Edici&amp;oacute;n especial\n\nConan the Barbarian\n\nDirector :: John Milius\n\nInterpretes :: Arnold Schwarzenegger, James Earl Jones, Max von Sydow, Sandahl Bergman, Ben Davidson, Gerry Lopez, Mako, Val&amp;eacute;rie Quennessen\n\n\nFull DVD, se han quitado Avisos, Como se hizo con DVDRemake se ha comprimido con Rebuilder y Qmatop con HC Alta Calidad 2 pasadas.\nSe comparte con imagen realizada con Alcohol 120%\n\nVideo:\nPal 16:9, 2.35:1\n\nSonido: Dolby Digital 5.1\nIdioma: Castellano, Ingl&amp;eacute;s\n\nSubt&amp;iacute;tulos: Castellano, Ingl&amp;eacute;s\n\nG&amp;eacute;nero\nAcci&amp;oacute;n, Aventuras\n\nDuraci&amp;oacute;n\n2 horas 9 minutos\n\nDistribuidora\nTwentieth Century Fox Home Entertainment\n\nClasificaci&amp;oacute;n\nNo recomendada a menores de 13 a&amp;ntilde;os\n\nPais y a&amp;ntilde;o\nEE.UU / 1982\nLanzamiento\n12-02-2002\n\n\n  \tSinopsis:  \n\nHAY SPOILERS. En la Era Hyborea, un joven cimmerio, Conan, contempla como su aldea es arrasada y su familia asesinada por unos hombres que portan un estandarte de una serpiente con dos cabezas. Es hecho prisionero y condenado a la esclavitud. Tras pasar encadenado a una rueda donde realiza trabajos forzados, al llegar a la edad adulta, sus amos lo convierten en gladiador, en una arena donde libra crueles combates y sale victorioso ante todos sus contrincantes. Es llevado a Oriente, donde se instruye en esgrima y artes de la guerra, aprende a leer y escribir y otros estudios. Su amo lo libera y Conan vaga libra, hasta que huyendo de unos lobos cae en una cripta, donde halla una magn&amp;iacute;fica espada. M&amp;aacute;s adelante en su viaje, encuentra a una bruja que a cambio de favores carnales, le dice que vaya a la ciudad de Zamora, donde existe un culto a la serpiente. Libera a Subotai, un ladr&amp;oacute;n, y con &amp;eacute;l se encamina a Zamora. All&amp;iacute;, disponi&amp;eacute;ndose a asaltar la torre de la serpiente Set, se topan con otra ladrona, Valeria, y deciden asaltar la torre y robar la joya conocida como &quot;el ojo de la serpiente&quot; los tres juntos. En el interior de la torre, Conan mata a una descomunal serpiente que custodia la joya, y antes de escapar descubre un emblema como el de los que acabaron con su familia. Tras el robo, los tres compa&amp;ntilde;eros se dedican a disfrutar y dilapidar su fortuna, inici&amp;aacute;ndose una relaci&amp;oacute;n entre Conan y Valeria, hasta que los hombres del Rey Osric, los capturan y los llevan a su presencia. El Rey les propone que rescaten a su hija, que ha sido reclutada por el culto de la serpiente. Mientras Valeria y Subotai se muestran reticentes, Conan marcha en solitario y encuentra el templo. Se hace pasar por monje, pero es descubierto y torturado por el sacerdote Thulsa Doom y sus secuaces, los mismos hombres que exterminaron a su pueblo. Finalmente es crucificado, y moribundo, recogido por Subotai y Valeria, que hab&amp;iacute;an decidido un&amp;iacute;rsele. Conan libra una batalla contra los esp&amp;iacute;ritus de la muerte. Valeria promete a los dioses entregar su vida si Conan se salva. Con el cimmerio restablecido, Subotai y Valeria, rescatan a la hija del Rey, pero Valeria es herida y fallece en brazos de Conan, aunque vuelve fugazmente de la muerte para salvarle la vida. Conan volver&amp;aacute; al templo, y al final obtendr&amp;aacute; su venganza decapitando a Thulsa Doom.","torrent":{"xt":"urn:btih:2f58ac554b7d78665d868df459d0416ae7197ee4","amp;dn":"Conan+the+Barbarian+FullDVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f58ac554b7d78665d868df459d0416ae7197ee4","infoHashBuffer":{"type":"Buffer","data":[47,88,172,85,75,125,120,102,93,134,141,244,89,208,65,106,231,25,126,228]},"announce":[],"urlList":[]}}