{"title":"The Beach Boys - Mike Love Not War","uid":4012835,"size":93343252,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2f9258e1985f7d85da2c3f1b30f63b7c6932bed5&amp;dn=The+Beach+Boys+-+Mike+Love+Not+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"st2580smile","files":1,"time":1202192611,"description":"Review by Richie Unterberger\n \nThe first half of this CD is taken from a live Michigan concert from October 1966, the same one that yielded the version of &quot;Good Vibrations&quot; that appears on the official Good Vibrations box. The sound quality isn&amp;#039;t quite as good on these 11 songs (&quot;Good Vibrations&quot; itself is not included), but it&amp;#039;s still very good for an unauthorized live-&amp;#039;60s tape. But there are a couple of major problems. Brian Wilson is absent, as he almost always was from the stage from 1965 onwards. Just as important, The Beach Boys, more than almost any other top-level rock group of the time, were inferior stage performers. The singing and playing is thin, awkward, tentative, and lacking in drive and energy. They play many of their best songs from the mid-&amp;#039;60s (including a few from Pet Sounds), but set against the magnificence of the studio recordings, they&amp;#039;re downright anemic. Following this are nine songs from a November 1964 Swedish performance (with Brian in tow) that are gutsier, but still a pale reflection of the studio creations. There are a couple of songs (&quot;Surfer Girl&quot; and &quot;Louie, Louie&quot;) that don&amp;#039;t show up on the official Concert album, also recorded in 1964, but basically it&amp;#039;s barely different from that set at all (in both sound and song selection). A cool, raucous &quot;What&amp;#039;d I Say&quot; from an early 1964 show in Sydney (also released officially on an import) closes out a release that&amp;#039;s for collectors only, despite the relatively high audio quality. \n \n","torrent":{"xt":"urn:btih:2f9258e1985f7d85da2c3f1b30f63b7c6932bed5","amp;dn":"The+Beach+Boys+-+Mike+Love+Not+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f9258e1985f7d85da2c3f1b30f63b7c6932bed5","infoHashBuffer":{"type":"Buffer","data":[47,146,88,225,152,95,125,133,218,44,63,27,48,246,59,124,105,50,190,213]},"announce":[],"urlList":[]}}