{"title":"Choronzon - Era Vulgaris","uid":4008936,"size":58224199,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ff5c957aa66db4f0a049d30a53539ea03f03982&amp;dn=Choronzon+-+Era+Vulgaris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gamalost418","files":10,"time":1201975708,"description":"Artist: Choronzon \nProducer: The Foamin&amp;#039; Bros. \nWriter: P. Emerson Williams \nP. Emerson Williams has to do everything the hard way. A more career minded artist would have seized on the opportunity afforded being signed to Nocturnal Art Productions and its association with Samoth of the mighty Emperor, touring and considering the comfort of the audience. I stead Mr. Williams played with his own sanity, crossing the Abyss and disappeared for several years. \nDuring this time he recorded two Choronzon albums, both of which were rejected by NAP, Samoth not seeing any audience sick enough to be able to take their deliberately grating harshness. The first, a Paean to Lilith, queen of the succubae and lover and protector of P. Emerson Williams, disappeared mysteriously. The tracks which were mixed to DAT, were unaccountably replaced with white noise, underneath which could be discerned gibbering and laughter. The second, &quot;Era Vulgaris&quot;, a thrashing testament to torture, sprang fully formed over the span of a week out of Mr. Williams&amp;#039; unconscious. The sound goes back to the harsh, electronic blackness of the original Choronzon demo; a sound with no consideration towards commercial potential.\nFollowing being dropped from NAP, P. Emerson lived on the streets among homeless criminals and drug addicts, gaining much insight on the futility of the lives of the average. Privately going deeper into his occult studies, as well as disassembling and reassembling his psyche through meditation, ritual and various forms of psycho therapy, he began to produce new work. \n\nIf you&amp;#039;re looking for a raw and industrialized brand of black/thrash metal, look no further. Choronzon has been making music like this for many years now, and it&amp;#039;s a shame that it hasn&amp;#039;t attracted greater attention. With a combination of white noise guitars and well programmed drums, the charge is led into a volatile and aesthetically noise laced experience. However, the album contains more of its share of unique and atmospheric passages and will only leave you more curious and excited about where the music will take you next. The sound itself is a vague combination of other extreme bands such as Limbonic Art, Anaal Naathrak and Abruptum, and if you can imagine that, then you&amp;#039;re half way there to discovering the music withheld on Era Vulgaris. This may keep the purists at bay, but those with an open mind and taste for music with its own set of rules should definitely check this out. Also highly recommended is the successor to this record titled &quot;Psychosis Ex-Machina&quot;.\n\n\n01 Era Vulgaris.mp3 \n02 Ritual Michelle Remembers.mp3 \n03 Invocation.mp3 \n04 Fortapt og Glad.mp3 \n05 Wickedness.mp3 \n06 Study In Decay.mp3 \n07 Puppet.mp3 \n08 Word Is Born.mp3 \n09 In The Halls.mp3 \n10 Torn.mp3 \n\n","torrent":{"xt":"urn:btih:2ff5c957aa66db4f0a049d30a53539ea03f03982","amp;dn":"Choronzon+-+Era+Vulgaris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff5c957aa66db4f0a049d30a53539ea03f03982","infoHashBuffer":{"type":"Buffer","data":[47,245,201,87,170,102,219,79,10,4,157,48,165,53,57,234,3,240,57,130]},"announce":[],"urlList":[]}}