{"title":"Jericho.1x05.HDTV.Xvid.Mp3.[Bajand].avi","uid":3754842,"size":362121216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:304fff6dd5d8e344fa5be3877fbec46b282e61d2&amp;dn=Jericho.1x05.HDTV.Xvid.Mp3.%5BBajand%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HISPA_NO","files":1,"time":1185561683,"description":"Cuando el desarollo de la serie no estÃƒÂ¡ a la altura poco importa el episodio piloto o la premisa prometedora. Convertida en un show normal y corriente, Jericho perdiÃƒÂ³ su punto distintivo a las primeras de cambio. Para los que no la conozcan, Jericho trata de cÃƒÂ³mo sobrevivÃƒÂ­a un pueblo a un desastre nuclear (accidente, ataque terrorista, bomba...) a escala nacional. Si hubieran conseguido mantener la trama conspiranoica con mÃƒÂ¡s acierto o potenciar aÃƒÂºn mÃƒÂ¡s (y no al estilo Merlose Place) el drama de la superviviencia y el aislamiento del exterior, hubiera tomado otro rumbo la serie. Como en lo peores episodios de Lost (casi todos), 40 minutos mareando la perdiz con que hay que racionar las patatas fritas, quÃƒÂ© mal lo hace el alcalde o te tienes que liar conmigo en lugar de ella. Luego, 5 minutos de giro argumental para desvelar que tal personaje del pueblo tiene un papel mÃƒÂ¡s importante de lo que parece o descubrir que detrÃƒÂ¡s de los ataques pueden estar los... (ups free spoilers) y eso es todo. En cuanto a la realizaciÃƒÂ³n no destacarÃƒÂ© nada. Me gustÃƒÂ³ cÃƒÂ³mo se planteÃƒÂ³ el desastre nuclear en el episodio piloto. Ya fuera por falta de presupuesto o porque era la intenciÃƒÂ³n, se redujo a una escena mÃƒÂ¡s intrigante que espectacular (escena al final del comentario como premio por leerlo). Jericho es poco mÃƒÂ¡s que una serie de tantas con una subtrama sobre un desastre nuclear que no avanza ni a golpes de guiÃƒÂ³n sacados de la manga. Si hubiera sido al revÃƒÂ©s... Aviso que no es que las elevadas expectativas que tenÃƒÂ­a en cuanto a la serie hayan bajado mi objetividad. Simplemente Jericho es una mÃƒÂ¡s entre tantas (sin ser especialmente mala ni especialmente buena) pero con un mayor potencial desaprovechado.","torrent":{"xt":"urn:btih:304fff6dd5d8e344fa5be3877fbec46b282e61d2","amp;dn":"Jericho.1x05.HDTV.Xvid.Mp3.%5BBajand%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"304fff6dd5d8e344fa5be3877fbec46b282e61d2","infoHashBuffer":{"type":"Buffer","data":[48,79,255,109,213,216,227,68,250,91,227,135,127,190,196,107,40,46,97,210]},"announce":[],"urlList":[]}}