{"title":"Pilot Guides - Nepal [RQ]","uid":3757022,"size":1086865346,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:31662e33cf1d79e32e50623df294ea37008ec422&amp;dn=Pilot+Guides+-+Nepal+%5BRQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rundaqvisten","files":1,"time":1185736261,"description":"Traveller Ian Wright starts his journey in the bustling and expanding modern day capital of Nepal, Kathmandu. He visits the most sacred Hindu temple in Nepal, Pashupatinath Temple and the home of the young princess goddess.\n\nWhilst in Kathmandu Ian takes the opportunity to sample some Nepalese food, and has a night out Kathmandu style. He then hitches south to the Royal Badia National Park where he goes looking for Bengal tigers with a local guide, astride an Indian Elephant. Unfortunately the rare and reclusive tiger is not spotted that day by anybody. Ian spends the evening in a small village nearby where he is introduced to some of the local families and witnesses a local celebration.\n      \nFrom the Terai region Ian flies to the Lukla, in the eastern Himalayas. Here he plans to make his way to the popular bazaar at Namche, before trekking along a section of the Everest highway. At Pangboche monastery Ian also catches a glimpse of what is alleged to be a Yeti skull. Avoiding the Yaks on the pathways, Ian continues his trek to Tengpoche Monastery where he witnesses a traditional Buddhist celebration. \n\nIan joins up with a sherpa guide who has been up Everest twice, and can offer Ian some insight into the nature of trekking in the heights of the Himalayas. Together they make a simple offering to the gods that are said to protect trekkers and climbers.\n\nOn the last leg of his journey Ian flies to Humla. This town is well off the trekkers track, and his four hour horse ride takes him even further into an area of Nepal seldom visited by tourists. Ian&amp;#039;s last night is spent at a local wedding celebration. To Ian&amp;#039;s surprise the wedding involves five grooms and one bride. Ian enjoys the ensuing party, which involves a fair bit of barley wine.\n","torrent":{"xt":"urn:btih:31662e33cf1d79e32e50623df294ea37008ec422","amp;dn":"Pilot+Guides+-+Nepal+%5BRQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31662e33cf1d79e32e50623df294ea37008ec422","infoHashBuffer":{"type":"Buffer","data":[49,102,46,51,207,29,121,227,46,80,98,61,242,148,234,55,0,142,196,34]},"announce":[],"urlList":[]}}