{"title":"Jimi Hendrix - Live At Monterey (2007) Uncompressed DVD-9 (ISO)","uid":3929809,"size":7263674120,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:338c2c6cd8200198859c1d29cbfccf97222f8111&amp;dn=Jimi+Hendrix+-+Live+At+Monterey+%282007%29+Uncompressed+DVD-9+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SergioPlayboy","files":16,"time":1197388446,"description":"Jimi Hendrix - Live At Monterey (2007) Uncompressed DVD-9 (ISO)\n-----------------------------------------------------------------------------------\nThe Jimi Hendrix Experience&amp;#039;s breakthrough appearance at the Monterey International Pop Festival on June 18, 1967, has been committed to disc, in whole or in part, before, starting with the split LP Monterey International Pop Festival, which featured four tracks by Hendrix on one side and performances by Otis Redding on the other. That album was released scant weeks before Hendrix&amp;#039;s death in September 1970. In 1986, Jimi Plays Monterey, containing the full ten-song set, appeared. Both those albums were released on Hendrix&amp;#039;s original U.S. label, the Reprise imprint of Warner Bros. Records. Experience Hendrix, the company formed to reissue the guitarist&amp;#039;s work after his recordings were acquired by his family, has put out its own versions of many of his discs, and Live at Monterey is its take on the Monterey show. The tapes have been remixed by Eddie Kramer, but the album conforms at least to the CD version of Jimi Plays Monterey. (The LP version edited much of the dialogue.) The context of the show is notable. Although Hendrix had become a star in the U.K., he was largely unknown in his home country. He had, however, already been signed to Reprise, which had issued his debut American single, &quot;Hey Joe,&quot; on May 1, 1967. That&amp;#039;s why he says, &quot;It&amp;#039;s &amp;#039;Hey Joe&amp;#039; that really brought us here&quot; in introducing the song. A Top 40 hit for the Leaves in 1966, it had not, however, become a hit for Hendrix as it had in the U.K. Of course, his version was a distinct reinterpretation. He also played his next American single, &quot;Purple Haze,&quot; due for release the next day. It would become his first 45 to chart in the U.S. And he oriented his set somewhat for American ears, including such familiar songs as &quot;Like a Rolling Stone&quot; and &quot;Wild Thing,&quot; as well as the blues standards &quot;Killing Floor&quot; (by Howlin&amp;#039; Wolf) and &quot;Rock Me Baby&quot; (by B.B. King). His most recent U.K. hit, &quot;The Wind Cries Mary,&quot; was included, as was &quot;Foxey Lady,&quot; which would follow &quot;Purple Haze&quot; into the U.S. charts. So, the set was well chosen to introduce him to an American audience, even if that audience reacted in understandable amazement encountering a style of guitar playing hitherto unimagined and a flamboyant performance that culminated in a guitar doused in lighter fluid and going up in flames. Those aspects of the show are better appreciated on this DVD released in conjunction with the audio version, but even without the visuals, after 40 years Hendrix&amp;#039;s playing still has the power to astonish.\n-----------------------------------------------------------------------------------\nFull artwork included. Enjoy!","torrent":{"xt":"urn:btih:338c2c6cd8200198859c1d29cbfccf97222f8111","amp;dn":"Jimi+Hendrix+-+Live+At+Monterey+%282007%29+Uncompressed+DVD-9+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338c2c6cd8200198859c1d29cbfccf97222f8111","infoHashBuffer":{"type":"Buffer","data":[51,140,44,108,216,32,1,152,133,156,29,41,203,252,207,151,34,47,129,17]},"announce":[],"urlList":[]}}