{"title":"PSP The Irony of the Fate 2 Rus","uid":3970360,"size":460132268,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:33d7991c5294e97306c7e979196f37c0db1ef09d&amp;dn=PSP+The+Irony+of+the+Fate+2+Rus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AzazelCA","files":2,"time":1199970583,"description":"Warning: this film in Russian language only! No subtitles. Poor quality (at all).\n\n!RUS - informaciya na russkom: http://torrents.ru/forum/viewtopic.php?p=6353634\n\nOpinion: If there is one lesson that could be drawn from this movie, it is this: do not touch old Soviet classics! Does anyone really think it is possible to produce a sequel to a movie thirty years after it came out on the screens? Since the old &quot;Irony of Fate&quot; was made, it has become one of the most venerated Soviet cultural icons. And icons are better be left alone. I&amp;#039;m not sure if any director would be able to make a successful &quot;Irony of Fate-2&quot;, but what we are offered by Bekmambetov is at best a third-rate production. Bekmambetov may be a decent thriller-movie director (see his Daywatch and Nightwatch) but he is extremely weak as a maker of romantic comedies, which is what &quot;Irony-2&quot; was purported to be. The plot details are not developed at all (thus, we do not learn anything about Kostya&amp;#039;s or Nadya&amp;#039;s occupations or previous lives); the advertising of Toyota Camry is too obvious not to be noticed; and the acting, with the possible exception of Bezrukov (Irakliy) is one-dimensional and unconvincing. The old actors (Myagkov, Brylska) look tired, lost and emotionless, as if trying to understand what it is really they are doing in this movie. Special effects (such as the one with the Aurora) may be fitting in a fantasy thriller but they look out of place in a romantic comedy. In short, this is another proof that there is little worth seeing in post-Soviet cinema.\n\nQuality: TeleSync\nFormat: PMP\nVideo codec: H.264\nAudio codec: AAC\nVideo stream: (Xvid4PSP 1P 512k Turbo) 23.97fps Widescreen Res: 480x256\nAudio stream: (LC ABR 64k) 48kHz Stereo","torrent":{"xt":"urn:btih:33d7991c5294e97306c7e979196f37c0db1ef09d","amp;dn":"PSP+The+Irony+of+the+Fate+2+Rus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33d7991c5294e97306c7e979196f37c0db1ef09d","infoHashBuffer":{"type":"Buffer","data":[51,215,153,28,82,148,233,115,6,199,233,121,25,111,55,192,219,30,240,157]},"announce":[],"urlList":[]}}