{"title":"Project Valkyrie","uid":4002802,"size":98518434,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:352ddd3943d6b9050101a0662421c1328bd1851f&amp;dn=Project+Valkyrie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"timbro","files":1,"time":1201654378,"description":"Project Valkyrie\n\nThree Month Mod started as a team-building exercise wherein we quickly ground out a deliverable within a three month time frame. From there we would move along to more complex and original projects. Somewhere along the way though, we became very attached to our little mod, and diverted all of our efforts from our large-scale, big concept project to complete Three Month Mod not only with quantity, but also quality.\n\nOur team started small, ballooned towards the middle of development, and now, as we approach release, we have sloughed off the excess to hone our team down to a dedicated group of talented individuals filling each of the roles necessary to produce the mod.\n\nWhereas originally we planned on releasing Three Month Mod and moving on to other projects, we now plan on supporting it immediately with a content patch, depending on community reaction to our first release.\n\nIf you want to see more from the mod, the best way is to get active in our forums and let us know. Suggestions, ideas, we&amp;#039;ll take it all into consideration.\n\nYou can also visit us on IRC @ #blackened-interactive on irc.gamesurge.net\n\nAlso, be sure to join in our Steam community Steamcommunity.com ","torrent":{"xt":"urn:btih:352ddd3943d6b9050101a0662421c1328bd1851f","amp;dn":"Project+Valkyrie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"352ddd3943d6b9050101a0662421c1328bd1851f","infoHashBuffer":{"type":"Buffer","data":[53,45,221,57,67,214,185,5,1,1,160,102,36,33,193,50,139,209,133,31]},"announce":[],"urlList":[]}}