{"title":"Democracy Now! The War &amp; Peace Report 08/17/05 - Small Size","uid":3371703,"size":100980853,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:357d11431c5e822cab2e5c083d8b92e3c264c1dd&amp;dn=Democracy+Now%21+The+War+%26+Peace+Report+08%2F17%2F05+-+Small+Size&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Aldrian","files":1,"time":1124420402,"description":"Description: Smaller version.\n\n&quot;Independent news show hosted by award-winning journalists Amy Goodman and Juan Gonzalez\n\nHeadlines for August 17, 2005\n\n- Israeli Troops Begin Forced Evacuation of Gaza\n- At Least 43 Died in Morning Bombings in Baghdad\n- Anti-War Camp in Crawford Texas Vandalized\n- Report: UK Police Lied About Shooting of Innocent Man\n- Pentagon Analyst &amp; AIPAC Lobbyists Plead Innocent in Spy Case\n- Haitian Priest Gerard Jean-Juste Collapses in Jail\n- Bush Administration Attempts To Remove Judge in Indian Case\n\n\n- Israel Begins Forced Removal of Jewish Settlers From Gaza as Deadline Expires\n\nIsraeli troops began the forced evacuation of thousands of Jewish settlers from the Gaza strip Wednesday after a deadline for them to leave expired last night. We go to Gaza to speak with Chris McGreal, correspondent with the London Guardian, who reports from the settlement of Neve Dekalim. [includes rush transcript]\n\n\n- As Unarmed IDF Soldiers Evacuate Settlers, A Look at the Israeli Bulldozing of the Palestinian Home that Killed Rachel Corrie\n\nAs the Israeli pays millions of dollars to Gaza settlers and prepares to demolish their homes after the evacuation, we look back at another home demolition that came with no compensation. American activist Rachel Corrie was crushed by an Israeli military bulldozer as she tried to protect a Palestinian home. We speak with the family that lived in that home and Rachel Corrie's mother. [includes rush transcript]\n\n\n- Debate on Gaza Withdrawal: Palestinian Sociologist vs. the Zionist Organization of America\n\nAs Israeli troops began the forced evacuation of thousands of Jewish settlers in the Gaza Strip, we host a debate between Morton Klein, the head of the Zionist Organization of America and Rabab Abdulhadi, the head of the Center for Arab American Studies at the University of Michigan-Dearborn.&quot;\nDate: August 17th 2005\n\nKeywords: Democracy Now video rm Israel gaza iraq baghdad crawford uk aipac haiti bush \n\nLenght: 1hour\nDemocracynow.org\nChomskytorrents.org\n","torrent":{"xt":"urn:btih:357d11431c5e822cab2e5c083d8b92e3c264c1dd","amp;dn":"Democracy+Now%21+The+War+%26+Peace+Report+08%2F17%2F05+-+Small+Size","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"357d11431c5e822cab2e5c083d8b92e3c264c1dd","infoHashBuffer":{"type":"Buffer","data":[53,125,17,67,28,94,130,44,171,46,92,8,61,139,146,227,194,100,193,221]},"announce":[],"urlList":[]}}