{"title":"Bar-B-Q (aka Bar-Be-Q) (2000)","uid":3936465,"size":836683854,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35c6e16a7d8d94852c34c0bcaca741e4d9fa709c&amp;dn=Bar-B-Q+%28aka+Bar-Be-Q%29+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pacificnovelty","files":1,"time":1197833509,"description":"&quot;John West wrote, directed, and stars in this comedy about Ray Ray, a onetime professional athlete who decides to pay a visit to his hometown. His return sparks an impromptu neighborhood party, with Ray Ray and his friends breaking out the grills as hilarity ensues. Layzie Bone from the top-selling hip-hop act Bone Thugs-N-Harmony highlights the supporting cast.&quot;--All Movie Guide\n\n&quot;A Hip Hope Comedy Featuring Rappers&quot;, according to the box cover. Well, Layzie Bone is in this movie for about thirty seconds in a total of two scenes. Apart from that, Bar-B-Q &quot;stars&quot; a bunch of actors that were never heard from before or since: key among them is John West, who wrote and directed the movie as well as playing the lead character, a successful Hollywood actor and former basketball star named, uh, Ray Ray West.\n\nYes, it&amp;#039;s a showcase of vanity and wish-fulfillment: West spends the first third of the movie laying around with his shirt off, talking on the phone to his friends (no, seriously--the supporting cast is pretty much made up entirely of what must be personal acquaintances). What feels like a good twenty minutes is spent on some sort of one-take hip-hop curtain call as the end of the film, as everyone who had any role in the film ever (apart from the absentee Rappers mentioned previously) slowly dances toward the camera after the credits. West and company somehow manage to miss low-hanging fruit, making even easy-laugh characters like a fat man that cannot stop eating and farting into unlikeable, repellent wastes of time and space.\n\nIt&amp;#039;s worth seeing simply for how terrible it is! Continuity goes out the window as the sun rises and sets several times during the course of the late afternoon party; costumes change for no apparent reason; dangling plot threads are burned to a crisp on Charlie Ray&amp;#039;s grill, never to be resolved. The only bright spot in the movie is a bit of abusive banter between boyfriend and girlfriend over a card game, and you&amp;#039;ll be begging the movie to bring those bit characters back after suffering through another ten-minute sequence involving bad breath, stuttering, or the gluttonous fat women who get lost on their way to the bar-b-q.\n\nIt&amp;#039;s one of my favorite bad movies of all time. Every viewing rewards me with something new to be amazed at and horrified by.","torrent":{"xt":"urn:btih:35c6e16a7d8d94852c34c0bcaca741e4d9fa709c","amp;dn":"Bar-B-Q+%28aka+Bar-Be-Q%29+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35c6e16a7d8d94852c34c0bcaca741e4d9fa709c","infoHashBuffer":{"type":"Buffer","data":[53,198,225,106,125,141,148,133,44,52,192,188,172,167,65,228,217,250,112,156]},"announce":[],"urlList":[]}}