{"title":"KOLCHAK THE NIGHT STALKER 109-110 [retr?tv]","uid":4020561,"size":732360751,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:35eb2791b2f9229692a1ee225bedc4ef70fc9261&amp;dn=KOLCHAK+THE+NIGHT+STALKER+109-110+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flixer","files":3,"time":1202653627,"description":"KOLCHAK THE NIGHT STALKER (1974)\nKolchak was originally two made-for-TV movies that aired in the early 70&amp;#039;s, and featured the adventures of Carl Kolchak (Darren McGavin), a down-on-the heels reporter who ran afoul of a vampire in Las Vegas and an alchemist in Seattle. These movies proved popular enough that they were spun off into a series, which placed Kolchak in Chicago with the Independent News Service. Each week for 20 weeks he investigated various supernatural and supranatural creatures, ranging from aliens to vampires to Aztec sacrificial cults. \n\n9. The Spanish Moss Murders    12/6/1974 \nA series of deaths have nothing in common, except that each victim&amp;#039;s chest was crushed, and Spanish moss was found on or near each. Probing the murders, Carl eventually discovers a link: each victim was somehow related to Paul Langois, a hot-tempered Cajun. However, Langois has an iron-clad alibi: he&amp;#039;s been asleep for several weeks!\n  \n10. The Energy Eater    12/13/1974 \nLakefront Hospital and Research Center is a shining example of modernity. Built on reclaimed land, it was completed with only a few tragedies - Indian construction workers killed while doing high-rise work. Then the hospital begins to shake and crack. Strange accidents occur, killing patients and staff. Kolchak thinks he&amp;#039;s onto a construction scandal. But when he talks to construction foreman and Indian medicine man Jim Elkhorn, he discovers the truth is much worse: the construction has awakened something old and powerful. If Carl can&amp;#039;t persuade hospital officials to take action, a lot more people will die...\n \nDVD-rip/XviD/576x320/42min\n\nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:35eb2791b2f9229692a1ee225bedc4ef70fc9261","amp;dn":"KOLCHAK+THE+NIGHT+STALKER+109-110+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35eb2791b2f9229692a1ee225bedc4ef70fc9261","infoHashBuffer":{"type":"Buffer","data":[53,235,39,145,178,249,34,150,146,161,238,34,91,237,196,239,112,252,146,97]},"announce":[],"urlList":[]}}