{"title":"willie dayson band","uid":3347644,"size":39313327,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3745fe8a6edaff05a2a836a817a84323b6bd3ff1&amp;dn=willie+dayson+band&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"allenbynz","files":1,"time":1119500283,"description":"Side One\n Livin' On Borrowed Time\n Too Tough To Tangle,\nRick's Blues\n, Call My Job (Tell The Boss I Won't Be In),\nIn From The Cold\nEvery Day And Every Night\nIvan's (147 OnThe Street)\n Kidman Blues,\nIf Your Feet Can't Fake It,\nJohn's Diner Blues\na v\nRecord Co-ordination Paul Walker: Engineered by Paul Streekslra: Produced by Paul Lloyd, Malcolm Smith, Recorded at Harlequin Studio, Auckland', Dates 28-29/7/82, 1-4/8/82: Mixed at Harlequin Studio, Auckland;\n\nAll compositions by Brian Glamuzina except'Ricks Blue by Willie Daysor.,'Every Day And Every Night' by Jimmy tdcCracklin,'Kidman Blues' by Sleepy John Estes, Call My Job by Detroit Junior. With thanks to Albert Collins\n( Icepicker) for the flat battery. Thanks to all those people, too numerous to mention, who helped us survive, like YOU!\nThe first time I ever saw the Willie Dayson Blues Band was at (he Wakefield bar of the Globe Tavern in Auckland. It was on a Monday night, a couple of years ago, between\nChristmas and New Year.\nSceptical at the prospect of yet another 'blues ' band playing recycled Cream numbers, imagine my surprise at finding a N.Z. band playing Sonny Boy Williamson. HowGnWoll and Freddie King covers and doing them damn competentlyl\n.\nThe original Dayson Band has evolved (two lineup changes plus the addition of a keybaords player) Into a unit which performs covers and original material with equal confidence. Deeply rooted in the blues, their material contains elements of fusion while retaining an indigenous personality of its own. One of the main reasons for the popularity of the Willie Dayson Blues Band is the infectious enthusiasm they inject into their music. Seeing them play live, it is instantly apparent that they are enjoying themselves -a sight too uncommon these days.\nFollowers of the band will be pleased with the choice of songs on this album. The selection contains such perennial favourites a' Call My Job', that old battlestandard Ivan s, the lovely New Orleans feel and swing of Kid Man Blues' ranging through to the instantly memorable and haunting 'Rick's Blues'.\nIndeed the songs here epitomise how far the band has progressed since that Christmas night at the Globe.' Marketed by Festival Records New Zealand Ltd, P.O. Box 1170, Auckland, N.Z.\n","torrent":{"xt":"urn:btih:3745fe8a6edaff05a2a836a817a84323b6bd3ff1","amp;dn":"willie+dayson+band","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3745fe8a6edaff05a2a836a817a84323b6bd3ff1","infoHashBuffer":{"type":"Buffer","data":[55,69,254,138,110,218,255,5,162,168,54,168,23,168,67,35,182,189,63,241]},"announce":[],"urlList":[]}}