{"title":"Funcom - Spillutvikling - Howto make Age of Conan","uid":3895626,"size":1149729178,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:38191dddf3da346af9942580f1a17f699765d15d&amp;dn=Funcom+-+Spillutvikling+-+Howto+make+Age+of+Conan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ostekake3","files":1,"time":1195257029,"description":" &lt;a href=&quot;http://forums.ageofconan.com/showthread.php?t=44779&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://forums.ageofconan.com/showthread.php?t=44779&lt;/a&gt;\n\nDuring the Conan goes to TromsÃƒ?Ã‚Â¸ event Erling Ellingsen held a\n1 hour presentation on how Funcom is making Age of Conan.\n\nIn addition to the previously published gameplay video from\nthat event the presentation part is now finally ready\nto be published !\n\nI filmed it in DVD quality with some sparse lighting and its been\nitching on my hard drives ever since\n\nIt kicks off with the Poitain soundtrack and a collection new screenshots from the development process.\nThe main parts of the presentation and the new information is presented by Erling Ellingsen (Lord Orion)\nwhere all of the developers diaries are used as examples to illustrate what he\\&amp;#039;s talking about.\n\nThe talking is in Norwegian and the amount is just way to much for a single soul like myself to translate it all.\nThis is where our Norwegian speaking (and understanding) part of the community comes in.\n\nThis also leads me to the purpose of publishing this video.\nYou see, the presentation goes in depth into the development process of Age of Conan\nand deep into how Funcom works as a game publisher.\nIts about Funcom, its departments, the developers, the processes and many more aspects of the development process.\nSo - i would like to encourage all those who understand whats being said to watch it at\nleast twice - when you get the time\nMy hope is that it will enable you to become a much more enlightened community member who can\nassist on the forums to keep information sober, correct and proportionate to the factual realities.\n\nMy hope is that those who understands whats being said can help the community, both with regards\nto whats being factually said in the presentation, but more important in the long run\n- keep our community sober and factual with regards to the information flow and developments, on a daily basis.\n\nSo in the future at some time, when someone asks for a change in development, a new feature,\na change in the development, my intentions are for more people to be able to keep all of us more focused onto\nwhats possible and whats more or less impossible to do.\n\nWith that being said, i\\&amp;#039;m not going to go any deeper into this and just give you:\n\nThe video for windows version as a torrent.","torrent":{"xt":"urn:btih:38191dddf3da346af9942580f1a17f699765d15d","amp;dn":"Funcom+-+Spillutvikling+-+Howto+make+Age+of+Conan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38191dddf3da346af9942580f1a17f699765d15d","infoHashBuffer":{"type":"Buffer","data":[56,25,29,221,243,218,52,106,249,148,37,128,241,161,127,105,151,101,209,93]},"announce":[],"urlList":[]}}