{"title":"MegaSpoof - By Didrik RarMan","uid":3369796,"size":2316039,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:38538ee7ea11e588395d101063880283ce84a13e&amp;dn=MegaSpoof+-+By+Didrik+RarMan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RealDeal","files":2,"time":1124045926,"description":"Very good porno program! Used to fake memberships at very many good porn sites!!!\n\nBy: Didrik RarMan\n\nWhat is Megaspoof?\n\n\nMegaspoof is used to spoof the referrer of a website you wish to visit. Whenever you browse the web and click a link, your browser loads the desired page you clicked. Many websites, however, check the referrer of a webpage before allowing you to open the page. The referrer is the page where you came from and which you browser sends to the desired page as being the referrer. You can spoof this referrer (in effect you send a false referrer) so you can access these pages without actually having been on the originating (the spoofed) URL.\nMegaspoof maintains a central list of pages that are &quot;spoofable&quot;. Any user can add a spoof and share this with other users, simply by entering a few things. See How do I add a spoof? for more info on this. Next, other users can vote for this spoof. By voting for a spoof, a spoof-entry will obtain an (averaged) score. The higher the score, the better the spoof (should) be.\nJust for statistics sake, you need an account to use with Megaspoof. No, you do not need to enter any personal data. All you need to enter is a Nickname, and a password. That's all. Really.\nWhen adding spoofs, your username will be added to the spoof. The more spoofs you add, the higher ranking you will obtain in the Top 100 spoofers. If you're not in this list, you haven't added enough spoofs. Also, your username will be stored when voting for a spoof. Also, this application contains no spyware, ad-ware or other crap-ware. And best of all, it's free!\n","torrent":{"xt":"urn:btih:38538ee7ea11e588395d101063880283ce84a13e","amp;dn":"MegaSpoof+-+By+Didrik+RarMan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38538ee7ea11e588395d101063880283ce84a13e","infoHashBuffer":{"type":"Buffer","data":[56,83,142,231,234,17,229,136,57,93,16,16,99,136,2,131,206,132,161,62]},"announce":[],"urlList":[]}}