{"title":"Twelfth Gate - Summoning (320k)","uid":3753083,"size":144070871,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39230b4d4018ad0a9fdb87311eca1561d20d4be2&amp;dn=Twelfth+Gate+-+Summoning+%28320k%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"neonblack77","files":12,"time":1185426936,"description":"Full-length, Crash Music\nFebruary 11th, 2003 \t\n\n] \t\n1.\tMortal Coil\t04:46\t\n2.\tDesire Brings\t05:32\t\n3.\tOrpheus\t06:13\t\n4.\tInnocent\t05:01\t\n5.\tFlames of Anger\t05:11\t\n6.\tWaiting in Shadows\t04:53\t\n7.\tSugarcoated\t07:12\t\n8.\tWheel of Life\t05:25\t\n9.\tBridge of Uncertainty\t04:33\t\n10.\tMalevolent Sky\t05:09\t\n11.\tForgotten Names\t06:00\t\n\nTotal playing time\t53:28\n\n\nWritten by Shred1921  on June 28th, 2003\n\nShoot, this is a crazy record. I took a step into the local metal shop about a month ago, and this was playing. Immediately I thought it sounded like Nevermore. Tight drumming, loud-ass riffage, and the vocalist is a complete Warrel Dane rip-off. After listening to a couple tracks, I decided it was a must have, so I bought it. After a few listens, I&amp;#039;ve noticed that alot of the songs on this album are almost complete homages to many different metal bands.\n\nStarting us off, we have &amp;#039;Mortal Coil.&amp;#039; Right off the start, we have some pseudo-thrash riff that sounds like Slayer. Loads of double kick and speed-riffing power us through the first couple verses. After a bit of lead stuff and another verse, they switch riffs into a completely boss &amp;#039;Painkiller&amp;#039;-esque riff, then back into a thrashy riff. Vocalist sounds like Matt Barlow now. He nails a huge note, falsetto, total Halford style. They lead into a big ugly riff breakdown, pick the pace back up, drop some impressive! double kick, some harmonics, and scream to a halt. Yeah, that was just the first song!\n\nTrack 2 is called &amp;#039;Desire Brings.&amp;#039; Whoops, for a second there I thought I slipped &amp;#039;Burnt Offerings&amp;#039; into the CD player because the intro is a total Iced Earth homage. Not for long though, as we drop into some ripping double kick and another Slayer-esque riff, then a Nevermore style riff. This entire album is like this, a big mish-mash of metal ideas, but it all works so well together. Loads of double kick here. After a couple verses, we lead into a bridge section with some shredding bass work and harmonics (Iron Maiden anyone?) pace picks back up into a shred-fest of a solo. Riff out for a couple minutes to a close... so metal.\n\n&amp;#039;Orpheus&amp;#039; intro sounds like something ripped out of &amp;#039;Ram It Down&amp;#039; or &amp;#039;Painkiller.&amp;#039; Some great vocal work over top. They lead into another high-flying solo section. About two minutes in, we finally pick up into a fast-paced Maiden style riff. Near the end of the song, we have more Maiden style harmonics sections and a finger tapping solo. Metal madness.\n\nNext up is &amp;#039;Innocent.&amp;#039; Back to Nevermore style with this one. Mind-rending vocal work with some solid drumming behind it. They open up into a Nevermore style riff. They use mostly just the one riff, with some cool fast pace lead stuff near the middle, and end with the riff fading out from side to side, another crazy song.\n\nI&amp;#039;m gonna end the song-by-song review here because the rest of the tracks are just more of the same. Tons of variation as far as riffs go. You&amp;#039;ve got thrash, speed, heavyness, crushing solo work, great highs and lows on the vocals, killer drumming with some really insanely fast double kick here and there, solid backbone of bass with some bass doodle moments as well.\n\nThis was a very unexpected hit for me, I had never heard of these guys. Hopefully they get more recognition because they have made an absolute gem of an album here. Whether you&amp;#039;re a thrash fan, a speed fan, a heavy fan, this album really covers alot of the bases, and melds it all together very well to make a crushing album. Riff changes galore here.\n\nIt&amp;#039;s strange how the description of the band is &quot;traditional/progressive&quot; how can you be both traditional and progressive? They are total opposites. But with this band, there really is no way to describe them because they range all over the place. If you can find this album, get it for sure, you won&amp;#039;t be let down. It&amp;#039;s just plain metal.","torrent":{"xt":"urn:btih:39230b4d4018ad0a9fdb87311eca1561d20d4be2","amp;dn":"Twelfth+Gate+-+Summoning+%28320k%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39230b4d4018ad0a9fdb87311eca1561d20d4be2","infoHashBuffer":{"type":"Buffer","data":[57,35,11,77,64,24,173,10,159,219,135,49,30,202,21,97,210,13,75,226]},"announce":[],"urlList":[]}}