{"title":"Rudolph, el Reno de la Nariz Roja","uid":3934241,"size":734343168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:392caafe7e7feec3972d4d5bcab2ecf6ac5017b3&amp;dn=Rudolph%2C+el+Reno+de+la+Nariz+Roja&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"riojatorrent","files":1,"time":1197706478,"description":"Los duendes de la Aurora Boreal centellean por los cielos del Polo Norte para celebrar el nacimiento del cervatillo de RÃƒÂ¡faga y Mitzi, Rudolph. Los orgullosos padres estÃƒÂ¡n sorprendidos de que Rudolph tenga una singular cualidad: tiene una nariz colorada y brillante. \n\nA medida que Rudolph va creciendo, tiene el sueÃƒÂ±o de llegar a ser uno de los ciervos voladores de Papa Noel, como lo es su padre. Pero sus compaÃƒÂ±eros de la escuela de le ridiculizan y le ponen motes crueles por ser distinto a ellos. Frustrado porque nunca llegarÃƒÂ¡ a ser un volador de prestigio, un dÃƒÂ­a Rudolph descubre que tiene una admiradora, la joven cervatilla Zoey, que se ha enamorado de ÃƒÂ©l. \n\nDecidido a demostrar que tiene lo que hay que tener para ser un volador, Rudolph  participa en los Juegos Juveniles de Ciervos. En una dificilÃƒÂ­sima carrera de trineos Rudolph gana, pero es descalificado por el uso ilegal de una brillante nariz roja. Avergonzado, Rudolph huye hacia las profundidades silvestres del Polo Norte. \n","torrent":{"xt":"urn:btih:392caafe7e7feec3972d4d5bcab2ecf6ac5017b3","amp;dn":"Rudolph%2C+el+Reno+de+la+Nariz+Roja","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"392caafe7e7feec3972d4d5bcab2ecf6ac5017b3","infoHashBuffer":{"type":"Buffer","data":[57,44,170,254,126,127,238,195,151,45,77,91,202,178,236,246,172,80,23,179]},"announce":[],"urlList":[]}}