{"title":"The Flight of Dragons DVD","uid":3782485,"size":3054979119,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ab460a53c7983cfd7448229b106068d046cf7ac&amp;dn=The+Flight+of+Dragons+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"griffie","files":14,"time":1187912005,"description":"Movies : Animation : VHS Rip : English\nThe Flight of Dragons is a piece of animation from 1982 loosely based on two books. The story uses elements and storylines from Gordon R. Dickson&amp;#039;s &amp;#039;The Dragon and the George&amp;#039;, while the artwork is loosely based on Wayne Anderson&amp;#039;s illustrations in Peter Dickinson&amp;#039;s &amp;#039;The Flight of Dragons&amp;#039;. \n\n(From Wikipedia, http://en.wikipedia.org/wiki/The_Flight_of_Dragons) \n\n&quot;Peter Dickinson (voiced by John Ritter) is a poor, dreaming scientist/inventor who is transported into the failing world of magic. He meets three wizards, two dragons, and the beautiful Princess Melisande (voiced by Alexandra Stoddart), who is a Wizard&amp;#039;s foster-daughter. The green wizard Carolinus (voiced by Harry Morgan), his brothers Lo Tae Shao (voiced by Don Messick), and the blue wizard Solarius explain that the world of magic is dying. To save it, they must join together to create the &amp;#039;Last Realm of Magic&amp;#039; -- a protected place where magic will live on after humans stop believing. The red wizard Ommadon (voiced by James Earl Jones) has refused to aid his brothers, and vows to dominate humanity by infesting humans with greed, in an attempt to stop magic&amp;#039;s death by force. The only way to stop him is to take his Red Crown, the source of his dark magic. Twentieth Century Peter, being descended from an ancient hero, is asked to begin a quest.&quot; \n\nThis is a VHS rip, which gives the movie more of a dreamy quality because everything is muted. I&amp;#039;ve tried to clean up the video/audio quality somewhat, but there is only so much that can be done with a VHS tape. A small portion of the audio at the beginning of the movie has a pop in it, but everything else should be good. \n\nDVD (VHS rip), NTSC, English spoken, no subs. Burn the files to a disc for DVD player playback. ","torrent":{"xt":"urn:btih:3ab460a53c7983cfd7448229b106068d046cf7ac","amp;dn":"The+Flight+of+Dragons+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab460a53c7983cfd7448229b106068d046cf7ac","infoHashBuffer":{"type":"Buffer","data":[58,180,96,165,60,121,131,207,215,68,130,41,177,6,6,141,4,108,247,172]},"announce":[],"urlList":[]}}