{"title":"SpywareDoctor.v5.0.5.259 + Patch Working By Yes-no","uid":3780567,"size":14984167,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3ffad065d36dcfd1fd2e851ccb127e393379dfd7&amp;dn=SpywareDoctor.v5.0.5.259+%2B+Patch+Working+By+Yes-no&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yes_no","files":3,"time":1187748484,"description":"Spyware Doctor? provides three-way spyware protection for your PC through real-time threat blocking, advanced system scanning and immunization against known browser infections. Spyware Doctor is a multi-award winning spyware removal utility that detects, removes and protects your PC from thousands of potential spyware, adware, Trojans, keyloggers, spybots and tracking threats. Protect your privacy and computing habits from prying eyes and virtual trespassers with the help of Spyware Doctor. \nAnti-virus software and firewalls do not fully protect your system against the majority of spyware and privacy threats. Because spyware is commonly bundled with software downloads, attached to e-mails, or transmitted through networks it can appear to be legitimate software, but once installed it can be nearly impossible to detect and remove without the help of a dedicated spyware removal tool like Spyware Doctor. \nSpyware Doctor has consistently been awarded Editors&amp;#039; Choice, by leading PC magazines and testing laboratories around the world, including United States, United Kingdom, Sweden, Germany and Australia. All current versions of Spyware Doctor have won Editors&amp;#039; Choice awards from PC Magazine in United States. In addition, after leading the market in 2005, Spyware Doctor was awarded the prestigious Best of the Year at the end of 2005. \n\nPatch \n\nEnter your name in the editbox and patch the file, that&amp;#039;s all.","torrent":{"xt":"urn:btih:3ffad065d36dcfd1fd2e851ccb127e393379dfd7","amp;dn":"SpywareDoctor.v5.0.5.259+%2B+Patch+Working+By+Yes-no","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ffad065d36dcfd1fd2e851ccb127e393379dfd7","infoHashBuffer":{"type":"Buffer","data":[63,250,208,101,211,109,207,209,253,46,133,28,203,18,126,57,51,121,223,215]},"announce":[],"urlList":[]}}