{"title":"Gigante de los Cielos - El Airbus A380","uid":3920372,"size":1384202346,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:411f9eade9f2204aec54525b5cadf0d1c97255a1&amp;dn=Gigante+de+los+Cielos+-+El+Airbus+A380&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"glory741","files":4,"time":1196760817,"description":"Episodio 1\n\nDiscovery Channel emite este documental dividido en tres partes, incluyendo metraje adicional. La producciÃƒÂ³n describe los dos ÃƒÂºltimos aÃƒÂ±os de montaje del Airbus A380, el proyecto mÃƒÂ¡s ambicioso de la historia de la aviaciÃƒÂ³n civil. En 2006, esta gigantesca nave estarÃƒÂ¡ preparada para transportar 550 pasajeros en viajes de mÃƒÂ¡s de 14.000 kilÃƒÂ³metros. El proyecto del Airbus A380 se presentÃƒÂ³ en el aÃƒÂ±o 2000 como una alternativa al Boeing 747 para viajes de largo recorrido.\n\nEpisodio 2\n\nSegunda entrega del documental sobre el Airbus A380 que descubre la innovadora y desafiante ingenierÃƒÂ­a del aviÃƒÂ³n, los diferentes equipos tÃƒÂ©cnicos que han intervenido en su construcciÃƒÂ³n y los complicados sistemas de transporte utilizados para reunir todas las piezas en la sede oficial de Toulouse, Francia.\n\nEpisodio 3\n\nÃƒ?ltima entrega de este documental, una de las producciones que representan la lÃƒÂ­nea de divulgaciÃƒÂ³n cientÃƒÂ­fica y tÃƒÂ©cnica de Discovery Channel. Producido por Darlow Smithson y Tom Brisley, el proyecto ha contado tambiÃƒÂ©n con la participaciÃƒÂ³n de Charles Champion, Vicepresidente Ejecutivo del Proyecto Airbus A380, lÃƒÂ­der del sector de aviones de pasajeros de Europa.\n","torrent":{"xt":"urn:btih:411f9eade9f2204aec54525b5cadf0d1c97255a1","amp;dn":"Gigante+de+los+Cielos+-+El+Airbus+A380","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"411f9eade9f2204aec54525b5cadf0d1c97255a1","infoHashBuffer":{"type":"Buffer","data":[65,31,158,173,233,242,32,74,236,84,82,91,92,173,240,209,201,114,85,161]},"announce":[],"urlList":[]}}