{"title":"F.E.A.R. Singleplayer Demo","uid":3366069,"size":678081814,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4154f1a2c4a12f08400dac73d13bd961f1459ce5&amp;dn=F.E.A.R.+Singleplayer+Demo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Omar Contreras","files":1,"time":1123316379,"description":"F.E.A.R. - First Encounter Assault and Reconnaissance\nEnglish (North America) Single Player Demo \nReadme File\nJuly 29, 2005\n\n***************************************************\nAbout This Document:\n\nThank you for playing the F.E.A.R. Single Player Demo.\n\nThis README file includes information that pertains to general problems\nand questions you may have concerning the game or your computer. \n\n************************************************\n\nTABLE OF CONTENTS\n\nI.\tINTRODUCTION\nII.\tSYSTEM REQUIREMENTS\nIII.\tINSTALLATION INSTRUCTIONS\nIV.\tNOTES ON COMPATIBILITY\nV.\tKNOWN ISSUES\nVI.\tPERFORMANCE\nVII.\tF.E.A.R. SITES\nVIII.\tDEDICATIONS, CREDITS AND SPECIAL THANKS\nIX.\tEND-USER LICENSE AGREEMENT (EULA)\n\n\t               \nI. INTRODUCTION\n===============\n\nYou must be the new guy. I hear you?re one tough son of a bitch.  I hope \nit?s true, because we could really use the help.  Finding the right people \nfor this team isn?t easy, especially with the kind of crap we?re been running \ninto lately. \n\nAny special ops team needs to prepare for the unexpected, but with F.E.A.R., \nyou?d better learn to expect the unexpected, and more importantly, believe \nthe unbelievable.  You?re going to come across stuff you can?t explain, and \nyou?ll need to be ready to deal with whatever it throws at you. Your own life,\n\nas well as the lives of your teammates, will depend on it.\n\nThe information you'll get in this document will supplement and update the \ninformation you'll have received so far to run F.E.A.R..  If you're having a \ntechnical problem, look here for the most recent troubleshooting answers.\n\nWe're expecting great things from you.  Good luck!\n\n\nII. SYSTEM REQUIREMENTS AND SUPPORTED CHIPSETS\n==============================================\n\nIn order to install and play F.E.A.R., your system must meet or exceed\nthe following minimum system requirements:\n\n\n?US version of Windows(R) 2000/XP with latest service pack installed\n?DirectX(R) 9.0c June Edition (Included) or higher\n?Pentium(R) 4 1.7 GHz or equivalent\n?512MB RAM\n?64MB DirectX(R) 9.0 compliant video card with pixel shader support\n?A Monitor that can display in 4:3 aspect ratio\n?1.4GB free hard drive space for installation\n?Additional hard drive space for a Windows(R) swap file and saved game files. \n?CD-ROM or DVD drive\n?100% Windows(R) compatible computer system (including compatible 32-bit\ndrivers for CD-ROM, video card, sound card, and input devices)\n?16-bit DirectX(R) 9.0 compliant sound card with support for EAX 2.0\n?Windows(R) compatible Mouse and Keyboard\n\nIn order to play the game at the recommended resolution, detail and \nperformance levels, your computer should meet or exceed the following \nspecifications:\n\n?US version of Windows(R) XP with the latest service pack installed\n?Pentium(R) 4 3.0 GHz or equivalent\n?2GB of RAM\n?256MB DirectX(R) 9.0 video card with pixel shader 2.0 support\n\nSUPPORTED VIDEO CARD CHIPSETS WITH LATEST DRIVER VERSION INFO:\n\nATI(TM)\n  \n  Catalyst(TM) Drivers (Windows(R) 2000/XP): v5.6\n  \n  Radeon(R) 9000 Series\n  Radeon(R) 9500 Series\n  Radeon(R) 9600 Series\n  Radeon(R) 9700 Series\n  Radeon(R) 9800 Series\n  Radeon(R) X600 Series\n  Radeon(R) X700 Series\n  Radeon(R) X800 Series\n  Radeon(R) X850 Series\n\nNVIDIA(R)\n\n  ForceWare(TM) Drivers (Windows(R) 2000/XP): v77.72\n\n  GeForce(TM) 4 Ti Series\n  GeForce(TM) FX 5900 Series\n  GeForce(TM) 6600 Series\n  GeForce(TM) 6800 Series\n\nPlease note that attempting to play the game using video hardware that is\nnot listed here may result in reduced performance, graphical anomalies,\nor both.\n\n\nIII. INSTALLATION INSTRUCTIONS\n==============================\n\nTo begin, double-click the installation file icon. Within a few seconds, the\nsetup\napplication should start. Once the installer is running, just follow the\non-screen\nprompts to complete the installation. \n\nNOTE:  During installation you will be prompted to install Microsoft's\nDirectX(R).\nDirectX(R) version 9.0c June Edition must be installed before playing. If you\nelect\nnot to install this version, the game will not be installed.\n\nTo launch the game once installation has finished, double click the FEAR SP\nDemo\nicon on your desktop, or:\n\n1) Click on the Windows(R) Start button\n2) Select Programs\n3) Select Sierra\n4) Select FEAR SP Demo\n5) Click on the FEAR Sp Demo icon\n\n\nIV. NOTES ON COMPATIBILITY\n==========================\n\nFUNCTIONALITY\n\nF.E.A.R. is designed to function with Windows(R) 2000/XP-compatible\ngraphics and sound cards. Drivers for these devices are provided\nby Windows(R) itself or the respective card manufacturers and may\noccasionally result in compatibility problems beyond our control.\n\nF.E.A.R. does not support Windows(R) 95, Windows(R) 98, or Windows(R) ME\nsince the application requires proper installation and functionality\nof DirectX(R) 9.0c or higher. Microsoft does not provide or support\nDirectX(R) 9.0c for these operating systems. \n\nIf you experience any problems, it is always recommended that you\nobtain the latest drivers for your hardware. Driver updates resolve\nthe overwhelming majority of compatibility issues. Most hardware\nvendors make their drivers available on their web site.  If you are\nunsure of a web site URL for a particular hardware vendor, you may\nwant to try accessing one of the popular Windows(R) software update\nsites such as:\n\n  http://www.windrivers.com\n\nAdditionally, a brief list of manufacturer web sites appears below\nfor your reference.\n\nWEB LINKS\n\n  ATI: http://www.ati.com/support/driver.html\n  Creative: http://us.creative.com/support/downloads/\n  NVIDIA(R): http://www.nvidia.com/content/drivers/drivers.asp\n  Turtle Beach: http://www.turtlebeach.com/site/support/ftp.asp\n\n\nV.  KNOWN ISSUES\n================\n\nThe following items are known issues with the current beta version of the\ngame.\n\nGLOBAL:\n\n* Users playing on Windows(R) XP Pro X64 Edition may encounter a\n  &quot;Windows Media Technologies&quot; error during install. \n\n* If you notice intermediate framerate hitching when running in High detail\n  setting, try turning texture resolution down to Medium.\n\n* The Soft Shadows option will not work if Full-Screen Anti-Aliasing (FSAA)\n  in enabled through the Windows Control panel. If you want to play with\n  both Soft Shadows and FSAA enabled, please use the in-game FSAA Controls.\n\n* It has been reported that the game may not uninstall from partitioned\n  hard drives if installed to anything other than the &quot;C&quot; drive\n  partition.\n\n* Please download the latest service pack before playing. \n\n* If you attempt to run the game on a system with a missing or out-of-date\n  version of DirectX(R) installed, then an error message will appear on\n  launch that mentions &quot;The dynamic library d3d9.dll could not be found\n  in the specified path&quot;. To fix the problem, re-install the application\n  and elect to install DirectX(R) 9.0c.\n\n* Make sure that all applications that are running in the background such as\n  virus scanners, desktop Utilities (menus/toolbars), media players, and\n  chat programs are disabled before running F.E.A.R.\n\n* Selecting a display resolution that is supported by your video card but\n  not your monitor will result in a black screen. If this occurs, use\n  ALT-F4 to quit the application, and then use the display option in the\n  configuration utility (CONFIG.EXE) to select a resolution supported by\n  your monitor.\n\n* Task-switching with ALT-TAB or the Windows(R) Key back to the desktop while \n  running the game is not recommended.\n\n* Striking the Shift key five times may cause the 'Sticky Key' feature to\n  become enabled in Windows(R). If this happens, the feature will task\n  switch to a desktop dialogue box with options related to this feature,\n  including one to disable it entirely.\n\n\nGRAPHICS:\n\n General: \n\n* Launching the game in Windows(R) XP 64-Bit Edition with ATI Radeon\nWindows(R)\n  64-Bit edition Beta Drivers 3 may result in a black screen on launch. To\nwork\n  around this issue, toggle your color quality settings in Windows(R) from 32\n  to 16-bit (or vice-versa) and then back again. This should allow the game to\n  launch normally. \n\n ATI Radeon:\n\n* Enabling FSAA and Pixel Doubling at the same time will result in a black\nscreen. \n  This appears to be a driver issue. \n\nSOUND:\n\n  General:\n\n* Ambient sounds may stop playing after a certain amount of time. We are\n  still looking into this. \n\n  If the in-game sounds and dialogue (voices) do not play, or there are\n  problems with the quality of these sounds, then please try each of the\n  following steps (in order) before playing again. Note that you should only\n  try one solution at a time, since trying them all can greatly reduce the\n  overall sound quality of the game.\n \n  1. Make sure that you have the latest drivers available for your sound\n     hardware installed. These can usually be found on the manufacturer's\n     website. Before installing the driver, uninstall the audio device\n     using the Device Manager. If possible, run a &quot;driver cleaner&quot;\n     application to fully clean out any extra pieces of the driver and/or\n     leftover files of another sound card's drivers. Do NOT allow Windows\n     to install its default driver when asked. Instead, only install the\n     driver you downloaded from the manufacturer's website.\n\n  2. From your main installation folder (the default is \n     C:Program FilesSierraFEAR SP Demo), double-click on the\n     file named WMFADist.exe, and then follow the on-screen instructions.\n     This will manually install the audio codec that is required by the\n     game. \n    \n  3. From the in-game sound options menu, disable EAX and Hardware Sounds.\n\n  Please note that since this game uses an MP3 codec for sound, 3rd party\n  codec packs may cause speech and sound to drop out completely. If you have\n  a codec pack installed and still have sound issues after trying all of \n  the steps listed above, then you'll need to uninstall both the codec\n  pack(s) and the game and then re-install F.E.A.R.\n\n  If 3d sounds seem to be change volume wildly (i.e. looking directly at an\n  object will make it sound quieter than when it is to the side), then\n  you may have your speaker configuration set up incorrectly. For instance,\n  if you're listening in headphones but have the speaker configuration set\n  to Surround 5.1, then a lot of sounds will be sent to speakers that don't\n  exist. You can change the speaker configuration in your sound card's\n  applications (such as Creative's AudioHQ or Surround Mixer) or in the\n  Control Panel.\n    \n  If sounds that are originating in front of you sound as if they are coming\n  from behind, and if these sounds seem distorted, and you are playing in\n  5.1, 7.1 or any other Surround Configuration, then you may need to turn off\n  CMSS in your EAX console. CMSS is used to create a multi-channel version of\n  a stereo source. Unfortunately, it can cause issues like this when using it\n  on sounds that are already designed to be in Surround. Note that sometimes\n  you can choose not to install the EAX Console when installing your sound\n  card, so you may have to reinstall the driver in order to get this\napplication.\n\n  If you are using a Creative brand sound card and get poor framerates when\n  sound hardware acceleration is enabled, then check for a process called\n  &quot;CtHelper&quot;in the Windows(R) task manager. If it's there, terminate it and\n  try the game again.  If this works, please contact Creative to learn\n  how to permanently disable CTHelper. If CTHelper is not present in the list\n  and the problem occurs anyway, then you will need to disable sound hardware\n  acceleration in the Sound section of the game's options menu, or in the\n  Windows control panel, or in DxDiag.\n\n\nPERIPHERALS:\n\n  Logitech MX510\n\n  Users of this mouse may find it to be extremely sensitive in-game. Please\nuse\n  the software supplied with your mouse to correct this issue.\n\n  Saitek ST90\n\n  There have been reports of problems with mapping the buttons on this \n  joystick to the fire key in the game.  \n\nADVANCED OPTIONS\n\n  If you're encountering problems running the game, you can try\n  tweaking some advanced settings in the configuration utility\n  (config.exe). Please note that this is for advanced users only,\n  since tweaking these settings could very well create other problems\n  in the game.\n\n  DISABLE SOUND\n    If this box is checked, there will be no sound effects in the game.\n    Also, dialogue and lip-synching will not play correctly, but music\n    will still play.\n\n    If you are experiencing problems running the game and suspect your\n    sound card may be the cause, you might check this box and see if\n    the problem goes away. If it does then the problem may be due to\n    a problem with your sound hardware or drivers.\n\n  DISABLE MUSIC\n    If this box is checked, there will be no dynamic DirectMusic in\n    the game. Please use this option for troubleshooting purposes only.\n\n  DISABLE JOYSTICKS\n    Disables input from joysticks and game pads. Certain joysticks\n    and game pads may interfere with normal mouse or keyboard\n    control in the game. If you suspect this is occurring, checking\n    this box before running the game may resolve the problem.\n\n  DISABLE MOVIES\n    If this box is checked, the intro logo movies will not be\n    shown. Use this if your system is having trouble playing these\n    movies.\n\n  DISABLE SOUND FILTERS\n    If this box is checked, sound filtering effects (reverb) will be\n    disabled. Only cards with EAX 2.0 support will benefit from this\n    feature. If you experience problems such as static when firing a\n    weapon in a particular area within a level, then you may need to\n    play with sound filtering disabled. \n\n  DISABLE HARDWARE SOUND\n    If this box is checked, this will disable DirectSound 3D sound support\n    and could cause performance issues.\n\n  RESTORE DEFAULTS\n    If this box is checked, all in-game options will be restored to the\n    default values. This can be useful if a particular option setting\n    is preventing you from restoring the defaults from the menu system.  \n\n\nVI. PERFORMANCE\n================\n\nDETAIL SETTINGS and DISPLAY RESOLUTION\n\n  In order to get the best game play experience, it is not recommended to\n  run F.E.A.R. at high resolutions. You should avoid resolutions above\n  1024x768 on any current generation card. Instead, you can use the\n  full-screen anti-aliasing (FSAA) option under Graphics in the advanced\n  options menu. This helps improve the visual quality of the final scene\n  without dramatically increasing the amount of work that must be performed.\n\n  Most players will also notice a significant increase in frame rate by\n  disabling the Vsync option in the display options screen. If this doesn?t\n  make enough of a difference, your next step should be to lower your\n  screen resolution to 800x600 or 640x480. \n\n  If performance is still a problem at this stage, try these additional\n  steps:\n\n  ? Disable FSAA and Soft Shadows in the advanced options under Graphics.\n  ? Use Trilinear Texture Filtering instead of Anisotropic.\n\n  If your system does not meet the requirements as listed at the top\n  of this document, you may still be able to play with reasonable\n  performance by following these steps:\n\n  ? If your video card doesn't meet the requirements, enable Pixel Doubling.\n  ? If you are using a GeForce(TM)FX card, set ?Force DX8 Shaders? to on.\n  ? If you have less than 512MB of RAM or a video card with less than\n    128MB of RAM, use low or medium Texture Resolution. \n\nUPGRADING\n\n  If you are dissatisfied with the level of detail that your system can\n  handle, then you may wish to consider upgrading. F.E.A.R.'s\n  performance is most affected by your video card, followed closely by the\n  CPU speed and the amount of installed memory in your machine. A high end\n  video card and CPU will usually result in considerable frame rate\n  improvements, while installing more RAM will result in shorter load times\n  and less hitching during game play.\n\n\nVII. F.E.A.R. SITES\n====================\n\nWEBSITE LINKS\n\n  For more information on F.E.A.R. and additional options for \n  technical support, and the latest updates please visit the following web\n  sites:\n\n    The Official Site\n    http://www.gameoftheyear.com/us/\n\n    Sierra Entertainment\n    http://www.sierra.com\n\n    Monolith Productions\n    http://www.lith.com\n\nRELEASE FROM MERIDA CITY","torrent":{"xt":"urn:btih:4154f1a2c4a12f08400dac73d13bd961f1459ce5","amp;dn":"F.E.A.R.+Singleplayer+Demo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4154f1a2c4a12f08400dac73d13bd961f1459ce5","infoHashBuffer":{"type":"Buffer","data":[65,84,241,162,196,161,47,8,64,13,172,115,209,59,217,97,241,69,156,229]},"announce":[],"urlList":[]}}