{"title":"J.River Media Center 12.0.294","uid":3755599,"size":16387160,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:416a65809c0dc8f387cfac422328880c83e99b60&amp;dn=J.River+Media+Center+12.0.294+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sunblock","files":1,"time":1185582054,"description":"J.River Media Center 12.0.294 \n\nMusic, photos and video YOUR way -- all from a single software program! Connect your PC to your home entertainment hardware and control it all with a remote! Load your music on your iPod while you watch TV! All with one easy-to-use program -- MEDIA CENTER! \n\nMake your media part of your digital lifestyle \n\nCopy music from MEDIA CENTER to a portable digital audio player or move digital camera photos into MC&amp;#039;s powerful image library. Make a CD of music for your car. Record your favorite shows and watch them on your TV. More than one soundcard? Play different music simultaneously in different rooms. MC&amp;#039;s Media Server can even stream your music to your PC at work! \n\n- Organize your images \n\nThe main image screen, showing thumbnails of digital camera images. An optional properties page can be opened to show details about each image. \n\n- Theater View \n\nA unique full screen mode. This customizable view is designed for browsing your media on a monitor or TV from across the room. Type is enlarged and navigation is simplified for easy use with a remote device. \n\n- Mobilize your tunes \n\nMC supports more hardware players than any other application. Now you can synchronize your library with your Apple iPod or one of many supported devices\n\n","torrent":{"xt":"urn:btih:416a65809c0dc8f387cfac422328880c83e99b60","amp;dn":"J.River+Media+Center+12.0.294+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"416a65809c0dc8f387cfac422328880c83e99b60","infoHashBuffer":{"type":"Buffer","data":[65,106,101,128,156,13,200,243,135,207,172,66,35,40,136,12,131,233,155,96]},"announce":[],"urlList":[]}}