{"title":"TTC - Great Debate - Advocates and Opponents of the American Con","uid":3890190,"size":270754096,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:434f173c0db9787801fd1c3cba4f0e0b99fda289&amp;dn=TTC+-+Great+Debate+-+Advocates+and+Opponents+of+the+American+Con&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"autoslump","files":14,"time":1195011667,"description":"The Great Debate: Advocates and Opponents of the American Constitution\n\n(12 lectures, 30 minutes/lecture)\n\nCourse No. 4878\n\nTaught by Thomas L. Pangle\nThe University of Texas at Austin\nPh.D., University of Chicago \n\n----------------------------------------------\n\nCourse Lecture Titles\n\n1.\tSignificance and Historical Context\n2.\tClassical Republicanism\n3.\tThe Anti-Federalists&amp;#039; Republican Vision\n4.\tThe Argument over National Security\n5.\tThe Deep Difficulties in Each Position\n6.\tDebating the Meaning of &quot;Federalism&quot;\n7.\tThe Madisonian Republic\n8.\tThe Argument over Representation\n9.\tDisputing Separation of Powers, Part 1\n10.\tDisputing Separation of Powers, Part 2\n11.\tThe Supreme Court and Judicial Review\n12.\tThe Bill of Rights\n\n\n----------------------------------------------\n\n&quot;We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, ...&quot;?U.S. Constitution\n\nWhile those words were written over 200 years ago, recent years have seen an explosion of interest in and interpretation of the U.S. Constitution. Its authority and stature are routinely invoked by voices from every point on the political spectrum who seek to defend their views on issues ranging from separation of powers to the proper role of the Supreme Court to legitimate interpretations of the Bill of Rights, with frequent references to the Founding Fathers and their true &quot;intent.&quot;\n\nBut how much do most of us really know about that intent?\n\nThe fact is, as Professor Thomas L. Pangle makes clear in The Great Debate: Advocates and Opponents of the American Constitution, many of those Founding Fathers?men who had been signers of the Declaration of Independence, leaders of the American Revolution, or delegates to the Continental Congress?were highly critical of the new Constitution and staunchly opposed it when it was first put forth for ratification by the states as a replacement for the Articles of Confederation.\n\nLearn Which Founders Opposed the New Constitution ...\n\nThomas Jefferson, for example, who wrote the Declaration of Independence, was highly skeptical of the proposed constitution and was not among the Federalists who were urging ratification, although his reluctant support for it was eventually won by his good friend James Madison.\n\nPatrick Henry, whose declaration &quot;Give me liberty or give me death!&quot; is arguably the most iconic quote of the American Revolution, was an eloquent voice against ratification, his oratorical skills a potent weapon of the Anti-Federalist side in his native state of Virginia.\n\nAnd John Hancock, the Declaration&amp;#039;s first signer, was still another opponent of the new constitution, but later joined with fellow critic Samuel Adams to lead the effort at compromise through which Massachusetts approved ratification, but with many substantial amendments recommended.\n\nJoined by a chorus of notable essayists?writing, in the style of the day, under the pen names &quot;Agrippa,&quot; &quot;Brutus,&quot; or &quot;Cato,&quot; meant to evoke the ideals of Classical Republicanism they favored?the Anti-Federalists formed a potent opposition.\n\nWhich Founders Led the Battle for It ...\n\nOn the other side of the argument, an equally distinguished chorus of voices?led by Alexander Hamilton, James Madison, and John Jay?was raised in support of the proposed constitution.\n\nThey urged that its innovative structure?a structure the Anti-Federalists considered frightening and dangerous?ought to be passed without any substantial amendments. And in The Federalist, the extraordinary collection of polemical papers organized by Hamilton, they presented their side&amp;#039;s answer to the objections raised by the proposed constitution&amp;#039;s opponents.\n\nThe debate that ensued?even while some states ratified the document and others rejected it?raged for the better part of two years. Each side argued to prove and persuade others to their position. And beneath its rhetorical flourishes lay not only the longest and most profound civic argument in our nation&amp;#039;s history, but also a civics lesson that deserves to endure for all time.\n\nAnd How Both Sides Helped Define the Result!\n\nIt was an argument that would result in not only the ratification of the Constitution but also of what that Constitution would become?and the finished document was a testimonial to the contributions of the &quot;victorious&quot; Federalist side and the &quot;losing&quot; Anti-Federalists as well.\n\nWhy were the nation&amp;#039;s planners so divided? What were the concerns that caused so many passionate defenders of American independence to take such different views? And why are the answers so important to us today?\n\nIn addressing these issues?including fervently presented renditions of the great debate&amp;#039;s most illustrious writings and speeches?Professor Pangle brilliantly revives &quot;the great controversy out of which our Constitution was born, so that we ourselves can begin to re-enact, in some degree, the debates and thus the choices?and, more importantly, the arguments for the choices?that were made by the founding generation.&quot;\n\nIn an era when contemporary arguments on the national stage so often mirror the same conflicts debated by the Founders, our own reenactment of that original debate can enrich our ability to be active and participating citizens.\n\n&quot;By listening to the original critics of the Constitution,&quot; Professor Pangle notes, &quot;and by seeing how the defenders are responding to those critics, we will have better access to the age-old, deeply puzzling problems in the very nature of Republicanism with which our founders were wrestling and trying to solve. We can see precisely what dangers this new Constitution was meant to combat and what it was designed to achieve.\n\n&quot;But also, and equally important, we can see what our constitutional system was not designed to achieve, what alternative concerns and goals of political life were abandoned or subordinated, what costs were consciously paid, what limitations were accepted in opting for this ... new system.&quot;\n\n==========\n\nPlease support The Teach Company by purchasing their lecture series at www.teach12.com. \n","torrent":{"xt":"urn:btih:434f173c0db9787801fd1c3cba4f0e0b99fda289","amp;dn":"TTC+-+Great+Debate+-+Advocates+and+Opponents+of+the+American+Con","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"434f173c0db9787801fd1c3cba4f0e0b99fda289","infoHashBuffer":{"type":"Buffer","data":[67,79,23,60,13,185,120,120,1,253,28,60,186,79,14,11,153,253,162,137]},"announce":[],"urlList":[]}}