{"title":"Mestro DVD Extras","uid":3373181,"size":2015475712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:43d84aa19b5fcb6cfcae1d4d6c766ba288ca5a06&amp;dn=Mestro+DVD+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"huina","files":7,"time":1124730910,"description":"Maestro, a feature documentary 4 years in the making, tells the story of how a group of people found refuge and a call for life outside the mainstream, what evolved was a scene that set the ground work for what was to come in dance music culture worldwide, a rare insight into the secret underground world. It's the first time this story is told in a motion Picture, included in the film are pioneer dance music DJs and producers, &quot;founding fathers&quot;, its center being Larry Levan, as well as high-profile DJs of today. Most film documents of this historical movement have fallen short of its true story and impact to the world, providing us with a glossed over account of the time. Opting for a more personal and candid approach, MAESTRO shows the true history of the people through a realistic creative aesthetic. Tracing the underground's dance origin, MAESTRO brings out a real understanding of this intense lifestyle, and the lives they lived and died for. It is far from mere nostalgia, this film is like the music and experiences it chronicles.\n\nDVD Extras: conversations with Tee Scott &amp; Frankie Knuckles, dancer, inside the paradise garage footage, making of maestro, ron hardy a chicago master and sound systems (david mancuso, ...).","torrent":{"xt":"urn:btih:43d84aa19b5fcb6cfcae1d4d6c766ba288ca5a06","amp;dn":"Mestro+DVD+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43d84aa19b5fcb6cfcae1d4d6c766ba288ca5a06","infoHashBuffer":{"type":"Buffer","data":[67,216,74,161,155,95,203,108,252,174,29,77,108,118,107,162,136,202,90,6]},"announce":[],"urlList":[]}}