{"title":"Final.Fantasy.8.VIII.PSX.PAL","uid":3350506,"size":1803632529,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:44e9af45f79d268df3a3c6240dcae5201d7298cf&amp;dn=Final.Fantasy.8.VIII.PSX.PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"patrikzidane","files":1,"time":1120140200,"description":"This is Final Fantasy 8 (VIII) for PSX, enjoy it and here is a guide on how to play it on your computer:\n\nif u have anyproblem with setting up your video configuration here is a GREAT site that tells u what config u should have on a specific game: http://www.lordkane.co.uk/\n\n1. To unzip the 7z file download the 7-Zip here http://www.7-zip.org/\n\n2. Now you can either burn it or mount it. I will describe how u can mount it. If you want to burn it u need to do it on your own.\n\n3. When it is unziped u need to get Daeomon Tools so u can mount the image, get it here http://www.daemon-tools.cc/dtcc/portal/download.php\n\n4. When the image is mounted u need to play it in a PSX emulator, i suggest ePSXe, thats the best one, get it here http://www.epsxe.com/download.php\n\n5. To use the PSX emulator u need to get a BIOS file, search the internet or other p2p networks to find it, it is called SCPH1001.BIN and is about 0,5 MB big\n\n6. In order to play this game u need to install some plugins, download and install/extract these plugins in the plugins folder:\n\t\n\t6.1 Pete's Video plugin, for best video, get it here http://www.ngemu.com/download.php?action=plugin&amp;id=7\n\t6.2 Pete's Sound plugin, for best sound, get it here http://www.ngemu.com/download.php?action=plugin&amp;id=23\n\t6.3 Pete's CD plugin, get it here http://www.ngemu.com/download.php?action=plugin&amp;id=35\n\t6.4 Input plugin, get it here http://www.ngemu.com/download.php?action=plugin&amp;id=52\n\n7. After installing the plugins start up ePSXe go through the install wizard step by step\n\t\n\t7.1 Video, choose Pete's video plugin for your graphic card, then press Config and then press the &quot;Nice&quot; button at the button to get good settings that works good with these FF games\n\t7.2 if u dont want to play in full screen u can change that at the top by choosing window mode\n\t7.3 Choose Pete's Sound plugin and press next, dont need to change any config.\n\t7.4 Choose Pete's CD plugin (P.E.Op.S. CDR Driver 1.4) and press config, Select your interface at the top, if u have W2K or XP choose the raw reading one. then select what drive the game is mounted in and press ok\n\t7.5 finally change the controllers or keep them as they are, u decide..\n\n8. To load the mounted image just press File and then Run CDROM. if u want to load a real ps cd that u have in your drive u need to change the drive in Pete's CD plugin (P.E.Op.S. CDR Driver 1.4) to the specific drive.\n\n9. thats all, hope it works, if u bump in to any problems, just post it here and ill try to help.","torrent":{"xt":"urn:btih:44e9af45f79d268df3a3c6240dcae5201d7298cf","amp;dn":"Final.Fantasy.8.VIII.PSX.PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44e9af45f79d268df3a3c6240dcae5201d7298cf","infoHashBuffer":{"type":"Buffer","data":[68,233,175,69,247,157,38,141,243,163,198,36,13,202,229,32,29,114,152,207]},"announce":[],"urlList":[]}}