{"title":"Super Hits Of The Seventies Vol 11","uid":3347570,"size":91867136,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:453407a3e1e0a31acd8ca67ab3ed65a656435bb7&amp;dn=Super+Hits+Of+The+Seventies+Vol+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"boogazm","files":12,"time":1119484406,"description":"As Rhino has done throughout its Have A Nice Day series, this is an interesting look at the Seventies as presented by artists of the era whose fame was short-lived. The compilers at Rhino assume you already have Stevie Wonder, Elton John, Chicago and Paul McCartney in your music library. So they have filled in the gaps with a collection of mostly one-and two-hit wonders. [Only Gilbert O'Sullivan and Charlie Daniels reached the Top 10 more than once!]\n\nNot that there aren't plenty of big hits here. Five of these songs were million-sellers: The lightweight pop smash &quot;Playground in My Mind,&quot; the POSEIDON ADVENTURE theme &quot;Morning After,&quot; the country-crossover &quot;Funny Face,&quot; the usually maudlin Gilbert O'Sullivan gets funky with &quot;Get Down&quot; and the banjo-guitar duet from DELIVERANCE &quot;Dueling Banjos.&quot;\n\nFor me, the treats of volume 11 are the topical humor of Charlie Daniels' hilarious &quot;Uneasy Rider&quot; and the melancholy of Jud Strunk's &quot;Daisy a Day. [Strunk is probably best remembered as a former cast member of &quot;Laugh-In.&quot;]\n\nSeveral of these tracks, however, weaken the overall impact of the collection. &quot;Big City Miss Ruth Ann&quot; was Gallery's last gasp in the Top 40 before becoming candidates for &quot;Where are they now?&quot; trivia. El Chicano's &quot;Tell Her She's Lovely&quot; spent one week at No. 40 before dropping off the chart entirely. Still, that was a better chart performance than Albert Hammond's &quot;Free Electric Band.&quot; Songs like these didn't enter the American musical conscience thirty years ago, why bring them back now? It would have made more sense to include such 1973 hits as Sweet's &quot;Little Willy,&quot; Billy Preston's &quot;Space Race,&quot; or Loggins &amp; Messina's &quot;Your Mama Don't Dance.&quot;\n\nOverall, there's enough big hits here to make the set interesting, but enough duds to keep this from being truly essential.","torrent":{"xt":"urn:btih:453407a3e1e0a31acd8ca67ab3ed65a656435bb7","amp;dn":"Super+Hits+Of+The+Seventies+Vol+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"453407a3e1e0a31acd8ca67ab3ed65a656435bb7","infoHashBuffer":{"type":"Buffer","data":[69,52,7,163,225,224,163,26,205,140,166,122,179,237,101,166,86,67,91,183]},"announce":[],"urlList":[]}}