{"title":"The_Christmas_Blessing.DVDRip.Xvid.avi","uid":3923982,"size":732688622,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:458d793a6f03c8ef3fa34f7f8f8319e6884cfbd4&amp;dn=The_Christmas_Blessing.DVDRip.Xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RomanticNFun1","files":1,"time":1196972429,"description":"In this sequel to \\\\\\&amp;#039;The Christmas Shoes\\\\\\&amp;#039;, attorney Robert Layton (Rob Lowe) finds the shoes that changed his life in a dumpster at a church, where people deposit clothes for the poor.\n\nNathan Andrews (Neil Patrick Harris) is grown up now. As a young surgeon, when Nathan loses a patient, he says, \\\\\\&quot;I can\\\\\\&amp;#039;t do this any more\\\\\\&quot; and returns home. He works in the garage run by his father Jack (Hugh Thompson), where he meets Megan (Rebecca Gayheart). Megan needs for her car to be fixed and, since she is learning Spanish, pretends that is all she speaks. Of course, Nathan is also deceiving Megan by pretending to be a mechanic. Lydia (Wanda Cannon) does Jack\\\\\\&amp;#039;s office work and gives out advice.\n\nThe shoes end up in the possession of Tucker Bennett (Shaun Johnston), who moves around a lot and does yard work. He doesn\\\\\\&amp;#039;t want to tell his son Charlie (Angus T. Jones) the truth about what happened to the boy\\\\\\&amp;#039;s mother, who he claims was a dancer and wore the shoes.\n\nMegan turns out to be Charlie\\\\\\&amp;#039;s teacher. And Charlie has some difficulty as the new kid in school. Nathan shows up to volunteer at the playground where Charlie goes after school, and the two become friends. Also at the playground, Megan meets Nathan once again (can you guess where this might be going?).\n\nThree characters in the movie go through crisis. For two, the situation may be life-threatening. A miracle may be necessary for everyone\\\\\\&amp;#039;s problems to be solved. Sadly, the movie does not end well for all, but the ending is satisfying.\n\nThis is generally a pleasant family movie, even if the circumstances are not always positive. Neil Patrick Harris does a good job, and his best moments are in scenes with Angus T. Jones. Angus shows much of the same charm that he displays when playing live-action TV\\\\\\&amp;#039;s most adorable brat on \\\\\\&amp;#039;Two and a Half Men\\\\\\&amp;#039;. And Rebecca Gayheart stands out as the devoted teacher. Rob Lowe appears in only a few scenes but does quite well with them.","torrent":{"xt":"urn:btih:458d793a6f03c8ef3fa34f7f8f8319e6884cfbd4","amp;dn":"The_Christmas_Blessing.DVDRip.Xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"458d793a6f03c8ef3fa34f7f8f8319e6884cfbd4","infoHashBuffer":{"type":"Buffer","data":[69,141,121,58,111,3,200,239,63,163,79,127,143,131,25,230,136,76,251,212]},"announce":[],"urlList":[]}}