{"title":"Parama: An Aaprna Sen Movie (Bengali)","uid":3986146,"size":1027651362,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:462a9a5d200279c21db6389e6e84668b1a68f1fa&amp;dn=Parama%3A+An+Aaprna+Sen+Movie+%28Bengali%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mainak1985","files":1,"time":1200824136,"description":"Paroma\n\nDirected by Aparna Sen\n\nRelease Date: January 1, 1985\n\nRuntime: 134 minutes\n\n\nI would highly recommend this to all of you, not for it cinematographic qualities but for a very taboo topic handled in a great manner. The Bengalis amongst y&amp;#039;all might appreciate it even more as the culture portrayed is urban upper middle class Bengali. Reportedly, the movie caused a big uproar amongst the upper middle class in Calcutta but surprisingly, also found many sympathisers. The movie is about a traditional middle-aged Bengali housewife (played by Rakhi) who has an affair with a young NRI on vacation in India. One of the interesting points in the movie, I found, was the ease with which Rakhi&amp;#039;s college going daughter ridicules her (Rakhi&amp;#039;s) traditional, dependent lifestyle but at the same time, fails to understand and/or sympathize with the mother when she tries to seek her freedom. I thought that there was a parallel between this and &quot;Joy Luck Club&quot; in that respect. I am not sure if I could pin-point the parallelism but it seemed that in both movies, they show how easy it is to *sound* and believe oneself to be independent and liberated (as in the case of the daughters in both movies who grow up in less constricting surroundings) as opposed to *acting* on such beliefs, which more often than not, require a higher level of retrospection, strength and maturity.","torrent":{"xt":"urn:btih:462a9a5d200279c21db6389e6e84668b1a68f1fa","amp;dn":"Parama%3A+An+Aaprna+Sen+Movie+%28Bengali%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"462a9a5d200279c21db6389e6e84668b1a68f1fa","infoHashBuffer":{"type":"Buffer","data":[70,42,154,93,32,2,121,194,29,182,56,158,110,132,102,139,26,104,241,250]},"announce":[],"urlList":[]}}