{"title":"The Adventures Of Ichabod And Mr. Toad.avi","uid":3759355,"size":423617536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47ae1a31c6002711fa05cc74ba3a29d8a9590320&amp;dn=The+Adventures+Of+Ichabod+And+Mr.+Toad.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"whoruchittin","files":1,"time":1185959733,"description":"The Adventures of Ichabod and Mr. Toad\n\nTheatrical Release: October 5, 1949 / Running Time: 68 Minutes / Rating: G\n\nDirectors: Clyde Geronimi, Jack Kinney, James Algar\n\nVoice Cast: Basil Rathbone (Narrator, &quot;The Wind in the Willows&quot;), Bing Crosby (Narrator &amp; characters, &quot;The Legend of Sleepy Hollow&quot;), Eric Blore (J. Thaddeus Toad), J. Pat O&amp;#039;Malley (Cyril Proudbottom), Claud Allister (Rat), Colin Campbell (Mole), Campbell Grant (Angus MacBadger), Alec Harford (Winkie), John McLeish (Prosecutor)\n\nSongs: &quot;The Merrily Song&quot; - performed by Eric Blore &amp; Pat O&amp;#039;Malley; &quot;Ichabod&quot;, &quot;Katrina&quot;, and &quot;The Headless Horseman&quot; - performed by Bing Crosby and the Rhythmaires\n\n\nThough The Adventures of Ichabod and Mr. Toad contains two half-hour films, it is more of a return to the top form of Disney&amp;#039;s early &amp;#039;40s animated features than it is another anthology feature like the five package features that directly preceeded it.\n\nIchabod and Mr. Toad is two excellent films in one.\n\nMr. Toad and Cyril Proudbottom J. Thaddeus Toad, Esq. in &quot;The Wind in the Willows&quot;\n\nThe first, &quot;The Wind in the Willows&quot;, is based on Kenneth Grahame&amp;#039;s novel, and narrated by Basil Rathbone. With its nonlinear narrative and witty depiction of adult characters, it&amp;#039;s a unique Disney work.\nAt the center of the story is the charismatic J. Thaddeus Toad, Esq., a happy-go-lucky upper class amphibian who believes in fun and adventure, but has built a great deal of debt from disregarding the financial responsibilities of his various manias.\n\nHis manias define his character, and it is his latest fancy -- the automobile -- that puts him on trial; Toad is accused of stealing a car. Having cut to his arrest from scenes of Toad exuberantly pretending to drive a car to the point where his sensible friends, Rat and Mole, lock him in his room to dissuade this newfound passion, it seems entirely possible that Toad has indeed gone too far.\n\nOn a snowy Christmas Eve night, with Toad glumly sitting by his lonesome in a dungeon-like prison, Toad&amp;#039;s loyal horse Cyril Proudbottom pays a visit and inspires the boisterous J. Thaddeus to escape, which he does. These Christmas sequences possess a warmth and exuberance that is more down-to-earth than the fairy tale tone of most Disney features and more refined than the slapstick cartoon shorts.\n\nThe film progresses as the characters try to determine Toad&amp;#039;s innoncence or guilt, as he is being pursued by the law. It&amp;#039;s a very smart and pleasing short film, with a keen visual sense to its domestic and countryside scenery. In a number of ways, &quot;The Wind in the Willows&quot; is unlike anything else Disney has put to film, which makes it stand out and above from the rest of the films from Walt&amp;#039;s time.\n\nIchabod Crane in &quot;The Legend of Sleepy Hollow&quot;\n\nThe second story is &quot;The Legend of Sleepy Hollow&quot;, Washington Irving&amp;#039;s intriguing tale, aptly narrated by Bing Crosby. It&amp;#039;s fall in the village of Sleepy Hollow, and lanky Ichabod Crane is the new schoolteacher in town. His somewhat odd behaviors make him the ridicule of the rambunctious and robust Brom Bones and his cronies. Either unaware or indifferent to the town&amp;#039;s reaction to him, Ichabod is at ease with his mischevious pupils and speedy metabolism.\n\nThings complicate when Ichabod becomes enamored with Katrina Van Tassel, a priviledged and beautiful young lady who is less than pleased with her primary suitor: Brom Bones. It is Brom, though, whose motives are most clear of the triangle of characters - he clearly wants Katrina&amp;#039;s affections. Ichabod is stimulated by the potential for wealth, besides the striking Katrina&amp;#039;s company. Katrina may or may not be genuinely interested in Ichabod, but she likes the power she holds, keeping both Ichabod and Brom in check.\n\nThings come to a T at the Van Tassel&amp;#039;s annual Halloween party. Ichabod&amp;#039;s invitation to this comes with a personal note from Katrina, and he looks forward to another night of nonchalantly showing up Brom and spending time with young Katrina.\nThe arrogant Brom, though is displeased at the turn of events, and he plots to win back Miss Van Tassel.\n\nAfter a number of insuccessful efforts, Brom decides to take advantage of Ichabod&amp;#039;s belief in superstitions, a characteristic that only now comes to surface in the film. Brom tells the tale of the menacing Headless Horseman who terrorizes people in the forest that Ichabod is planning to ride through on his way home tonight. In spite of his best efforts, Ichabod cannot hide his fear.\n\nIchabod and Mr. Toad fantastically concludes with perhaps the most effectively atmospheric sequence put to film. Ichabod, of course, must face his fears and ride home through the forest, which with his heightened awareness becomes an engulfing conscious nightmare. This sequence works so well because of the subdued, almost non-existent musical score being overpowered by the cacophony of eery nightime sounds of the outdoors. That a animated film can be this chilling may seem remarkable to you, but even the comforting voice of Bing Crosby is distressful here without changing tone or character. It is a delightfully spooky end to a delightfully good pair of short films.\n\nBoth &quot;The Wind in the Willows&quot; and &quot;The Legend of Sleepy Hollow&quot; work perfectly by themselves as literature or separate short films here, which is how they had been issued on video prior to this 2000 Gold Collection release. Nonetheless, they complement each other with their effective adaptation of the written word, their contrasting but equally engaging tones and characters, and their wonderful artwork and composition. It is this last trait that was awarded with a Golden Globe award for Best Cinematography (Color) in 1950. While most disregard the Golden Globes and an award like this may seem inconsequential, I think it&amp;#039;s a noteworthy honor for a noteworthy film that unfortunately has not gotten the recognition it deserves among Disney&amp;#039;s animated canon.","torrent":{"xt":"urn:btih:47ae1a31c6002711fa05cc74ba3a29d8a9590320","amp;dn":"The+Adventures+Of+Ichabod+And+Mr.+Toad.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47ae1a31c6002711fa05cc74ba3a29d8a9590320","infoHashBuffer":{"type":"Buffer","data":[71,174,26,49,198,0,39,17,250,5,204,116,186,58,41,216,169,89,3,32]},"announce":[],"urlList":[]}}