{"title":"Teen Porn Collection 1 [ElgerHz]","uid":3760208,"size":56473843,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:47bdba2dc4da8ab356dd51de78d0b736d9d570d9&amp;dn=Teen+Porn+Collection+1+%5BElgerHz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ElgerHz","files":1,"time":1186022783,"description":"I currently have a LOT of porn on my computer, and in order to make room  for some more, I have to burn some of it to CD/DVD. But before I do that I thought I would take some of the porn and create and uplopad some torrents, starting with the oldest stuff first.\n\nApart from using WinMX for downloading porn, I also used to download the free stuff paysites had to offer. First I did this directly by downloading each picture one by one in Internet Explorer, but since this was a rather ackward and very time consuming task, I started using a program called SiteSearcher instead. \n\nSiteSearcher was a program which quickly could search a website for the files the user was interested in, and then it downloaded them automatically. SiteSearcher could quickly grab the &quot;good stuff&quot; from websites, saving the user the time and effort of searching for it manually. Unfortunately this program had some drawbacks, one thing was that not all files were fully downloaded (leading  to incomplete files),  another thing was that it happened from time to time that html files quite oddly was saved with the jpg extension in the file names. I don&amp;#039;t use Sitesearcher any longer since there are much better alternatives out there, and another thing is that this program is no longer being developed.\n\n\nIncluded here are a collection of the porn I downloaded by using the two methods described above, and it consists of a rag bag mix of 1200 pictures with various sizes and qualities. As a matter of fact, some of the pictures are of such a crap quality that I considered leaving them out, but I decided to include them anyway. If nothing else, they will act as a reminder of what things was like in the time when the majority of people still used 56K analog modems for surfing the net.   \n\nEnjoy!\n\n\nCheck out my other torrents here:  &lt;a href=&quot;\nhttp://www.thepiratebay.se/user/ElgerHz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thepiratebay.se/user/ElgerHz&lt;/a&gt;","torrent":{"xt":"urn:btih:47bdba2dc4da8ab356dd51de78d0b736d9d570d9","amp;dn":"Teen+Porn+Collection+1+%5BElgerHz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47bdba2dc4da8ab356dd51de78d0b736d9d570d9","infoHashBuffer":{"type":"Buffer","data":[71,189,186,45,196,218,138,179,86,221,81,222,120,208,183,54,217,213,112,217]},"announce":[],"urlList":[]}}