{"title":"Deanna Bogart ~ Out to Get You","uid":3995932,"size":99891954,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:47dbf97fa5aeb1547e9e964e65378a1695949ec0&amp;dn=Deanna+Bogart+%7E+Out+to+Get+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"gazzjazz","files":17,"time":1201312737,"description":"This amazing musician marries blues, classical &amp; jazz together well.\nDeanna is sooo underrated internationally.\nI love this album as it not only entertains, but grows &amp; varies in textures\nif you play piano you will certainly grow towards this fantastic selection\n\nI&amp;#039;ve included scanned cover art &amp; mp3&amp;#039;s @ 256 bps\n\nplease do reseed &amp; hunt down Deanna&amp;#039;s albums &amp; if you like them, buy them\n\ncheers GazzJazz\n\nbio &amp; credits:\n\nOUT TO GET YOU\nDeanna Bogart\n(Blind Pig 1991)\n\nPersonnel:\nTimm Biery\nDoug Kemp\nJeff Thomas\nDanny Gatton\nRon Holloway\nJeff Watson\nMac Walter\nBilly West\nDonny Shattenburg\nScott Ambush\nSteve Wolf\nAdditional Singers:\nDixie D. Ballin\nTiny Holmes\nKissie Thomas\nKathy McCabe\nNova Thomas\n\nTracks:\n1. Over Thirty\n2. Thrash Boogie\n3. Three Long Days\n4. All Night Long\n5. Cold Outside\n6. Lay Me Down Slowly\n7. Morning Glory\n8. Good Times\n9. Ethel&amp;#039;s Place\n10. Move Me Baby\n11. Beat Me Daddy (Eight to the Bar)\n12. Honeybee\n\nProduced by Timm Biery, Ed Eastridge, and Deanna Bogart\n\n\n\n\nDown Beat magazine describes Deanna Bogart as &quot;an extravagant entertainer&quot;-- and entertain is what Bogart does best. The Maryland-based blues and boogie pianist / saxophonist combines the energy of 1930&amp;#039;s style boogie piano blues with contemporary blues sounds emanating from places like New Orleans, Chicago and Memphis. &quot;The goal when we play live,&quot; says Bogart, &quot;is to create a fusion of all these different musical styles with the blues and boogie genuinely at the core.&quot;\n\nBogart began to develop her unique style as a sideplayer in Cowboy Jazz, a Maryland-based group that dedicated itself to the sound of 1940?s western swing music. She joined the group at age 21 as vocalist and spent several years learning and playing the cowboy rhythms that are central to western swing. As her musical appetite grew she spent nearly two years playing R&amp;B with the Washington D.C.-based Root Boy Slim. Bogart combined these disparate influences in her own original compositions that blend elements of boogie music with modern jazz and rock. After getting her own band off the ground in 1988, she began playing throughout the mid-Atlantic region and the West Coast, slowly building a following and a reputation. After hundreds of live shows, Bogart made her recording debut in 1989.\nWhereas for years her fans accepted as an article of faith that none of Bogart&amp;#039;s recording ventures could match up to the experience of live performances, that assumption has been transformed since the release of her last two CDs, The Great Unknown and 2002?s Timing is Everything. While home listeners will be deprived the pleasures of Bogart&amp;#039;s peripatetic piano style?these new recordings reflect a decided turning point in Bogart?s writing and playing talents. While continuing to utilize her musical roots in the blues, her musical sensibilities have ventured into other textures, her voice has developed an increasingly emotional force, and her songwriting has expanded into a growing breadth of complexity and lyrical subtlety. A woman who has managed to balance middle-aged single motherhood with the vicissitudes of life leading a successful band for 15 years on the road has now begun to create music that reflects a similar synthesis of the traditional and the non-traditional. Bogart is philosophical about striking out in new directions. ?Nothing hurts creativity like safety? is her credo, ?in art as in life, you can&amp;#039;t have magic if you&amp;#039;re not willing to risk the train wrecks.? Addressing an increasingly broad range of personal subjects and life experiences, Bogart has become much more than a splashy unforgettable performer?she has established herself as a unique artistic spirit.\n\t\n\n\t\nDespite the power of her recordings, Bogart still loves performing live with her band. ?Musicians play for &amp;#039;one of those nights.? For me, that means the moment I?m at the place where all past and present, pain and joy, meet as one. For lack of a better term, I call it ?Deannaland.? And it?s a place that both audiences and other artists never tire of visiting along with her. Bogart has appeared on stage with the likes of BB King, Brian Setzer, Buddy Guy, James Brown, Doctor John, They Might Be Giants, Spyro Gyra, Ray Charles, Bela Fleck and the Flecktones, and the Neville Brothers. The recipient of no less than 20 Washington Area Music Awards?the ?Wammies??her most recent album, Timing is Everything, helped garner her five awards in one year, including Best Blues Vocalist, Best Group, Songwriter of the Year, Song of the Year, and Musician of the Year.\nThe press is equally effusive. Cashbox called Bogart a ?butt-kickin? barrelhouse player that could give a good chase to old Jerry Lee.? Blues Revue gushed that ?A big part of what makes Deanna Bogart such a delight is her vivacious, charismatic live show. Whether displaying dazzling technical skills at the keyboard or playing soulful tenor sax, the ensemble sound Bogart and her band is skintight.? The Washington Post raved about ?her two-fisted turns on piano that radiate plenty of energy and momentum!? Music Monthly delights in Bogart&amp;#039;s ability ?to blend savvy street smarts with an earthy sensuality that is spontaneous from the very minute her music jumps from the speakers.? The Baltimore Sun celebrates how Bogart ?plays the keyboard and sings like nothing you&amp;#039;ve ever heard?but should! Her vocal style is as full of vitality as her piano playing?both are sexy and deep, with unstoppable strength and unflagging energy!?\n\t\n\t\nBogart herself explains that, ?It became clear to me a long time ago that my goal was to be the best player I could be, and that on my death bed at 107, with people I love gathered around me, my last words would be ?Man, what a good gig last night!?\n\nBeyond all the superlatives, The Washington Post may have best described Deanna Bogart with three words: Luster, Sophistication, and Soul. This is a one-of-a-kind artist, whose music veers from the depths of the blues to the playful heights of swing, from the subtleties of jazz to the hard-won grit of soul. She brings to her music everything it means to be a woman?everything it means to be human?and delivers it to every line of music played, every phrase of lyrics written and sung, until the pure truth of her sound and message pierces the heart of her audience. Once you hear her?once you feel her?you will never be quite the same.\n\nThe Deanna Bogart Band since 1995 includes Mike Aubin on drums, and Eric Scott on bass ","torrent":{"xt":"urn:btih:47dbf97fa5aeb1547e9e964e65378a1695949ec0","amp;dn":"Deanna+Bogart+%7E+Out+to+Get+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47dbf97fa5aeb1547e9e964e65378a1695949ec0","infoHashBuffer":{"type":"Buffer","data":[71,219,249,127,165,174,177,84,126,158,150,78,101,55,138,22,149,148,158,192]},"announce":[],"urlList":[]}}