{"title":"DVDr.VANPALA.HEAVY.METAL.Best.Cars.in.the.Entire.World.Ever.Lega","uid":3778802,"size":8375603856,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:48b764db48499911096b2cb85158c5bbacb41b67&amp;dn=DVDr.VANPALA.HEAVY.METAL.Best.Cars.in.the.Entire.World.Ever.Lega&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AutostreamFilms","files":5,"time":1187588753,"description":"DISCONTINUED Please download our latest Legal DVD\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4919140/SuperCar_Extravaganza_-_An_Intelligent__amp__Wicked_Exotic_Car_Revie&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4919140/SuperCar_Extravaganza_-_An_Intelligent__amp__Wicked_Exotic_Car_Revie&lt;/a&gt;\n\n-----------------------------------------------------------------------\n\nLEGAL DOWNLOAD - brought to you by Autostream Films\n\nwebsite: http://autostreamfilms.com\n\nYouTube:\n\nDVD Description:\n\nScott VanPala is back and crazier than ever with the most explosive automotive Mardi Gras you're ever likely to see. (and you definitely should, especially since he's giving it away for FREE )\n \n\nPress Release:\n\n  - Instantly up to speed and powered by that rarest of cinematic fuels -- intelligent action ? ?Scott VanPala - HEAVY METAL? is a manly, irreverent, automotive satire for all ages.  VanPala is back with his second inflammatory DVD to take us on a hunt for the best and worst SUVs by piloting 16 different ones much too quickly up mountains, over rocks, and into lakes like the:\n\nPorsche Cayenne Turbo,\nRange Rover,\nRange Rover Sport, \nHummer H1,\nHummer H2,\nChevrolet Tahoe,\nFord F-150,\nSubaru Outback,\nCadillac Escalade,\nInfiniti FX45,\nMercedes ML430,\nJeep Grand Cherokee,\nand more.\n\nWith a creative flair and without ever being pedantic, VanPala wades through all the media and marketing hype to show us that it is just that, hype.  Who knew that over 80% of all SUVs are just pickup trucks with camper bodies welded on?  Even the biggest names in the business, Lexus, Cadillac, Infiniti, and Mercedes-Benz are not immune from delivering us the charlatans, the dross, and the quacks.\n\nThen we get to the real, honest-to-god, garbage.  The real disasters, the Isuzu Rodeo, the Ford Bronco II, the SUVs that sell in there millions solely based on preconceptions and image.  Here is where VanPala takes a hard and all too often violent look at these abominations.  Most are mocked, some are chastised, but a select few are less lucky as a death sentence is handed down in some of the most creative ways to destroy a car you have ever seen.\n\nFinally, we get to the real purpose of SUVs.  Voicing the cries of enthusiastic motorists who are tired of the constant social attacks on 4x4s and who just want to drive their gas-guzzlers fast and free and with Rush Limbaugh on the radio, VanPala takes us on a high speed, no-holds barred, freedom ride through 11 states in the best SUV in the entire world, ever!\n\n\nQuality         : 100% direct copy\nList Price      : $7 shipped\nAspect Ratio    : 4:3 Letterbox\nSoundtrack      : 5.1 Surround\nDisc Format     : DVD9 - (Dual Layer Blank/Burner Required for download)\nRunning Time    : 1 hour 46min\nColor           : NTSC\nRating          : Unrated\n\nOnce downloaded, follow the instructions inside the Readme.txt.  If you still cannot figure out how to burn to dvd, just pay the $7 and buy the damn thing - It comes with a box and everything, shipped to your door.\n\nAs always, kindness is appreciated with the comments/reviews - we certainly arent getting rich giving this away for free, but more downloads means we can make more, sooner!\n","torrent":{"xt":"urn:btih:48b764db48499911096b2cb85158c5bbacb41b67","amp;dn":"DVDr.VANPALA.HEAVY.METAL.Best.Cars.in.the.Entire.World.Ever.Lega","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b764db48499911096b2cb85158c5bbacb41b67","infoHashBuffer":{"type":"Buffer","data":[72,183,100,219,72,73,153,17,9,107,44,184,81,88,197,187,172,180,27,103]},"announce":[],"urlList":[]}}