{"title":"Tera Patrick Stripping out of Blue Bikini","uid":3990753,"size":5962036,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4a8230cc3b47a3961cc95073b3964c14d5af8227&amp;dn=Tera+Patrick+Stripping+out+of+Blue+Bikini&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bestshare","files":2,"time":1201030556,"description":"Tera Patrick Stripping out of Blue Bikini. This is a Smoking Hot Video. Download it and Enjoy. \n\n\nPlus: eBook which explains How to Get a Free AdultFriendFinder - Full Gold Membership for 1 Month.\n\nHere is a loophole that will give you a free gold membership to the largest\nsex and swingers site in the world.\n\nAdult Friend Finder claims to offer &quot;Free&quot; Memberships, but these &quot;Free&quot; Memberships are worthless as they only allow you to view profile text, and not the photos.\n\nI have however discovered a loophole that will allow you to obtain a full GOLD Membership\n(normally $29.95/mo.) without paying a cent, or even pulling out a credit card.You will get\nFull Access to the Entire - AdultFriendFinder Website.The whole process takes about 10 minutes\nto complete, and is well worth it.\n\n--------------------------------------------------\n\nAdult FriendFinder\nis the world&amp;#039;s largest adult sex and swingers site! You can find new hookups with the hottest singles and wildest couples. Whether you&amp;#039;re looking for sex chat, nude webcams, swinger action, group sex or adult personals, you&amp;#039;ll get it on Adult FriendFinder. Turn your wildest fantasies into reality. Join today and make love tonight. Check out All the New Features, You get for Free.\n\n\nPrivate Call:\nAdult FriendFinder PrivateCall lets you talk on the phone for free with other members without trading phone numbers!\n\n\nWebcam Chat:\nWant to get the attention of other Adult FriendFinder members? Broadcast your Webcam live! Show them the REAL you.\n","torrent":{"xt":"urn:btih:4a8230cc3b47a3961cc95073b3964c14d5af8227","amp;dn":"Tera+Patrick+Stripping+out+of+Blue+Bikini","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a8230cc3b47a3961cc95073b3964c14d5af8227","infoHashBuffer":{"type":"Buffer","data":[74,130,48,204,59,71,163,150,28,201,80,115,179,150,76,20,213,175,130,39]},"announce":[],"urlList":[]}}