{"title":"Folge 48 Columbo - Black Lady (divX6, TV-RIP, german) [by Salomo","uid":3354402,"size":632674304,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:4bd76d30455cb6ac74a52bb78e1a4c563f3982ee&amp;dn=Folge+48+Columbo+-+Black+Lady+%28divX6%2C+TV-RIP%2C+german%29+%5Bby+Salomo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Salomon2802","files":1,"time":1120996489,"description":"Original: Columbo: Sex and the married detective\n\nLieutenant Columbo wird zur Allenby-Sex-Klinik gerufen, wo David Kincaid, ein Teilhaber der Klinik, ermordet aufgefunden wurde. Schnell findet der clevere Ermittler heraus, dass David mit der Leiterin der Klinik, der bekannten Sexualtherapeutin Dr. Joan Allenby, ein Verh&amp;auml;ltnis hatte. Doch sie war nach eigener Aussage an diesem Abend nicht in der Klinik. Dies klingt glaubhaft, denn Columbo findet heraus, dass Kincaid den Abend mit einer in einen tiefschwarzen Anzug gekleideten Dame verbracht und sie auch in die Klinik mitgenommen hat. Der Name der geheimnisvollen 'Black Lady' soll Lisa sein, aber niemand kennt sie n&amp;auml;her. Columbo ist verwirrt, als Davids Schl&amp;uuml;ssel inseinem Auto gefunden werden, das vor einer Bar - weit entfernt von der Klinik - abgestellt war. Wie ist David ohne Schl&amp;uuml;ssel in Begleitung einer Unbekannten in das Therapiezentrum gelangt? Eine weitere &amp;Uuml;berraschung erlebt Columbo, als bei seinen Nachforschungen in der Klinik gleich drei Besch&amp;auml;ftigte ihn mit intimen Details &amp;uuml;ber das Liebesleben von Kincaid versorgen, aber gleichzeitig betonen, dass sie ihn nicht umgebracht haben. Als eine ganz in schwarz gekleidete Frau in verschiedenen Bars nach Inspektor Columbo sucht, ist der der L&amp;ouml;sung des Falles schon ganz nahe..","torrent":{"xt":"urn:btih:4bd76d30455cb6ac74a52bb78e1a4c563f3982ee","amp;dn":"Folge+48+Columbo+-+Black+Lady+%28divX6%2C+TV-RIP%2C+german%29+%5Bby+Salomo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bd76d30455cb6ac74a52bb78e1a4c563f3982ee","infoHashBuffer":{"type":"Buffer","data":[75,215,109,48,69,92,182,172,116,165,43,183,142,26,76,86,63,57,130,238]},"announce":[],"urlList":[]}}