{"title":"Arthur &amp; Yu - In Camera [2007]","uid":3991354,"size":50481152,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4cc9830e3886f72f6def02214b2f98e89c0a2d12&amp;dn=Arthur+%26+Yu+-+In+Camera+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"torcano","files":10,"time":1201050491,"description":"Arthur &amp; Yu \nIn Camera \n[Hardly Art; 2007]\nRating: 7.4 \n\nArthur &amp; Yu&amp;#039;s debut LP, In Camera (the inaugural release for Sub Pop&amp;#039;s new imprint, Hardly Art) is cute, coy, and a little bit gooey. With twinkling flutes, wide-eyed boy-girl harmonies, and 60s folk-pop melodies, In Camera would be infuriatingly precious if it weren&amp;#039;t also weird, druggy, and mesmerizing. Fronted by Grant Olsen and Sonya Westcott (&quot;Arthur&quot; and &quot;Yu&quot; are their respective childhood nicknames), the Seattle-based duo have doused their songs with a bucket of reverb, and In Camera&amp;#039;s throbbing guitars, muted vocals, and mawkish arrangements sound more like the Velvet Underground and Nico (or Karen Dalton, or Serge Gainsbourg) than anything you&amp;#039;d ever dig up on Twee.net. \n\nVocal duties are split between Olsen and Westcott (who, incidentally, was Rogue Wave&amp;#039;s original bassist), and their voices are nicely complimentary, weaving together almost flawlessly-- Westcott&amp;#039;s pipes are more fixed, whereas Olsen&amp;#039;s voice seems to constantly flit from coo to caterwaul. Still, the juxtaposition of control and chaos works well (critics everywhere have pointed to the pair&amp;#039;s undeniable Lee Hazlewood and Nancy Sinatra dynamic); on &quot;Come to View (Song for Neil Young)&quot;, especially, the vocals crest and wane over jangly guitar and honking melodica, lending a curious layer of psychedlia to an otherwise staid pop song. Bobby Wane, Ben Kersten, and Scott Blue help fill out the group&amp;#039;s sound, but In Camera&amp;#039;s instrumentation-- while rich and beguiling-- ultimately feels secondary to all that singing. \n\nOlsen and Westcott have publicly copped to the little-kid themes on In Camera, from their adopted monikers to the schoolyard/pellet gun musings of &quot;Half Years&quot;, and much of the record has the grainy, nostalgic feel of an old, Super 8 home movie: conjure unsteady montages of toddlers with smeared faces diving onto swingsets, waddling in circles through backyard gardens, pawing at bugs, tugging at their diapers, giggling and eating dirt and hurling their arms around other people&amp;#039;s bare legs. The record does offer up its share of darker moments: the smarmy &quot;Lion&amp;#039;s Mouth&quot; explores burgeoning sexuality via vaguely creepy, nuance-heavy lyrics (&quot;Oh, we coulda kept it fun...My fingers in your buttons,&quot; Olsen mews). \n\nLike the Raveonettes, Jesus and Mary Chain, the Clientele, or My Morning Jacket, how much you dig Arthur &amp; Yu is probably directly proportional to how much reverb you can stomach without wanting to clean out your ears with cotton swabs-- but if you don&amp;#039;t mind a good dosing of echo, In Camera is an impressive debut for both band and label. \n\n-Amanda Petrusich, July 11, 2007, Pitchfork Media","torrent":{"xt":"urn:btih:4cc9830e3886f72f6def02214b2f98e89c0a2d12","amp;dn":"Arthur+%26+Yu+-+In+Camera+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cc9830e3886f72f6def02214b2f98e89c0a2d12","infoHashBuffer":{"type":"Buffer","data":[76,201,131,14,56,134,247,47,109,239,2,33,75,47,152,232,156,10,45,18]},"announce":[],"urlList":[]}}