{"title":"Is the EU the new Soviet Union (Communism,Totalitarianism,Video)","uid":3974061,"size":34359900,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ccaaf0b6611bd49d475c62a7fb586e864ab00ef&amp;dn=Is+the+EU+the+new+Soviet+Union+%28Communism%2CTotalitarianism%2CVideo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BakuninXL","files":3,"time":1200160872,"description":"EU a democracy? Listen to Vladimir Bukovsky who spent many years in Russian labour camps and psychiatric prisons for defending human rights. He lectures and writes on the old Soviet system and the EU.\n\nCentralism always goes on the cost of democracy and freedom, it&amp;#039;s a matter of fact that the smaller countries in Europe offer more freedom and are more prosperous than their greater neighbors! Countries like Russia and China on the other hand are paternal regimes of the worst kind!\n\nFreedom and independence for Europe and it&amp;#039;s people! We Europeans like it to be diverse! We do not want to become an indifferent mix-race just having one language and no culture like Russia, China, or the Americans!\n\nEU = Communism!\n\nCommunism = Totalitarisn shit!\n\nMany believe that communism is a political/economical system, but that&amp;#039;s just a small part of the truth, communism is a mean to destroy states, culture and racial hagemony, and that&amp;#039;s exatly what happened in the first Soviet union.\n\nFor their one world desporism to become reality, they have to brake our roots, the foundation of our existence. Breaking up the roots of our existence, to unite the world under their despotism, is what communism and multiculturalism are all about.\n\n\nBut hey, the wonderland fantasy is more enjoyable! Let&amp;#039;s just all close our minds! Everything is fine! Bush is a man of peace and the future will be wonderful! The new Soviet union will be wonderful! Communims is wonderful! Everything will be just wonderful!\n","torrent":{"xt":"urn:btih:4ccaaf0b6611bd49d475c62a7fb586e864ab00ef","amp;dn":"Is+the+EU+the+new+Soviet+Union+%28Communism%2CTotalitarianism%2CVideo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ccaaf0b6611bd49d475c62a7fb586e864ab00ef","infoHashBuffer":{"type":"Buffer","data":[76,202,175,11,102,17,189,73,212,117,198,42,127,181,134,232,100,171,0,239]},"announce":[],"urlList":[]}}