{"title":"Storm Hawks 119 Infinnity [ThV]","uid":3876893,"size":184026571,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4dae4f61bd7bd2a616c17a5617b1d406e1ce16ef&amp;dn=Storm+Hawks+119+Infinnity+%5BThV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lebang","files":2,"time":1194449257,"description":"Series Informaion:\nToo young for fear, or a pilot?s license, the Storm Hawks love nothing more than cruising the skies on the lookout for adventure (well, except for Stork, who would really rather stay on the Condor, thank you).\nLed by Aerrow, one of the most naturally gifted Sky Knights in the Atmos, Piper, Finn, Junko, Stork and Radarr are on a mission to protect the innocent and strike back at oppression?and if that means thwarting Master Cyclonis?s evil plans and humiliating the sinister Dark Ace, so much the better. Armed with high-octane transforming flying motorcycles, these punks are ready and willing to dog-fight some of the nastiest villains to ever hit the skies.\nThe Sky Knight council may not recognize their official status, but that won?t keep the Storm Hawks from their dangerous quest to save the world of Atmos one terra at a time. And they?ll send anyone who dares try and clip their wings into a serious tailspin!\n\nEpisode Informaion:\nInfinnity\nOne Finn is plenty, but an entire Condor-full? That?s what happens when Finn accidentally sets off a crystal that creates dozens of brand new Finns, each one exactly like the next. But when Snipe gets his hands on it, the Storm Hawks quickly put those Finns to work against a growing army of Snipes!\n","torrent":{"xt":"urn:btih:4dae4f61bd7bd2a616c17a5617b1d406e1ce16ef","amp;dn":"Storm+Hawks+119+Infinnity+%5BThV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dae4f61bd7bd2a616c17a5617b1d406e1ce16ef","infoHashBuffer":{"type":"Buffer","data":[77,174,79,97,189,123,210,166,22,193,122,86,23,177,212,6,225,206,22,239]},"announce":[],"urlList":[]}}