{"title":"Intelligence.202.hq.xvid.avi","uid":3879472,"size":471066624,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ea1dd646583f9b9ff493799973898431a139b78&amp;dn=Intelligence.202.hq.xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EricG","files":1,"time":1194589549,"description":"The show centres on Jimmy Reardon (Tracey), one of Vancouver&amp;#039;s top organized\ncrime bosses, and Mary Spalding (Scott), the director of the Vancouver Organized\nCrime Unit (OCU), who has offered Reardon immunity from prosecution in exchange\nfor his role as a police informant. The show also stars Matt Frewer as Ted\nAltman, the scheming assistant director of the OCU who seeks to replace\nSpalding, and John Cassini as Ronnie Delmonico, Reardon&amp;#039;s business partner and\nconfidant.\n\nThe show&amp;#039;s cast also includes Tom McBeath, John Mann, and David Green as CSIS\ndirectors; Eugene Lipinski and Andrew Airlie as colleagues of Spalding; and\nBernie Coulson and Camille Sullivan as Reardon&amp;#039;s brother and ex-wife.\n\nReardon and Spalding are parallel characters working together on opposite sides\nof the law. Both have followed in the family footsteps, and both face threats\nfrom others trying to derail their careers. Reardon represents the 3rd\ngeneration of his west coast crime family, that began with his prohibition era\nbootlegging grandfather. Conversely, Spalding has her roots as the daughter of\nan ex-army intelligence officer. Spalding must constantly watch herself against\nthe conniving Assistant Director Altman who is after her position, and the old\nschool CSIS Regional Director Deakins, for whose job she is the leading\ncandidate. For Reardon, it is the Disciples (Outlaw Motorcycle Club), led by\nDante Ribiso (Fulvio Cecere), whose aim is to control the whole of Vancouver&amp;#039;s\nmarijuana trade and ABM money laundering industry.","torrent":{"xt":"urn:btih:4ea1dd646583f9b9ff493799973898431a139b78","amp;dn":"Intelligence.202.hq.xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ea1dd646583f9b9ff493799973898431a139b78","infoHashBuffer":{"type":"Buffer","data":[78,161,221,100,101,131,249,185,255,73,55,153,151,56,152,67,26,19,155,120]},"announce":[],"urlList":[]}}