{"title":"Ghostbusters 1 &amp; 2 (Multisubs Multilang PAL) DVD9","uid":3770858,"size":13742047232,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4f293c0db521b61bdceaf52086a997188c2b296f&amp;dn=Ghostbusters+1+%26+2+%28Multisubs+Multilang+PAL%29+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ubehage","files":2,"time":1186931431,"description":"Ghostbusters 1 &amp; 2 (Multisubs Multilang PAL)\n--------------------------------------------\n\n\nGhostbusters 1 (1984)\n---------------------\n&quot;Who ya gonna call? Ghostbusters!&quot;\n\nIMDB: http://imdb.com/title/tt0087332/\n\nAudio: English, German, Italian, Spanish\n\nSubs: Arabic, Bulgarian, Croatian, Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hebrew, Hungarian, Icelandic, Italian, Norwegian, Polish, Portuguese, Romanian, Spanish, Swedish, Turkish\nEnglish for hearing disabled\n\nExtras:\n- Film Makers Commentary\n- Featurette\n- Storyboards\n- Photo gallery\n\n\nPlot outline:\nPeter Venkman, Ray Stantz, and Egon Spengler are three scientists at Columbia University in New York City. When their grant expires, the guys are fired and they go into business as a ghost extermination company called &quot;Ghostbusters&quot;. Their first customer is orchestra cello player Dana Barrett, who was scared out of her apartment on the 22nd floor of a high rise apartment building on Central Park West. It seems that Dana&amp;#039;s neighbor, Louis Tully, is also being affected by the strange happenings in the apartment building. Armed with proton guns, the Ghostbusters become wildly popular, and they are joined by Winston Zeddmore, who is looking for a job with good pay. Overzealous Environmental Protection Agency (EPA) agent Walter Peck thinks the Ghostbusters are frauds, and he has the Ghostbusters put in jail. Peck is forced to believe the Ghostbusters when New York City is put under siege by an ancient Sumerian God named Gozer the Gozerian, who is channeled through the apartment building that Dana and Louis live in, and the mayor has no choice but to let the Ghostbusters out of jail to face Gozer\n\n\n\nGhostbusters 2 (1989)\n---------------------\n&quot;Guess who&amp;#039;s coming to save the world again?&quot;\n\nIMDB: http://imdb.com/title/tt0097428/\n\nAudio: English, German, Italian, Spanish\n\nSubs: Arabic, Bulgarian, Croatian, Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hebrew, Hungarian, Icelandic, Italian, Norwegian, Polish, Portuguese, Romanian, Spanish, Swedish, Turkish\nEnglish for hearing disabled\n\nExtras:\n- The Real Ghostbusters: Citizen Ghost\n- The Real Ghostbusters: Partner in Slime\n\n\nPlot outline:\nIt&amp;#039;s 5 years after the battle against Gozer. A restraining order has forbidden Peter Venkman, Ray Stantz, Winston Zeddemore, and Egon Spengler from working as Ghostbusters, and as a result, they&amp;#039;ve had to find other jobs. Ray owns a book store called &quot;Ray&amp;#039;s Occult&quot; and performs at children&amp;#039;s birthday parties with Winston, Egon conducts experiments at the institute for advanced theoretical research, Dana Barrett broke up with Peter some time ago before marrying another guy, and Peter now hosts a local TV show called &quot;The World of the Psychic&quot;. Dana, who is now the divorced mother of an 8-month-old baby named Oscar, works in the restoration department at the Manhattan Museum of Art. Strange things start happening when Oscar&amp;#039;s baby carriage takes off by itself with Oscar in it, and it stops in the middle of 1st Avenue. While Dana&amp;#039;s boss, Janosz Poha, is restoring a painting of a 16th-century tyrant named Vigo Von Homburg Deutschendorf, the painting comes to life. Vigo wants to live again by taking over Oscar&amp;#039;s body. Vigo takes complete control of Janosz and orders Janosz to get Dana to cooperate. Janosz also has his own agenda. He wants Dana because he&amp;#039;s in love with her. When Peter, Ray, and Egon try to help Dana, they are arrested and put on trial for violating the restraining order. When the ghosts of the killer Scoleri Brothers show up at the court room, the judge is forced to remove the restraining order against the guys so they can put the Scoleri Brothers in a ghost trap. After this, Peter, Ray, Egon, and Winston re-open Ghostbusters, and mayor&amp;#039;s assistant Jack Hardemeyer tries to slow them down any way he can, because he believes the Ghostbusters are frauds who will hurt the mayor&amp;#039;s chances of becoming the governor of New York. The Ghostbusters and their lawyer, Louis Tully, refuse to be stopped by Jack. When Jack has the Ghostbusters put in the Parkview mental hospital, there is an eclipse and Janosz kidnaps Oscar for Vigo. The mayor wants the Ghostbusters on the job, and when the mayor hears that Jack had the Ghostbusters put in the Parkview mental hospital, he fires Jack and has the Ghostbusters released to try to rescue Oscar from Vigo, and Vigo intends to make it as hard as possible for the Ghostbusters.","torrent":{"xt":"urn:btih:4f293c0db521b61bdceaf52086a997188c2b296f","amp;dn":"Ghostbusters+1+%26+2+%28Multisubs+Multilang+PAL%29+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f293c0db521b61bdceaf52086a997188c2b296f","infoHashBuffer":{"type":"Buffer","data":[79,41,60,13,181,33,182,27,220,234,245,32,134,169,151,24,140,43,41,111]},"announce":[],"urlList":[]}}