{"title":"Arsenic and Old Lace","uid":4012468,"size":1183982716,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4fbece4bbd967f138abc2f68803d0cc808ba5f45&amp;dn=Arsenic+and+Old+Lace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcosau","files":1,"time":1202174615,"description":"Esse Mundo ÃƒÂ© um HospÃƒÂ­cio\nTÃƒÂ­tulo Original: Arsenic and Old Lace  \nDireÃƒÂ§ÃƒÂ£o:Frank Capra \nAno:1944 \nPaÃƒÂ­s:Estados Unidos \nGÃƒÂªnero:ComÃƒÂ©dia, Thriller \nIdioma:InglÃƒÂªs\nLegenda: PortuguÃƒÂªs - BR\nDuraÃƒÂ§ÃƒÂ£o:118 min. / p&amp;b\n\n\n\nElenco\nCary Grant (Mortimer Brewster)\nJosephine Hull (Tia Abby Brewster)\nJean Adair (Tia Martha Brewster)\nRaymond Massey (Jonathan Brewster)\nPeter Lorre (Dr. Einstein)\nPriscilla Lane (Elaine Harper)\nJohn Alexander (Theodore Brewster)\nJack Carson (Patrick O&amp;#039;Hara)\nJohn Ridgely (Oficial Saunders)\nEdward McNamara (Policial Brophy)\nJames Gleason (Tenente Rooney)\nGrant Mitchell (Reverendo Harper)\nEdward Everett Horton (Sr. Witherspoon)\nVaughan Glaser (Juiz Cullman)\nChester Clute (Dr. Gilchrist)\n\nSinopse\nBrooklyn, Nova York, 1941. Em uma pequena casa prÃƒÂ³xima a um cemitÃƒÂ©rio vivem duas gentis e doces senhoras, Martha (Jean Adair) e Abby Brewster (Josephine Hull), que desenvolveram um pÃƒÂ©ssimo hÃƒÂ¡bito: matar velhos solitÃƒÂ¡rios. Elas acreditam que isto seja um ato de caridade com suas vÃƒÂ­timas. O sobrinho delas, Mortimer (Cary Grant), um crÃƒÂ­tico dramÃƒÂ¡tico que nÃƒÂ£o tem a menor idÃƒÂ©ia dos &quot;atos humanitÃƒÂ¡rios&quot; de suas tias, tenta discretamente conseguir um licenÃƒÂ§a de casamento para se casar com Elaine Harper (Priscilla Lane). Martha e Abby resolveram o problema de sumir com os corpos iludindo um sobrinho pirado, Teddy (John Alexander), que pensa que ÃƒÂ© Teddy Roosevelt, pois dizem para ele que vai para o PanamÃƒÂ¡ cavar outra &quot;comporta&quot; para o canal. Esta &quot;comporta&quot; fica no porÃƒÂ£o e lÃƒÂ¡ os corpos sÃƒÂ£o enterrados. \n\nMortimer e Elaine chegam, dizendo que jÃƒÂ¡ estÃƒÂ£o casados. Pensando em agradar o sogro (Grant Mitchell), um reverendo que foi contra este casamento, Abby e Mortimer tentam achar as anotaÃƒÂ§ÃƒÂµes do seu prÃƒÂ³ximo livro. Em um breve instante que Abby deixa seu sobrinho sozinho na sala ele abre uma arca e encontra um corpo. Inicialmente acha que o responsÃƒÂ¡vel ÃƒÂ© Teddy, assim comunica o fato para as suas tias. Mas elas, com toda a calma do mundo, lhe explicam que Teddy nÃƒÂ£o teve nada com isto e sim elas, que puseram veneno no vinho. Mortimer estÃƒÂ¡ totalmente confuso e espantado com as declaraÃƒÂ§ÃƒÂµes, mas elas explicam que fizeram isto pois o defunto era um homem solitÃƒÂ¡rio e agora nÃƒÂ£o sofrerÃƒÂ¡ mais. Mortimer fica sabendo que este ÃƒÂ© o 12Ã‚Âº corpo a ser enterrado no porÃƒÂ£o. Elaine aparece ansiosa para viajar em lua-de-mel, mas esta nÃƒÂ£o ÃƒÂ© mais a prioridade de Mortimer.\n\nTamanho:1129mb\nVideo: 352x288\n       25 Quadros\n       136kbps   \t\nAudio:Mpeg1\n      224kbps\t\nFormato: MPG\nLegenda: PortuguÃƒÂªs - BR\nRelease:ARSENIC &amp; OLD LACE\n\nCriticas:\n\n\nEntre tantas comÃƒÂ©dias e dramas que Frank Capra dirigiu, esta ÃƒÂ© uma de suas menos conhecidas. \n\nPelo menos aqui no Brasil. LÃƒÂ¡ fora, Arsenic and Old Lace (referenciar o nome original ÃƒÂ© muito mais interessante) ÃƒÂ© um filme bastante assistido do diretor. Trata-se de uma comÃƒÂ©dia de humor negro baseada em uma peÃƒÂ§a de teatro (algo que estava em voga nos anos 1940), com Cary Grant alavancando o elenco. Ele ÃƒÂ© sobrinho de duas senhoras idosas meio amalucadas que tÃƒÂªm como mania matar velhinhos solitÃƒÂ¡rios por caridade e enterrÃƒÂ¡-los em seu porÃƒÂ£o.\n\nCary Grant exerce todo seu poder cÃƒÂ´mico nesse papel. Muitas caras e bocas, algumas \n\nexageradas e sem graÃƒÂ§a; outras quase hilariantes, provando a versatilidade desse que sempre serÃƒÂ¡ um dos grandes atores que Hollywood jÃƒÂ¡ concebeu. O filme passa-se quase que totalmente dentro da casa das duas senhoras e em um sÃƒÂ³ dia, nÃƒÂ£o negando em nenhum momento sua origem teatral - hÃƒÂ¡ uma sequÃƒÂªncia inicial no cartÃƒÂ³rio, onde Mortimer, o personagem de Grant, casa-se com Elaine (a linda Priscilla Laine, em papel bastante limitado).\n\nHÃƒÂ¡ tambÃƒÂ©m uma gama de personagens secundÃƒÂ¡rios, fazendo do roteiro uma verdadeira suruba. Os diÃƒÂ¡logos ÃƒÂ¡geis nem sempre sÃƒÂ£o interessantes, e o humor, obviamente, ÃƒÂ© bastante inocente, ainda que tratando-se da morte. Mas todos os coadjuvantes tÃƒÂªm sua vez, desde as duas tias (personagens meio irritantes, mas necessÃƒÂ¡rias para justificar a bagunÃƒÂ§a toda) atÃƒÂ© o &quot;mÃƒÂ©dico e o monstro&quot; - o inesquecÃƒÂ­vel vampiro de Dusseldorf, Peter Lorre, fazendo papel de mÃƒÂ©dico, enquanto o &quot;monstro&quot;, uma homenagem explÃƒÂ­cita a Boris Karloff, foi feito por Raymond Massey.\n\nIsso nÃƒÂ£o ÃƒÂ© tudo. HÃƒÂ¡ os policiais, o irmÃƒÂ£o tambÃƒÂ©m amalucado de Mortimer e o taxista que sÃƒÂ³ quer receber o dinheiro da corrida. O ritmo, como jÃƒÂ¡ foi dito, ÃƒÂ© incessante, nÃƒÂ£o pÃƒÂ¡ra em nenhum momento. HÃƒÂ¡ novas situaÃƒÂ§ÃƒÂµes acontecendo e outras se revitalizando o tempo todo. A polÃƒÂ­cia descobrirÃƒÂ¡ os corpos no porÃƒÂ£o? Mortimer conseguirÃƒÂ¡ internar seu irmÃƒÂ£o no hospÃƒÂ­cio? \n\nInfelizmente sÃƒÂ£o tantas pontas abertas que muitas delas tornam-se rapidamente \ndesinteressantes. Ãƒ? o estilo de humor dos anos 1940 afinal, e certamente agora hÃƒÂ¡ outros gostos, mas o filme pode continuar sendo apreciado sem problemas de um ÃƒÂ¢ngulo mais conservador (nada de comparÃƒÂ¡-lo com as comÃƒÂ©dias atuais).\n\nFrank Capra demonstra alguns lampejos geniais, em algumas poucas tomadas (o close no rosto de Elaine quando ela espia pela janela perto do final do filme ÃƒÂ© maravilhoso) e algumas tiradas sÃƒÂ£o muito inteligentes e divertidas. Um filme que possui muitos pontos altos, sÃƒÂ³ que com sua longa duraÃƒÂ§ÃƒÂ£o e previsibilidade de muitas de suas situaÃƒÂ§ÃƒÂµes pode ficar facilmente cansativo jÃƒÂ¡ pela sua metade. Ainda assim vale por ser um Capra, isso se conseguir ser encontrado em alguma locadora, jÃƒÂ¡ que a sua distribuiÃƒÂ§ÃƒÂ£o, pelo menos atÃƒÂ© a data em que este texto foi escrito, parece ser muitÃƒÂ­ssimo limitada.\n\nAgradecimentos: Famulan\n\n","torrent":{"xt":"urn:btih:4fbece4bbd967f138abc2f68803d0cc808ba5f45","amp;dn":"Arsenic+and+Old+Lace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fbece4bbd967f138abc2f68803d0cc808ba5f45","infoHashBuffer":{"type":"Buffer","data":[79,190,206,75,189,150,127,19,138,188,47,104,128,61,12,200,8,186,95,69]},"announce":[],"urlList":[]}}