{"title":"HawaiianEye 213 Swan Song For A Hero","uid":3893015,"size":366237743,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ff3c363373261efdf6fa08f35fb00dde5c9c92c&amp;dn=HawaiianEye+213+Swan+Song+For+A+Hero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":2,"time":1195124728,"description":"HAWAIIAN EYE (TV-Series 1959-1963)\nSet against the beautiful tropical landscape of Honolulu, Hawaii, this series centered around the cases of Hawaiian Eye Private Investigations and the two handsome, slick, tough-guy detectives who ran the firm - Tom Lopaka (Robert Conrad) and Tracy Steele (Anthony Eisley), a Korean War veteran and former city police detective. They operated out of a swank office at the Hawaiian Village Hotel, where they were also the house detectives. Assisting them occasionally was a funny, ukelele-strumming Hawaiian taxi driver named Kazuo Kim (Poncie Ponce), whose wardrobe - consisting of a straw hat and crazy Hawaiian shirts - and numerous relatives living all over the Hawaiian Islands willing to help his employers if they needed it, provided invaluable comic relief. They were also aided by a dim-bulbed, scatter-brained, flippant nightclub singer and photographer named Chryseis &quot;Cricket&quot; Blake (Connie Stevens). Lt. Danny Quon was their contact on the police force who was always on call to provide any vital information that could help the Eyes crack a case.\n\ns2e13 &quot;Swan Song For A Hero&quot;\nThe wonderfully eccentric Otto Von Helgren proposes to sail a raft across the Pacific Ocean &quot;in the interests of science&quot; - and a substantial grant from the Pacific Foundation. However, Abner Dexter, an officer from the Foundation, suspects a swindle when Von Helgren refuses to be photographed. Tracy is asked to investigate and calls on Rex Randolph of 77 Sunset Strip to help him expose the fraud.\n\nGuest stars: Robert Lowery (Abner Dexter), John Van Dreelen (Otto von Helgren) , Charles Arnt (Fleems), Richard Long (Rex Randolph), Jean Allison (Mary Potts), Anna Lee (Holly Morrison), Paul Dubov (Philip Houser), Sue England (Receptionist), Dan Tobin (I) (Timmy Yarborough) \nCameos: Edward Burns (Kookie), Richard Long (Rex Randolf) - both from 77 Sunset Strip\nFirst aired: 7 December 1960 \n\nXviD/416x304/MP3/47min\n\nI put this up as my favorite episode of the series because of the marvelous role played by John Van Dreelan - not as most would think because of the young Robert Conrad. I do have others of this series, so leave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:4ff3c363373261efdf6fa08f35fb00dde5c9c92c","amp;dn":"HawaiianEye+213+Swan+Song+For+A+Hero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff3c363373261efdf6fa08f35fb00dde5c9c92c","infoHashBuffer":{"type":"Buffer","data":[79,243,195,99,55,50,97,239,223,111,160,143,53,251,0,221,229,201,201,44]},"announce":[],"urlList":[]}}