{"title":"Adobe Photoshop Lightroom 1.1","uid":3749832,"size":31533012,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5234dd8519225a92dfa9753d32f428cbcd461de5&amp;dn=Adobe+Photoshop+Lightroom+1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boorstar","files":1,"time":1185148228,"description":"Product Features\n\n    * Extensive workflow support - Transfer and work with large volumes of photographs with ease. Automated features help speed the downloading, importing, and renaming of files and let you easily apply global adjustments to photographs\n    * Nondestructive editing - Enjoy robust support for more than 140 camera raw formats, and experiment with confidence. Adjustments you make to images in Lightroom won&amp;#039;t alter the original data, whether you&amp;#039;re working on a JPEG, TIFF, DNG, or camera raw file.\n    * Professional editing tools for making global adjustments - Fine-tune your photographs with precise, easy-to-use tools for globally correcting white balance, exposure, tone curves, lens distortion, and color casts.\n    * Simple yet powerful tone curve editor - Precisely control the tonality and contrast of your images by individually targeting highlights, midtones, and shadows using sliders and visual controls.\n    * Efficient image viewing, evaluation, and comparison - Browse, evaluate, and select your images with efficient, flexible viewing and comparison tools.\n    * Elegant, uncluttered interface - Ease the learning curve and be productive quickly. Task-oriented modules whisk you through typical workflow tasks by putting just the tools you need at your fingertips.\n    * Fast, high-quality printing - Quickly and visually format high-quality prints, whether working with one photo or 100, on one page or many. Recall your favorite layouts with saved presets and enjoy speedy output, even of large files\n    * Finely tuned black-and-white conversions - Convert color images to black-and-white with precision. Familiar sliders allow you to control the contrast and detail based on the colors in the original photograph.\n    * Versatile client presentation capabilities - Use simple yet powerful tools to present your images and get client approval in print, on the web, or in a slide show.\n    * Automatic tracking of image changes - Always find the image state you need by keeping track of the changes you&amp;#039;ve made to images, including alternates, with the History panel.\n\n","torrent":{"xt":"urn:btih:5234dd8519225a92dfa9753d32f428cbcd461de5","amp;dn":"Adobe+Photoshop+Lightroom+1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5234dd8519225a92dfa9753d32f428cbcd461de5","infoHashBuffer":{"type":"Buffer","data":[82,52,221,133,25,34,90,146,223,169,117,61,50,244,40,203,205,70,29,229]},"announce":[],"urlList":[]}}