{"title":"Ned Collette - Future Suture [2007] VBR MP3 ~260kbps","uid":4006383,"size":93376280,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:52e3558112e0ca6ce8dc0cdf613a3536b0a6e6b2&amp;dn=Ned+Collette+-+Future+Suture+%5B2007%5D+VBR+MP3+%7E260kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dkords","files":9,"time":1201850128,"description":"Clayton: There is something about this guy. Something sincere and singular at the core of his music, something that on his verdant debut Jokes &amp; Trials (2006) brought the listener back again and again without quite knowing why, something that streams out of the speakers on Future Suture with just as much beguiling regularity. From note one, Ned Collette has sounded as if broadcasting his music from some distant point on the musical map that, though transfixing and vaguely alien to us, sounds resolutely like home to him. However, this could just be because he&amp;#039;s from Australia, and as I typically avoid such folk would not recognize distinct Australianness if it dingo-punched me in the snout. To assist me in this deficiency, I have brought a sterilized and restrained wild Australian on board to cowrite this review. Say hello, Mr. Bojangles.\n\nAaron: With that opener, the title of the Ned Collette chapter of the CMG Anthology (Picador, 2011) might now end up as How I sunk Mateship and the Tampa, by Dr C. Purdom, Asshole. This has to be the exact shittest thing about being an Australian singer/songwriter subject of a North American review: &quot;Ned Collette, Australian guitar God like those guys in Jetmother,&quot; or &quot;Ned Collette, like Nels Cline, except not undead, plus, Australian,&quot; or &quot;Q: What&amp;#039;s the lazy way to write about this guy so that we sell a couple of his records without having to draw any attention to the substance of his music? A: Oi oi oi.&quot; You see what&amp;#039;s going on here?\n\nClayton: No. Watch out for that boomerang!\n\nAaron: Dick.\n\nClayton: Right, but there is something about this guy&amp;#039;s music. It&amp;#039;s right there in the vocal performance of &quot;Sell Your Life,&quot; all loping restraint when he talks about &quot;taking it to the couch&quot; and getting &quot;so high it hurt&quot; and maintaining this cool even after the drums come in all climactic and synth lines get snakecharmed out of walking bass lines and rise up all shamanistic and Collette sanguinely coos, &quot;That&amp;#039;s okay with me.&quot; It&amp;#039;s not like I&amp;#039;ve never heard anything like him -- certainly I recognize the touchstones and influences leading to these two records of his -- it&amp;#039;s just that until last year I&amp;#039;d never heard Ned Collette before, period, and at the end of the day Ned Collette is one of the most remarkably self-contained artistic entities to emerge in the past bit.\n\nAaron: Say something Bowersly insightful about how his music sounds.\n\nClayton: He makes music that sounds wholly like Ned Collette: if you haven&amp;#039;t heard his music before, as soon as you do you will think, &quot;This sounds exactly like Ned Collette.&quot;\n\nAaron: That was more Breihanian.\n\nClayton: I expound: there are other artists that possess this glow, and they are elite: Ghostface raps with a selfish overabundance of Ghostfaceness. Music that sounds like Stars of the Lid, but isn&amp;#039;t, sounds like it&amp;#039;s trying to be Stars of the Lid. And even on their lackluster third release the Shins find their ineluctable appeal undiluted. These artists are more themselves than they are their influences. Ned Collette, of course, sounds nothing like them, but this is my point: he also shirks comparison to people that he actually does kinda sound like. Nool and Ned drink Foster&amp;#039;s together occasionally; certainly he can explain what I mean.\n\nAaron: It&amp;#039;s because he sounds exactly like Leonard Cohen filtered through Dungen. He writes exactly like Leonard Cohen, except with more singing, and more elaboration by guitar, and more layering, and more general, gorgeous noise going on, filled with all of those little stringy, fuzzy, stringy, horny, and orchestrated bits that Leonard used to throw into his songs to bookend his shattering words. Except then Ned goes and gets drums by Joe Talia, which should be a tagline on this record, to kick the knots out of your stomach on &quot;Sell Your Life&quot; or &quot;Race.&quot; This is the most impossible, eloquent, and wracking psych rock that your ruined imagination can tolerate. I hope they put that on a sticker. I&amp;#039;m shit at writing stickers.\n\nClayton: That last one was the first sentence you&amp;#039;ve written that should have been longer.\n\nAaron: What&amp;#039;s your favorite line from this thing? You can pick one musical one, and one that has words in it.\n\nClayton: Okay, musical first: the big slowhand fuzzed-out shred-fest at the end of &quot;Race&quot; that rises out of the plucky introduction like a seven-headed hydra that wants to be your friend and always comes over with really good weed and lets you borrow its Criterion DVDs. My favorite parts with words are actually when Ned gets all specific about just which &quot;Country With A Smile&quot; he&amp;#039;s talking about, but that shit doesn&amp;#039;t quite work out of context, so I&amp;#039;ll go with this nugget buried on &quot;Forty Children&quot;: &quot;A coliseum built of pith on which we stand so proud / The men that lead us still are men like any in the crowd / The men that lead us still to death to stillbirth without warning / The women we should love that you should love are still in mourning.&quot; That&amp;#039;s my shit right there.\n\nAaron: I hoped you would say that, because those aren&amp;#039;t even in the top ten bits on this record.\n\nClayton: And there is that something about this motherfucking guy! Because while these songs are just as strong (or stronger) than those on his debut, the sonic embellishments previously concealed so carefully into the framework of the music are now lushly at the forefront. The core of Collette&amp;#039;s musical heart beats like Cohen or whoever, but on a track like &quot;Show Your Hand,&quot; for example, we have vintage synths rising from martial acoustic strums (Collette hallmarks, yes) before turning into a Robert Rodriguez horn section and then spaced-out Dungen flute rawk. Jokes &amp; Trials was the definition of a grower, both over the course of a single listen and through the quiet sinister way it burrowed into the listener&amp;#039;s psyche in the following months, but Future Suture is something else entirely. Or, more accurately, it&amp;#039;s the exact same (in that it is welcoming and labyrinthine and a total fucking &quot;grower&quot;) but it is also an immediate record, full of OMG instrumentation and deft dynamic shifts and parts you want to play for your friends on headphones. I can&amp;#039;t really think of any other record of recent release to which both qualities apply so completely. What does water taste like in Australia?\n\nAaron: What water.\n\nClayton: What?\n\nAaron: Water. What water.\n\nClayton: There&amp;#039;s water in Australia.\n\nAaron: Not really.\n\nClayton: What do you mean.\n\nAaron: Drought.\n\nClayton: Drought?\n\nAaron: No water.\n\nClayton: You mean Ned Collette made an 83% album.\n\nAaron: .totally dehydrated.\n\nClayton: Holy shit.\n\nAaron: He is a real Aussie battler.\n\nAaron Newell and Clayton Purdom\nDecember 8, 2007","torrent":{"xt":"urn:btih:52e3558112e0ca6ce8dc0cdf613a3536b0a6e6b2","amp;dn":"Ned+Collette+-+Future+Suture+%5B2007%5D+VBR+MP3+%7E260kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52e3558112e0ca6ce8dc0cdf613a3536b0a6e6b2","infoHashBuffer":{"type":"Buffer","data":[82,227,85,129,18,224,202,108,232,220,12,223,97,58,53,54,176,166,230,178]},"announce":[],"urlList":[]}}