{"title":"Presidential Bloopers","uid":3987346,"size":732514778,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5335dbee7599f3cc40d05c5be261ff1dcc3d2389&amp;dn=Presidential+Bloopers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cheeseonrice","files":2,"time":1200869725,"description":"Presidential Bloopers\nTime Life Video\n1999\n---------------------\n\nI found this at a dollar store for a friend, figured I may as well rip and upload.  If you want the iso for some reason, leave a comment, and when I notice it I&amp;#039;ll upload a torrent.\n\nEncoding information is in included info file.\n\nFrom the back of the case:\n The American President.  Powerful.  Influential.  Well-respected.  And sometimes all too human!  Laugh along with the presidents as they laugh at themselves in this celebration of the funniest and most down-to-earth moments of the American presidency - a rare, behind-the-scenes look at some of the most outrageous White House wackiness ever captured on video.\n\n Some of the hilarious un-presidential moments you&amp;#039;ll witness include Gerald Ford stumbling off Air Force One, Ronald Reagan catching a few winks during a live news conference, George Bush sliding head-first down a bowling alley, Bill Clinton yukking it up with Boris Yelstin and much more!  Presidential Bloopers is an affectionate tribute to our nation&amp;#039;s leaders as they slip, slide, misspell, misspeak, bumble and blunder their way into history.  The only thing they have to fear is...flubbing in front of the camera.  Own a loving and lighthearted look at the leaders of the free world - captured on one hilarious video!","torrent":{"xt":"urn:btih:5335dbee7599f3cc40d05c5be261ff1dcc3d2389","amp;dn":"Presidential+Bloopers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5335dbee7599f3cc40d05c5be261ff1dcc3d2389","infoHashBuffer":{"type":"Buffer","data":[83,53,219,238,117,153,243,204,64,208,92,91,226,97,255,29,204,61,35,137]},"announce":[],"urlList":[]}}