{"title":"The Ghost and the Darkness (DVD rip)","uid":3995034,"size":4681418752,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:53b1e57df216ca125a25594229eca42c7e263f32&amp;dn=The+Ghost+and+the+Darkness+%28DVD+rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"as_seen_on_tv","files":1,"time":1201274918,"description":"Summary\n\nIn 1896 Lt. Col. John Paterson was sent to East Africa to build a railway bridge. He had a deadline to meet but was confident he and his large workforce of Africans and Indians can get the job done in time. John\\&amp;#039;s was a man of his word and got things done - which he demonstrated on his first day by killing a lion that had been pestering the workforce. This earned John respect, but it didn\\&amp;#039;t last very long because a few weeks later 2 new lions began visiting and they\\&amp;#039;re man-eaters. The film is based on a true story and during the construction of the bridge, the lions would enter the workers camp to kill. Believing them not to be real lions, the locals name them \\&amp;#039;The Ghost\\&amp;#039; and \\&amp;#039;The Darkness\\&amp;#039;. After losing dozens of workers to the lions, the railroad company brought in Remington, an American \\&amp;#039;great white hunter\\&amp;#039;, to kill them, but even his reputation for being the best could not prevent yet more carnage. It is believed that over 130 people were killed by the two lions in just a few months\n\nAwesome movie which is based on a true story.  This is my first .iso from DVD but the quality seems to be pretty good.  I didn\\&amp;#039;t watch the whole movie though.  Any feedback (positive or negative) is appreciated.","torrent":{"xt":"urn:btih:53b1e57df216ca125a25594229eca42c7e263f32","amp;dn":"The+Ghost+and+the+Darkness+%28DVD+rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b1e57df216ca125a25594229eca42c7e263f32","infoHashBuffer":{"type":"Buffer","data":[83,177,229,125,242,22,202,18,90,37,89,66,41,236,164,44,126,38,63,50]},"announce":[],"urlList":[]}}