{"title":"Brutal truth pack","uid":3979987,"size":561815157,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:541ee410e0bf75dab8b5c837d3d31551831e0b38&amp;dn=Brutal+truth+pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimbolic666","files":165,"time":1200499947,"description":"Brutal truth Pack\nquote wikipedia - \n\n\nQUOTE\nThe band was originally signed to Earache Records, on which they released two albums, 1992&amp;#039;s Extreme Conditions Demand Extreme Responses, and 1994&amp;#039;s Need to Control, as well as an EP entitled Perpetual Conversion, and a 7&quot; single for the song &quot;Godplayer&quot;. Brutal Truth found frustration with Earache Records, as did many 1990s Relapse Records bands, and switched to Relapse Records, known for its roster of grindcore acts, with whom they stayed until the band&amp;#039;s demise.\n\nOn Relapse they released the mini album Kill Trend Suicide, a full length release entitled Sounds of the Animal Kingdom, and a double CD live album called Goodbye Cruel World. The band has also released many split 7&quot; singles on smaller labels, with most of these being out of print and difficult to find.\n\nIn 2001, the Guinness Book of Records awarded Brutal Truth the record for &quot;Shortest Music Video&quot; for their video &quot;Collateral Damage&quot;, which is 2.18 seconds long and consists of 48 still images in rapid succession followed by a clip of an explosion.\n\nDrummer Rich Hoak now provides vocals and drums for a new project titled Total Fucking Destruction. Kevin Sharp released an album with Venomous Concept in 2004, a hardcore punk band featuring members from The Melvins and Napalm Death. He was also a member of Australian grind band Damaged for a little over a year from 1999. Dan Lilker now plays for a host of bands and is currently bassist for the re-united Nuclear Assault.\n\nAs of late 2006, according to their official website and MySpace page, Brutal Truth has reformed with three-quarters of the final lineup returning (Lilker, Hoak and Sharp); Jody Roberts (of the band Salt This Earth) is apparently replacing Brent McCarty on guitar. The band has played a handful of dates in the US and has announced tour dates for the UK and Japan beginning in early 2007.\n\n\nMembers \nRich Hoak\nDan Lilker\nJody Roberts\nKevin Sharp\nErick Burke \nFormer members \nBrent McCarthy \n\nPack contains - \nBirth of ignorance demo\nIll neglect EP\nBirth of ignorance Bootleg\nPerpetual Conversion EP\nBrutal truth &amp; Spazz split\nBrutal truth &amp; Converge split\nEkstreme conditions demand ekstreme responses\nGoodbye cruel world\nKill trend suicide\nNeed to control\nSounds of the animal kingdom\n\nAlbums in various bitrate\n535 MB\n\nEnjoy,seed and say thanks","torrent":{"xt":"urn:btih:541ee410e0bf75dab8b5c837d3d31551831e0b38","amp;dn":"Brutal+truth+pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"541ee410e0bf75dab8b5c837d3d31551831e0b38","infoHashBuffer":{"type":"Buffer","data":[84,30,228,16,224,191,117,218,184,181,200,55,211,211,21,81,131,30,11,56]},"announce":[],"urlList":[]}}