{"title":"Voyage to the Planets","uid":3749863,"size":1470084350,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5444cf2845585eeb7a6b644f36d1863e19f667ce&amp;dn=Voyage+to+the+Planets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xorious","files":2,"time":1185150842,"description":"Imagine crashing through the acid storms of Venus, taking a space walk in the magnificent rings of Saturn, or collecting samples on the disintegrating surface of an unstable comet. \n\n\n\nFrom the makers of Walking With Dinosaurs, this magical new drama-documentary series, narrated by David Suchet, takes viewers on the ultimate space flight and, by pressing the red button on the remote control, transports them right to the heart of the European Space Agency&amp;#039;s mission control room. \n\n\n\nSeen through the eyes of five astronauts on a six-year mission to the new frontiers that make up our solar system, it reveals the spectacle - and the dangers - they face when landing on and exploring the exotic worlds of our neighbouring planets. \n\n\n\nUsing the latest scientific findings and feature film digital effects, Space Odyssey: Voyage To The Planets is the ultimate grand tour, brought to life in a beautiful and moving journey packed with peril and excitement. \n\n\n\nAlong the way, it uncovers the immense physical and emotional challenges that would affect those taking such a trip. \n\n\n\nFrom a daring fly-by of the Sun, to a marathon mission to the frozen realms of Pluto, this epic voyage takes viewers on the adventure of a lifetime. \n\n\n\nIn a first for a TV series, the actors were filmed on parabolic flights to simulate zero gravity conditions so that they really are floating weightless in some of the scenes. \n\n\n\nBack on the ground, filming took place in some of the most inhospitable places on Earth to create a very real sensation of what it would look and feel like to walk on alien worlds. \n\n\n\nAward-winning film score composer, Don Davis, has created a spectacular soundtrack which brings the action, the drama and the sheer beauty of the scenery to life. \n\n\n\nExecutive producer, Tim Haines of Impossible Pictures, explains: &quot;In a unique collaboration between Hollywood&amp;#039;s entertainment industry, the world&amp;#039;s main space agencies and the cutting-edge digital effects talents of Framestore, this series is the most accurate vision of a human exploration of our neighbouring planets ever created.&quot; \n\n\n\nSeries Producer, Chris Riley, continues: &quot;We worked closely with cosmonauts, astronauts and space agencies in Russia, Europe and the USA to bring a gritty reality to the series that reflects over 40 years of their experience of human space flight and robotic exploration of the planets of our solar system.&quot; \n\n\n\nFacts, figures and the science lowdown are available via interactive TV and the web, plus there&amp;#039;s also a special touring show, designed for families, which will be visiting science centres around the UK. \n\n\n\nTo accompany this production, BBC FOUR broadcasts Space Odyssey: The Robot Pioneers, a 50-minute film revealing the real missions to the planets which have provided the facts that underpin the main series. \n\n\n\nSpace Odyssey: Voyage To The Planets is an Impossible Pictures production for the BBC, Discovery Channel and ProSieben. \n\n\n\nSpace Odyssey: The Robot Pioneers is an Impossible Pictures production for the BBC, Discovery Channel and ProSieben in association with the Science Channel. \n","torrent":{"xt":"urn:btih:5444cf2845585eeb7a6b644f36d1863e19f667ce","amp;dn":"Voyage+to+the+Planets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5444cf2845585eeb7a6b644f36d1863e19f667ce","infoHashBuffer":{"type":"Buffer","data":[84,68,207,40,69,88,94,235,122,107,100,79,54,209,134,62,25,246,103,206]},"announce":[],"urlList":[]}}