{"title":"PhotoPresenter 3.3","uid":4002775,"size":9672628,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:54c4097d796437489fb57f4a940750f0e3d7fe6e&amp;dn=PhotoPresenter+3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"catalin1082","files":1,"time":1201653221,"description":"PhotoPresenter is an award-winning, easy-to-use and powerful slideshow viewer. It allows you to quickly present all your pictures and movies, and to create amazing presentations in just a snap.\n\nShow movies as easily as pictures\nYou surely noticed that with most slideshow viewers, it is impossible to include movies in your slideshows. PhotoPresenter precisely fills this gap. Simply. Seamlessly.\n\nNavigate quickly and comfortably\nYou want to switch to another slide without abandoning the slideshow? Just hit the ? key and select the slide you want to jump to. And with the Apple remote control, you can even control your slideshow from anywhere across the room.\n\nPresenta tion on multiple displays\nMake breathtaking presentations using several monitors: not only can PhotoPresenter display its animated slideshows on each attached monitor, it can also treat all monitors as a single large display.\n\nSlide shows with style(s)\nPhotoPresenter offers many gorgeous styles to create animated slideshows with amazing effects. But of course, you can as easily start a standard slideshow without any fancy effects ? just with style. For instance, PhotoPresenter, rather than shrinking beautiful panorama to fit the screen, will then enlarge your panoramic pictures and slide them across the screen.\n\nClosely inte grated with iApps\nPhotoPresenter smoothly integrates with your favourite applications: it recognizes both your iPhoto and Aperture libraries, and can play any song or playlist from iTunes.\n\nPictures and movies from anywhere\nNeedless to say, you can view the content of any location, such as folder, CD, DVD and digital camera.\n\nPassword: MacForever","torrent":{"xt":"urn:btih:54c4097d796437489fb57f4a940750f0e3d7fe6e","amp;dn":"PhotoPresenter+3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54c4097d796437489fb57f4a940750f0e3d7fe6e","infoHashBuffer":{"type":"Buffer","data":[84,196,9,125,121,100,55,72,159,181,127,74,148,7,80,240,227,215,254,110]},"announce":[],"urlList":[]}}