{"title":"Last Final final retirement till vf5 London vf (Money) Torni.","uid":3364077,"size":207099284,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:54e5ab954e82d6e2478ea95f1c230e8d79f3ae86&amp;dn=Last+Final+final+retirement+till+vf5+London+vf+%28Money%29+Torni.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jeffahn","files":16,"time":1122931161,"description":"good session all around, apart from the tourny arrangements. the Lei / Akira player was really impressive~!\n\nEv2 thanks for comming down, it was nice to see some play variation, nice jacky too, i was puzzled about the K+G ~ d+K+G oki setup, seemed like i couldnt block the low sweep after blocking the high roundhouse. is it a guard break? / guaranteed hit? -- ehh weird, lol\n\nDat - i reeally wanted to play ur akira more, it's definatley heading toward the direction of high level. only got some with my goh using a bad stick, lol well done to win the tournie, it was only a matter of waiting till it happened, lol.\n\nollie - you played much better during the tourny, well done to win 3rd place, i think by then i was puking out my chocolate cake i bought, lololol.. i really felt like i didnt wanna play VF after i had eaten ^0^)\n\nJide - i can see some nice traps you are learning with lion, i think you are heading in the right direction with this game. remember that a even though the VF system seems like chess &amp; numbers, the character specific tools can replace common situations like throw / knee nitaku (i.e lion's meteor punch). lion has some nice stuff to deal with disadvantage, his db+pp &amp; b+p+K are great evasive tools, db+pp i think to low P. it's good to see these are being applied in the right situations.\n\nrising P launcher is great for comming under highs, i think it's only +1 on normal hit, so it's why elbow lost to low P afterward, mabye a backdash mid would keep the pressure going, toy around with that situation cuz i think that could toughen lion big time in the reverse nitaku factor. but congrats on the 2nd place.\n\nto everyone else thanks for keeping it welcome, it was good fun..\n\nBK_","torrent":{"xt":"urn:btih:54e5ab954e82d6e2478ea95f1c230e8d79f3ae86","amp;dn":"Last+Final+final+retirement+till+vf5+London+vf+%28Money%29+Torni.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54e5ab954e82d6e2478ea95f1c230e8d79f3ae86","infoHashBuffer":{"type":"Buffer","data":[84,229,171,149,78,130,214,226,71,142,169,95,28,35,14,141,121,243,174,134]},"announce":[],"urlList":[]}}