{"title":"[Kung Fu] Dororo (2007) - DVD/Rmvb","uid":3762110,"size":577203015,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5550e29a9e5fd8a51164e849ae92cd747ccdcb9e&amp;dn=%5BKung+Fu%5D+Dororo+%282007%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JamesKees","files":7,"time":1186189603,"description":"Dororo (2007)\n\nAdapted from Tezuka Osamu&amp;#039;s popular manga, Dororo is a rollicking period adventure for all ages. A blockbuster success in Japan, with not just one but two sequels already in the works, Dororo features the idol pairing of Tsumabuki Satoshi (Nada Soso) and Shibasaki Kou (Sinking of Japan) as storied demon hunters Hyakkimaru and Dororo. This unabashedly fun comic book actioner may seem like an unlikely entry from acclaimed indie director Shiota Akihiko (Don&amp;#039;t Look Back), but the film also touches on serious themes of family, war, and redemption which Shiota underlies with convincing humanity. With action choreography by Ching Siu Tung (Hero) and plenty of CG demons to boot, however, Dororo never gets too serious for the genre, staying fast-paced and swashbuckling from beginning to end.\n\nWith the land torn by feudal war, vanquished samurai warlord Daigo Kagemitsu (Nakai Kiichi) cuts a deal with the demons - victory in exchange for his unborn son. His wishes granted, Daigo triumphs on the battlefield, but his son is born barely human, his body having been torn into forty-eight parts and spread amongst the demons. Left in a basket in a river, the infant is picked up by kind-hearted doctor Jukai (Harada Yoshio) who raises the boy like a son and builds him a new body, Frankenstein style. Impervious to pain and injury, the boy possesses unnatural powers and an uncommon will to live, but in order to become truly human, he must recover his body parts. And thus begins the quest of Hyakkimaru (Tsumabuki Satoshi), as he roams the land hunting down the forty-eight demons. With each demon slayed, a part of him is restored, or rather regrown. During his journey, he befriends scrappy street thief Dororo (Shibasaki Kou), who joins him in his epic adventure, an adventure that leads them to Daigo. \n\nCourtesy Of YesAsia.com Site.\n\nDirector\n\tSHIOTA Akihiko\t\n\nActor\n\tTSUMABUKI Satoshi\tHyakkimaru\n\tSHIBASAKI Kou\tDororo\n\tASO Kumiko - ?????\t\n\tEITA - ??\tTahomaru\n\tGEKIDAN Hitori\t\n\tHARADA Mieko\tYuri\n\tHARADA Yoshio - ????\tJukai\n\tNAKAI Kiichi\tKagemitsu Daigo\n\tTSUCHIYA Anna\t\n\nAction director\n\tTony CHING Siu-Tung\n\nScriptwriter\n\tNAKAMURA Masa\t\n\tSHIOTA Akihiko\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:5550e29a9e5fd8a51164e849ae92cd747ccdcb9e","amp;dn":"%5BKung+Fu%5D+Dororo+%282007%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5550e29a9e5fd8a51164e849ae92cd747ccdcb9e","infoHashBuffer":{"type":"Buffer","data":[85,80,226,154,158,95,216,165,17,100,232,73,174,146,205,116,124,205,203,158]},"announce":[],"urlList":[]}}