{"title":"NarkSoul - Vias De Escape","uid":3934961,"size":70694358,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:556948ee20415aa0b76f448bf9cf4eb904a30422&amp;dn=NarkSoul+-+Vias+De+Escape&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Blizkt","files":31,"time":1197745346,"description":"NARKSOUL presenta: VIAS DE ESCAPE.\n\nEste MC, productor y DJ de 16 aÃƒÂ±os saca a la luz su primer trabajo en solitario. \nFundamentalmente, su principal objetivo era transmitir lo que hay encerrado en su almacÃƒÂ©n de pensamientos e ideas a \ntravÃƒÂ©s de la mÃƒÂºsica, la funciÃƒÂ³n esencial de la misma. Es ese el fundamento en el que se basa este movimiento. \nConstruir un trabajo musical vacÃƒÂ­o no sirve de nada. Hechos y experiencias, distintos ÃƒÂ¡ngulos de observar la vida, la\nsociedad, lo que le ha rodeado todo este tiempo... Vias De Escape llega desde MÃƒÂ¡laga \nreuniendo gran variedad de temas, tanto en el aspecto lÃƒÂ­rico como instrumental. LÃƒÂ­mites que se llegan a tocar como temas\nllenos de tristeza y otros llenos de ritmo y alegrÃƒÂ­a, lo pausado y tranquilo, lo hardcore y lo directo, etc. Este \ntrabajo consta de 12 temas todos ellos producidos por NARKSOUL excepto uno de ellos producido por DJ KRAYZ. \nHa sido grabado, mezclado y masterizado en L-6 Records (MÃƒÂ¡laga) por NARKSOUL. Los scratches tambiÃƒÂ©n han sido todos \nrealizados por NARKSOUL y en cuanto a las colaboraciones vocales nos encontramos con ASPER, OCRE, ZEKA y DOBLE SENTIDO.\nEn fin, un trabajo muy personal en el que NARKSOUL se ha encargado de casi todo y en el que se ha puesto empeÃƒÂ±o e ilusiÃƒÂ³n\npor encima de todo.\n\nTracklist:\n\n01 - NARKSOUL Empieza - Prod. NARKSOUL - Letras por: NARKSOUL\n\n02 - Abran Paso Al Funk - Prod. NARKSOUL - Letras por: NARKSOUL\n\n03 - Ahogado En Un Vaso - Prod. NARKSOUL - Letras por: NARKSOUL\n\n04 - Nada Sale Bien - Prod. DJ KRAYZ - Letras por: NARKSOUL\n\n05 - Rodeado De Nada (con Zeka) - Prod. NARKSOUL - Letras por: NARKSOUL y ZEKA\n\n06 - Interludio - Poetry&amp;#039;s secret - Prod. NARKSOUL\n\n07 - Me Haces Reir - Asper - Prod. NARKSOUL - Letras por: ASPER - Scratches por: NARKSOUL\n\n08 - Nueva Orilla, Nueva Vida (con Doble Sentido) - Prod. NARKSOUL - Letras por: NARKSOUL, ALEX y AXEL\n\n09 - Guarden Sus Criticas (con Asper) - Prod. NARKSOUL - Letras por: NARKSOUL y ASPER - Scratches por: NARKSOUL\n\n10 - Vias De Escape - Prod. NARKSOUL - Letras por: NARKSOUL - Scratches por: NARKSOUL\n\n11 - Sois Unos Cutres II (con Ocre) - Prod. NARKSOUL - Letras por: NARKSOUL y OCRE - Scratches por: NARKSOUL\n\n12 - Outro - Prod. NARKSOUL - Letras por: NARKSOUL\n\n\nGrabado, mezclado y masterizado en L-6 Records (MÃƒÂ¡laga) por NARKSOUL.\n\n\n\nÃ‚Â© 2007 MÃƒÂ¡laga.","torrent":{"xt":"urn:btih:556948ee20415aa0b76f448bf9cf4eb904a30422","amp;dn":"NarkSoul+-+Vias+De+Escape","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"556948ee20415aa0b76f448bf9cf4eb904a30422","infoHashBuffer":{"type":"Buffer","data":[85,105,72,238,32,65,90,160,183,111,68,139,249,207,78,185,4,163,4,34]},"announce":[],"urlList":[]}}