{"title":"MGMT - Oracular Spectacular (Indie Electronic -- 2007)","uid":4019363,"size":80255469,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:562cff70229869d43401e11b11e83b6f33888901&amp;dn=MGMT+-+Oracular+Spectacular+%28Indie+Electronic+--+2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smackpops","files":10,"time":1202590556,"description":"Finding an unlikely middle point between Suicide&amp;#039;s hostile proto-electro punk art noise and the sardonic, studied, but ultimately pop-friendly sound of the Flaming Lips, MGMT started as electroclash musical terrorists but quickly transmogrified into an eclectic, brainy pop group with heavy psychedelic overtones. MGMT first formed in 2002, during Ben Goldwasser and Andrew Van Wyngarden&amp;#039;s freshman year as art students at Wesleyan University in Middletown, CT. At first the band was known as the Management, and its shows consisted mostly of backing tapes, synthesizers, and prerecorded vocals playing as Goldwasser and Van Wyngarden engaged the audience in a manner somewhere between performance art and good old-fashioned punky hostility. By their senior year, things had toned down considerably on-stage and the duo was augmenting its live sound with backing musicians. Upon graduating, the duo released an electro-rock EP, Time to Pretend, on the tiny indie Cantora Records in 2005. Good reviews, especially for the title track, and extensive touring brought the duo to the attention of British producer Steve Lillywhite in his role as an A&amp;R executive for Columbia Records, which signed the band for a major long-term deal in 2006. Regrouping in Brooklyn, the duo enlisted producer Dave Fridmann to create the entirely different-sounding Oracular Spectacular, a far more musically expansive album.","torrent":{"xt":"urn:btih:562cff70229869d43401e11b11e83b6f33888901","amp;dn":"MGMT+-+Oracular+Spectacular+%28Indie+Electronic+--+2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"562cff70229869d43401e11b11e83b6f33888901","infoHashBuffer":{"type":"Buffer","data":[86,44,255,112,34,152,105,212,52,1,225,27,17,232,59,111,51,136,137,1]},"announce":[],"urlList":[]}}