{"title":"FSX - InFlightEmergencies.rar","uid":4018244,"size":9324741,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5635c07b32dfcd6551d7e32bf1ceb6629c38c9d7&amp;dn=FSX+-+InFlightEmergencies.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"slugga","files":1,"time":1202500973,"description":"FSX - In Flight Emergencies\n\n\nMore than ever, enthusiasts strive to make their digital experience as real as possible.  With the popularity of cockpit building, the flying experience has moved to the living room, the workshop, or the garage. \n\nOur program, &amp;#039;In Flight Emergencies for FSX&amp;#039; adds even more to the realism.  You could fumble through key sequences to turn on a vacuum, pitot, or brake failure; but how real is that... you know what?s coming, and have likely made all the preparations prior to even hitting the key sequence.  With &amp;#039;In Flight Emergencies&amp;#039; you won&amp;#039;t know what?s coming until it actually happens.\n\nOnce started, you can select various events from vacuum failure to engine fires, or, if you prefer, simply click on the &amp;#039;Timed Event&amp;#039; checkbox to have the program select an event at random.  Events of any type could occur at times ranging from 2 to 30 minutes into your flight.  \n\nProper control inputs will be required to correct the problems.  Failures supplied with FSX are either timed, or ?On ? Off? events where-as failures provided by our program will respond to control inputs.  In the event of an engine fire for example, you no longer have to let your 172 burn.  Formerly, fire suppression systems in larger aircraft were the only way to put them out.  Now, inputs such as cutting the fuel flow to the engine will extinguish the fire.\n\nJust like a real world pilot you have to be observant.  Pay attention to your gauges to observe that vacuum failure when it happens, scan outside the aircraft to see if that engine fire has occurred, on approach be sure that the gear has come down, or once you have landed, be ready for various brake failures.\n\nThe program will work with Standard as well as the majority of add-on aircraft. \n","torrent":{"xt":"urn:btih:5635c07b32dfcd6551d7e32bf1ceb6629c38c9d7","amp;dn":"FSX+-+InFlightEmergencies.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5635c07b32dfcd6551d7e32bf1ceb6629c38c9d7","infoHashBuffer":{"type":"Buffer","data":[86,53,192,123,50,223,205,101,81,215,227,43,241,206,182,98,156,56,201,215]},"announce":[],"urlList":[]}}