{"title":"Hide IP Platinum 3.43 [eNJoY-iT]","uid":3760514,"size":892592,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:56a151d517f3b70bbfb51aef479bf1b2642897bf&amp;dn=Hide+IP+Platinum+3.43+%5BeNJoY-iT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sunblock","files":1,"time":1186013419,"description":"Concerned about Internet privacy? Want to hide your IP address? \n\nHide IP Platinum is the software you are looking for! Keeping your privacy is simple and easy: the only thing you need to do is open Hide IP Platinum. Hide IP platinum will find the proxy server available to you and set it as your proxy server automatically. There is nothing need you to concern. Hide IP Platinum have done everything for you! \n\nKey Features of Hide IP Platinum: \n\n- Hide IP Platinum searches for HIGH anonymous proxy server and makes you complete invisible to any websites you are surfing \n\n- Protect you from any website that wants to monitor your reading interests and spy upon you through your unique IP address - your ID in the Internet \n\n- Avoid your personal information be used to send you spam and junk emails by many marketers and advertising agencies who having information about your interests and knowing your IP address as well as your email \n\n- Keeping your computer away from hacker attacks by hiding your IP address as well as information about your operation system \n\n- Ability to frequently change IP addresses increases privacy \n\n- Enable and disable Hide IP Platinum as your wish with a single click \n\n- Bypass the restrictions by some owners of Internet resources on users from certain countries or geographical regions \n\n- Post on bulletin boards without displaying your real IP address \n\n- Use with a web based mail service to send anonymous email \n\n- Doesn&amp;#039;t like oher services force you to pay a monthly fee for anonymous surfing. For a low one-time price, you can visit whatever web sites without anyone ever finding out \n\n- Works with Internet Explorer and Windows 98, ME, 2000, XP, 2003\n\n","torrent":{"xt":"urn:btih:56a151d517f3b70bbfb51aef479bf1b2642897bf","amp;dn":"Hide+IP+Platinum+3.43+%5BeNJoY-iT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56a151d517f3b70bbfb51aef479bf1b2642897bf","infoHashBuffer":{"type":"Buffer","data":[86,161,81,213,23,243,183,11,191,181,26,239,71,155,241,178,100,40,151,191]},"announce":[],"urlList":[]}}