{"title":"Zeitgeist, the Movie (Official 2007 Release)","uid":3939852,"size":3225321472,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:570a11a9af50fc35ac71356e062150e613bafe88&amp;dn=Zeitgeist%2C+the+Movie+%28Official+2007+Release%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ElvisNewKing","files":1,"time":1198064190,"description":"&amp;#039;Zeitgeist, the Movie&amp;#039; Official Release\n---------------------------------------\nFor more information visit:\n\nThis Torrent is an .ISO file which was created from an original high resolution factory pressed DVD.\n\nOfficial Statement from the Producer (Peter Joseph)\n------------------------------------\n\nSince the emergence of the work in late June, 2007, many other websites,\norganizations and posts have fallaciously claimed connections to the work.\nPlease note that &amp;#039;Zeitgeist&amp;#039;, along with this site, has no direct affiliation with\nanything else online.\n\nZeitgeist, produced by Peter Joseph, was created as a nonprofit filmiac expression to inspire people to start looking at the world from a more critical perspective and to understand that very often things are not what the population at large think they are. The information in Zeitgeist was established over a year long period of research and the current Source page on this site lists the basic sources used / referenced and the Interactive Transcript includes exact source references and further information.\n\nNow, it&amp;#039;s important to point out that there is a tendency to simply disbelieve things that are counter to our understanding, without the necessary research performed. For example, some information contained in Part 1 and Part 3, specifically, is not obtained by simple keyword searches on the Internet. You have to dig deeper. For instance, very often people who look up &quot;Horus&quot; or &quot;The Federal Reserve&quot; on the Internet draw their conclusions from very general or biased sources. Online encyclopedias or text book Encyclopedias often do not contain the information contained in Zeitgeist. However, if one takes the time to read the sources provided, they will find that what is being presented is based on documented evidence. Any corrections, clarifications &amp; further points regarding the film are found on the Clarifications page. Non-Profit DVDs / Free Video Downloads are available through the Downloads page.\n\nThat being said, It is my hope that people will not take what is said\nin the film as the truth, but find out for themselves, for truth is not told, it is realized. ","torrent":{"xt":"urn:btih:570a11a9af50fc35ac71356e062150e613bafe88","amp;dn":"Zeitgeist%2C+the+Movie+%28Official+2007+Release%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570a11a9af50fc35ac71356e062150e613bafe88","infoHashBuffer":{"type":"Buffer","data":[87,10,17,169,175,80,252,53,172,113,53,110,6,33,80,230,19,186,254,136]},"announce":[],"urlList":[]}}