{"title":"Numb3rs (TV Series) Season 2 DVD 1","uid":3777778,"size":4694888571,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:570ba8121e97fa8974c9acabc95db7ef6ce35210&amp;dn=Numb3rs+%28TV+Series%29+Season+2+DVD+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kalin1102","files":-1,"time":1187488660,"description":"Director Lou Antonio, Jefery Levy, Tim Matheson, Mick Jackson\n\nCast Rob Morrow, Diane Farr, Judd Hirsch, David Krumholtz, Alimi Ballard, Peter MacNicol, Navi Rawat, Dylan Bruno\n\nVideo Pal 1.78:1 , 16:9 (Anamorphic)\n\nLanguages Dolby Digital 5.1: English . Dolby Digital Surround: Spanish\n\nSubtitles English, German, Danish, Spanish, Finnish, French, Dutch, Norwegian, Swedish, English for deaf people\n\nSynopsis\n\nNUMB3RS is a drama about an FBI agent who recruits his mathematical-genius brother to help the Bureau solve a wide range of challenging crimes in Los Angeles. The two brothers take on the most confounding criminal cases from a very distinctive perspective. Inspired by actual cases, the series depicts how the confluence of police work and mathematics provides unexpected revelations and answers to the most perplexing criminal questions. A dedicated FBI agent, Don Eppes (Rob Morrow), couldnÃ‚Â´t be more different from his younger brother, Charlie Eppes (David Krumholtz), a brilliant mathematician who, since he was little, yearned to impress his big brother. As a seasoned investigator, Don deals in hard facts and evidence, whereas Charlie, a math professor at a California university, functions in a world of mathematical probability and equations. Now, despite their disparate approaches to life, Don and Charlie are able to combine their areas of expertise and solve some killer cases..\n\n\nDVD9-&gt;DVD5 Rebuilder + CCE 4 pasadas\n\nEnjoy","torrent":{"xt":"urn:btih:570ba8121e97fa8974c9acabc95db7ef6ce35210","amp;dn":"Numb3rs+%28TV+Series%29+Season+2+DVD+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570ba8121e97fa8974c9acabc95db7ef6ce35210","infoHashBuffer":{"type":"Buffer","data":[87,11,168,18,30,151,250,137,116,201,172,171,201,93,183,239,108,227,82,16]},"announce":[],"urlList":[]}}