{"title":"The Best of 60's and 70's part 60 - reseed","uid":3999964,"size":405651289,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:57bca499f38776d17aaf26729c76dcda4bb851ad&amp;dn=The+Best+of+60%5C%27s+and+70%5C%27s+part+60+-+reseed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Glassman99","files":7,"time":1201509758,"description":"                                 PART  60 - reseed\n\n              THE BEATLES  - Blue Jay Way  (1967)\n              TRAFFIC - Hole In My Shoe  (1967)\n              THE ROLLING STONES - We love you  (1967)\n              THE ROLLING STONES -  2000 Light Years From Home   (1967)\n              FLEETWOOD MAC  -  The Green Manalishi  (1970)\n               \n\n       \n          &quot;Blue Jay Way&quot; is a song written by George Harrison; it was first recorded and released by The Beatles on their Magical Mystery Tour album and EP in 1967.The name of the song comes from an actual street, high in the Hollywood Hills overlooking Sunset Boulevard, which affords panoramic views of Hollywood and much of the Los Angeles basin.\n          &quot;Hole In My Shoe&quot; is a song by Traffic which as a single release reached #2 in the UK charts in 1967. Composed by their then guitarist Dave Mason, it is one of the defining tracks of acid rock (psychedelic rock), although it has been suggested that Steve Winwood disliked the song, feeling that it did not represent the band&amp;#039;s real musical or lyrical style.\n          &quot;We Love You&quot; is a psychedelic rock song written by Mick Jagger and Keith Richards, released as  single in the UK by The Rolling Stones on August 18, 1967. It went top ten in Britain, peaking at #8, but only made it to #50 in the United States.\n           &quot;2000 Light Years From Home&quot; is a song by The Rolling Stones from their 1967 psychedelic rock album, &quot;Their Satanic Majesties Request&quot;. It was written by Mick Jagger and Keith Richards and is famous for its space-like atmosphere.\n          &quot;The Green Manalishi (With the Two-Prong Crown)&quot; is a song written by Peter Green and recorded by Fleetwood Mac. It was released as a single in the UK in May 1970 and reached #10 on the British charts. The song was written during Green&amp;#039;s final months with the band, at a time when he was struggling with LSD and had grown withdrawn from other members of the band. Green has explained that he wrote the song after experiencing a drug-induced dream, in which he was visited by a green dog which barked at him. He understood that the dog represented money. &quot;It scared me because I knew the dog had been dead a long time. It was a stray and I was looking after it. But I was dead and had to fight to get back into my body, which I eventually did. When I woke up, the room was really black and I found myself writing the song.&quot; He also said that he wrote the lyrics the following day, in Richmond Park.The song later became a standby for heavy metal band Judas Priest, beginning in the late 1970s. The song has become so identified with Judas Priest that many fans mistakenly assume it to be a Priest original. \n\n","torrent":{"xt":"urn:btih:57bca499f38776d17aaf26729c76dcda4bb851ad","amp;dn":"The+Best+of+60%5C%27s+and+70%5C%27s+part+60+-+reseed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57bca499f38776d17aaf26729c76dcda4bb851ad","infoHashBuffer":{"type":"Buffer","data":[87,188,164,153,243,135,118,209,122,175,38,114,156,118,220,218,75,184,81,173]},"announce":[],"urlList":[]}}