{"title":"TomTom v6 plus keygen","uid":3925969,"size":1997156998,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:583f61f4f2a4bbe6bd9a28682b68c0dd89a60a17&amp;dn=TomTom+v6+plus+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brownrt","files":18,"time":1197091360,"description":"OK This is my first torrent post\n\nThis is TomTom 6 with Full United States and Canada Map as well as individual state maps.\n\nThis is for Palm devices and a host of Nokia phones and othe Windows Mobile Devices\n\n    I use this on my Treo 650 with a 2GB SD though using the large US and Canada map takes up less than a Gig of space. Loading the individual states takes up a bit over a gig on the card. I recommend using the large map as it is newer and has more P.O.I.&amp;#039;s \n\n\nTo install:\nThis part is en Espanol but itz easy\n\nMake sure your SD card is in your DEVICE FIRST\n\nUnzip TomTom Navigator 6 for Palm and run setup.exe. agree to terms and conditions.\nClick forward, select appropriate conditions i.e. Palm or other handheld\n\nclick forward and select Instalar TomTom v6.010 NOT Instalar Autorun v6.010\n\ngo through the process again and install the Guam map\ngo through the process again and select keygen this time\n\nput your card in your device and run the navigator to get your device id\nI think you have run the keygen with the guam map (which you can delete later) this will associate the upcoming files with the keygen\n\nselect mapa de Guam and follow onscreen directions\n\nnow you can use this code to activate your highly needed guam map for you navigational purposes. \n\n\nTo use the state maps you only need to copy the map folder to the root of your SD card.\n\nTo Use the large US/Canada map you must open the map folder and double click the lock and key icon labeled USA_and_Canada_v.675.1409 this will start the keygen. Same process as before. \n\nViola all done. ","torrent":{"xt":"urn:btih:583f61f4f2a4bbe6bd9a28682b68c0dd89a60a17","amp;dn":"TomTom+v6+plus+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"583f61f4f2a4bbe6bd9a28682b68c0dd89a60a17","infoHashBuffer":{"type":"Buffer","data":[88,63,97,244,242,164,187,230,189,154,40,104,43,104,192,221,137,166,10,23]},"announce":[],"urlList":[]}}