{"title":"El.show.de.Larry.David.1x05.DVB.Xvid.Mp3.[Spanish].[Bajand]","uid":3939225,"size":368552424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:58d189a2cd5c5ca5af3ded7525f22614f978f06f&amp;dn=El.show.de.Larry.David.1x05.DVB.Xvid.Mp3.%5BSpanish%5D.%5BBajand%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HISPA_NO","files":1,"time":1198024228,"description":"Larry David es una serie que ha conseguido el ÃƒÂ©xito en EE.UU. y en la que su protagonista se interpreta a sÃƒÂ­ mismo en situaciones de su vida cotidiana. La comedia ha sido galardonada con un Globo de Oro a la mejor serie y un premio Emmy a la mejor direcciÃƒÂ³n para Robert B. Weide.\nLarry David, el creador de la mÃƒÂ­tica Seinfield, da un giro al concepto de comedia en Larry David, producida por Warner. En esta particular producciÃƒÂ³n, el protagonista muestra imÃƒÂ¡genes de su vida cotidiana, que son recogidas por una ubicua cÃƒÂ¡mara que le sigue durante el dÃƒÂ­a. IrÃƒÂ³nico y desordenado, diluye rÃƒÂ¡pidamente las lÃƒÂ­neas que dividen la ficciÃƒÂ³n y la realidad para convertir al protagonista en un personaje que se encarna a sÃƒÂ­ mismo. Rodada con una cÃƒÂ¡mara de mano y haciendo uso del humor, trata de reflejar la vida del showman con situaciones cotidianas protagonizadas por su creador, Larry David. El formato, que recuerda a los reality shows, carece de guiÃƒÂ³n y se rige por unos bocetos escritos previamente por David. Las secuencias deben ser naturales, de tal manera que la ficciÃƒÂ³n se acerque a la realidad lo mÃƒÂ¡s posible.\nDesde Los Ãƒ?ngeles, Larry David vive y graba el dÃƒÂ­a a dÃƒÂ­a tanto en su casa como en su ambiente laboral. Todos los temas son tratados con humor e ironÃƒÂ­a, algo que engancha a la audiencia ya que la mayor parte de las situaciones que registran son algo embarazosas. Los personajes son tan cotidianos como la propia estÃƒÂ©tica de la producciÃƒÂ³n y es en este punto donde reside el atractivo de la serie, ya que no cuenta con pÃƒÂºblico ni efectos especiales. Solo representa lo real, lo que acontece en la vida de su protagonista.","torrent":{"xt":"urn:btih:58d189a2cd5c5ca5af3ded7525f22614f978f06f","amp;dn":"El.show.de.Larry.David.1x05.DVB.Xvid.Mp3.%5BSpanish%5D.%5BBajand%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58d189a2cd5c5ca5af3ded7525f22614f978f06f","infoHashBuffer":{"type":"Buffer","data":[88,209,137,162,205,92,92,165,175,61,237,117,37,242,38,20,249,120,240,111]},"announce":[],"urlList":[]}}