{"title":"Xbox - RLT - Pantom Dust","uid":3373825,"size":3636709245,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:590ca93263d30cbb5fe886d00e97e5fc425f15b4&amp;dn=Xbox+-+RLT+-+Pantom+Dust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shady78","files":1,"time":1124845626,"description":"ntsc\nenglish\n\n\nlink:\nhttp://www.xbox.com/en-us/phantomdust/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=phantomdust\n\nIn this strategic action game, players fight supernatural battles in a post-apocalyptic era. Phantom Dust? takes you from the safety of the underground to explore the surface with your unique abilities.\n \n\nPlay online or offline as one of the &quot;gifted ones.&quot; Use your psychic skills to defeat opponents as you search for your lost memories. Then, take the secrets you?ve learned and crush your competition on Xbox Live?.\n\n\nFeatures  \n \n \n\nGet ready for fast-paced action: Use more than 300 skills to damage opponents, steal their skills, and neutralize their psychic abilities. Special multiplayer game modes throw you straight into the action with prebuilt arsenals. \nBattle online with Xbox Live: Enjoy one-versus-three, two-versus-two co-op, and free-for-all multiplayer modes. Earn points in Xbox Live battles and use them to buy new skills only available online. Play in tournaments, ban together to create clans, track your progress on the online score boards, swap skills, and download new abilities and maps. \nPlay through more than 200 single-player missions: Build your skill inventory as you work your way through the game. Interact with nonplayable characters to learn more about your world, your skills, and yourself. \nInstantly change the world with destructible environments: Use the environment to your advantage. Cast a psychic skill against a wall to have it smash onto your opponent. Blast the floor under enemies to send them falling to their doom.  \nTry your hand at hundreds of skills: Win more than 300 skills by playing through the single-player missions and winning battles on Xbox Live. \nUse countless strategies: Choose your strategy based on the environment, the battle mode, your opponents? and allies? abilities, and your personal style. \n \n \nGame Information  \n \n \nPublisher\nMajesco \n\nDeveloper\nMicrosoft Game Studios \n\nStreet Date\nMarch 2005 \n\nPrice\n$39.99 \n\n \nRating\nTeen\n\n  Players 1-2 \n  Memory Unit 10 Blocks \n  Custom Soundtracks \n  In-game Dolby&amp;reg; Digital \n  System Link 2-4 \n  HDTV 480p \n  Communicator Headset","torrent":{"xt":"urn:btih:590ca93263d30cbb5fe886d00e97e5fc425f15b4","amp;dn":"Xbox+-+RLT+-+Pantom+Dust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"590ca93263d30cbb5fe886d00e97e5fc425f15b4","infoHashBuffer":{"type":"Buffer","data":[89,12,169,50,99,211,12,187,95,232,134,208,14,151,229,252,66,95,21,180]},"announce":[],"urlList":[]}}