{"title":"Xbox - RLT - WWE Wrestlemania XXI","uid":3371061,"size":2679627442,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:598e8257c8ce8aa8d88945eae33d56cf3d6b53a3&amp;dn=Xbox+-+RLT+-+WWE+Wrestlemania+XXI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shady78","files":1,"time":1124291090,"description":"NTSC\nENGLISH\n\n\nLINK:\nhttp://www.xbox.com/en-us/wrestlemania21/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=wrestlemania21\n\n\n\n\nWrestleMania can define a legacy, and yours is about to be written. The greatest spectacle in sports entertainment comes to Xbox&amp;reg; with WWE WrestleMania&amp;reg; 21. The WWE experience has never been more lifelike, with superstar voice-over and commentary, an all-new pro reversal system, and motion-capture technology, making this the most realistic-looking grappler to date. Create the ultimate superstar and watch him evolve as you earn new move-sets, costumes, and abilities in your quest for the WWE Heavyweight Championship. Build the perfect championship belt and defend it on Xbox Live? while gaining prestige with each victory you claim, or take on four of your friends in head-to-head competition online. WrestleMania 21 will immortalize your legacy forever. How will you become a legend?\n\n\n Features  \n \n \n\nSuperstar voice-over and commentary: Hear more voice-over than any previous WWE title.  \nBecome a legend online: Take your game onto Xbox Live, and try four-player head-to-head brawls with multiple match types and Voice Chat support. \nNew online create-a-belt feature: Gain prestige as you defend your belt against other online opponents and see where you rank among online legends. \nCharacter evolution: Play through a unique character-building story mode that lets you upgrade you superstar's appearance, abilities, entrance, costumes, and move-set as you attempt to win the Heavyweight Championship. \nSuperstar moves and animations: Bring the game to life like never before with motion-capture technology. \nPro reversal system: Experience the first wrestling game to ever feature a countering system that incorporates a contrary reversal for each and every attacking move. \n \n \nGame Information  \n \n \nPublisher\nTHQ \n\nDeveloper\nStudio Gigante \n\nStreet Date\nMarch 2005 \n\nPrice\n$49.99 \n\n \nRating\nTeen\n\nPlayers 1-4 \nCustom Soundtracks \nIn-game Dolby&amp;reg; Digital \nCommunicator Headset \n","torrent":{"xt":"urn:btih:598e8257c8ce8aa8d88945eae33d56cf3d6b53a3","amp;dn":"Xbox+-+RLT+-+WWE+Wrestlemania+XXI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"598e8257c8ce8aa8d88945eae33d56cf3d6b53a3","infoHashBuffer":{"type":"Buffer","data":[89,142,130,87,200,206,138,168,216,137,69,234,227,61,86,207,61,107,83,163]},"announce":[],"urlList":[]}}