{"title":"Growing Up in the Universe: Part 2: Designed and Designoid Objec","uid":3898988,"size":99876717,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5a46911ad94c8a3bffb3cb14b341c2b0bcf1c9f9&amp;dn=Growing+Up+in+the+Universe%3A+Part+2%3A+Designed+and+Designoid+Objec&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FuckYourReligion","files":1,"time":1195457840,"description":"Trouble with this torrent? You can also obtain this from the dedicated Richard Dawkins torrent server maintained by ResponsiveWeb LLC (www.responsiveweb.com) at http://216.128.88.40:6969/\n\n========================\n\nGrowing Up in the Universe is a series of lectures given by Richard Dawkins as part of the Royal Institution Christmas Lectures, where he discusses the evolution of life in the universe.\n\nThe lectures were first broadcast in 1991, in the form of five one-hour episodes, on the BBC in the UK. The Richard Dawkins Foundation for Reason and Science was granted the rights to the televised lectures, and a DVD version was released by the foundation on April 20, 2007.\n\nThis Torrent Contains \n Growing Up in the Universe: Part 2: Designed and Designoid Objects \n\nOther Torrents Available:\n Growing Up in the Universe: Part 1: Waking Up in the Universe \n Growing Up in the Universe: Part 3: Climbing Mount Improbable \n Growing Up in the Universe: Part 4: The Ultraviolet Garden \n Growing Up in the Universe: Part 5: The Genesis of Purpose  \n\n\nDawkins&amp;#039; second lecture of the series examines the problem of design. He presents the audience with a number of simple objects, such as rocks and crystals, and notes that these objects have been formed by simple laws of physics and are therefore not designed. He then examines some designed objects - including a microscope, an electronic calculator, a pocket watch, and a clay pot - and notes that none of these objects could have possibly come about by sheer luck. Dawkins then discusses what he calls &quot;designoid objects&quot;, which are complex objects that are neither simple, nor designed. Not only are they complex on the outside, they are also complex on the inside - perhaps billions of times more complex than a designed object such as a microscope.\n\nDawkins then shows the audience a number of designed and designoid objects, including the pitcher plant, megalithic mounds built by the compass termite, and pots made by trapdoor spiders, potter wasps, and mason bees. He examines some designoid objects that use camouflage, such as a grasshopper that looks like a stone, a sea horse that looks like sea weed, a leaf insect, a green snake, a stick insect, and a collection of butterflies that look like dead leaves when their wings are closed. Dawkins notes that many animals share similar types of camouflage or protection because of a process called convergent evolution. Examples of such designoid objects include the hedgehog and the spiny anteater (both of which evolved pointed spines along their back) and the marsupial wolf (which looks like a dog but is actually a marsupial). He illustrates the reason why convergent evolution occurs by using two small models of commercial aircraft. The reason they look similar isn&amp;#039;t due to industrial espionage, it is due to the fact that they are both built in order to fly, so they must make use of similar design principles.\n\nUsing a camera and a model eye, Dawkins then compares the designed camera with the designoid eye. Both are involved in similar processes - using a lens to direct light onto a film or a retina. Both the camera and the eye also have an iris, which is used to control the amount of light which is allowed in. Using a volunteer from the audience, Dawkins demonstrates the contraction of the human iris by shining a light into her right eye.\n\nThe lecture then moves into an explanation of natural selection, which brings forth designoid objects. In order to explain natural selection, Dawkins first explains artificial selection by discussing the evolution of wild cabbage into broccoli, cauliflower, cabbage, red cabbage, kohlrabi, and Brussel sprouts. He continues the discussion of artificial selection by explaining the evolution of the ancestral wolf into the many varieties of modern dog. Starting with the ancestral wolf, Dawkins imagines that everyone on one side of the room is breeding for small wolves, while everyone on the other side is breeding for big wolves. By selectively breeding the smallest or largest of each litter for a number of years, you may eventually end up with something like the Chihuahua on one side of the room, and something like a Great Dane on the other side of the room.\n\nDawkins then introduces an Arthromorphs computer program (similar to the Biomorphs program[1]), explaining how it works while a volunteer uses the computer to selectively breed more and more generations.\n\nAt this point, Dawkins switches from explaining artificial selection to explaining natural selection. In order to demonstrate natural selection in a computer program, Dawkins uses a program written by Peter Fuchs to simulate the evolution of the spiderweb. The program builds &quot;genetic&quot; variations of a parent web, as if the web was actually being built by a child spider. For each generation, a simulation is run which randomly generates flies - some of which will hit the web, and others that will miss it. The child web that is able to capture the highest number of flies is selected as the parent for the next generation of webs. Dawkins shows the audience the &quot;fossil record&quot; that the program recorded after simulating a large number of generations overnight. The web starts off very simple and inefficient, but by the end it has evolved into a web that is highly efficient and highly complex. This is the same process that has led to the existence of all designoid objects.\n\nDawkins now discusses the most popular alternative to natural selection, which is known as creationism. He explains that creationists mistakenly believe designoid objects to be designed objects created by a divine being. Quoting from William Paley&amp;#039;s Natural Theology, Dawkins discusses the argument from design using the example of the watch and the watchmaker. Even though designoid objects appear to be designed, Darwin proved that this is not the case. Although Darwin&amp;#039;s theory was discovered well after Paley developed his watchmaker argument, Dawkins explains that the argument of a divine watchmaker was still a bad argument, even in Paley&amp;#039;s day. Paraphrasing David Hume, Dawkins explains that anything capable of creating humans must itself be highly complicated. Thus, the argument from design actually explains nothing - &quot;shooting itself in the foot.&quot; While it is true that designoid objects cannot come about by chance, evolution provides a non-random method of creation - namely, natural selection.\n\nAfter developing the argument against a divine creator, Dawkins examines a number of designoid objects that contain imperfections, which is something you would not expect to find in an object that is supposedly created by a divine being. Showing the audience a halibut flatfish, he explains how they evolved from an upright swimming ancestor with one eye on each side of the head into a bottom-hugging flatfish with a distorted set of eyes on one side of the body. Dawkins claims that this is poorly designed, as any proper engineer would design an organism more like a skate, which flattened out on its belly instead of on its side. This is an example of something you would expect from an evolved/designoid object, but not something you would expect from a created/designed object.\n\nUsing labeled building blocks, Dawkins shows the audience how designed objects came to be. He starts off by placing the simple block on the bottom, and explaining that you don&amp;#039;t have to start with a complex being, but can start with a very simple foundation. If you have a simple foundation, you can place the next block on top - the designoid block. From this block, you can get complex organisms. Only after complex designoid objects come to be can you get the final building block of design (microscopes, clay pots, etc).\n\n\n========================\n\n\nThank you for downloading. Please seed in the name of education.\n\nCheers,\n\nThe Good Folks at ResponsiveWeb\nwww.responsiveweb.com\n1(888)RW2-HOST","torrent":{"xt":"urn:btih:5a46911ad94c8a3bffb3cb14b341c2b0bcf1c9f9","amp;dn":"Growing+Up+in+the+Universe%3A+Part+2%3A+Designed+and+Designoid+Objec","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a46911ad94c8a3bffb3cb14b341c2b0bcf1c9f9","infoHashBuffer":{"type":"Buffer","data":[90,70,145,26,217,76,138,59,255,179,203,20,179,65,194,176,188,241,201,249]},"announce":[],"urlList":[]}}