{"title":"Evernote Portable Edition Eng Full.","uid":3984453,"size":11841561,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a8afe50964ae822135e240b55d1e183fe5265c1&amp;dn=Evernote+Portable+Edition+Eng+Full.+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"snapped","files":1,"time":1200743643,"description":"EverNote Portable\nOverview\n \nEverNote Portable lets you keep EverNote on your USB drive, so all your notes stay with your wherever you go.\n$14.95 - Buy NowHoliday Sale price Regular price $19.95\nEverNote Portable is a light version of EverNote that allows you to keep your notes and databases on a USB drive, or SD card, and transport them among your various computers. EverNote Portable runs directly from your USB drive -giving you access to your notes without installing any software onto the host computer.\n\nWho is EverNote Portable for?\nEverNote Portable is designed for users who move frequently among different computers. For example, this is a good solution for those that have one computer in the office and another at home, but want to always have access to their EverNote notes and databases. \n\nFeatures\nKeeps your notes and databases with you wherever you go \nAllows you to take notes and find them whenever you need \nAccess your notes from any Windows computer without installing anything \nIncludes the EverNote Universal Clipper \nCompatibility\nUSB drives \nSD Cards \nLimitations\nEverNote Portable does not contain all the features of the full version of EverNote:\n\nIt does not include any EverNote Clippers other than the Universal Clipper. However, if EverNote Portable is run on a computer that has the EverNote Clippers installed, then EverNote Portable will be able to use the installed Clippers \nLinks between notes, as well as links from external applications to notes, are not supported in EverNote Portable \nEverNote databases (.enb files) will not be automatically associated with the EverNote application. It is user&amp;#039;s responsibility to create these associations. \nNote: In certain cases, EverNote Portable will make use of the Windows TEMP directory. Please ensure that you have adequate privileges to make changes to that directory.\n\nNote: This is a rar file housing a self extracting file. Then once all files hve been extracted just copy files to usb drive. Click on evernote shortcut to get started. ","torrent":{"xt":"urn:btih:5a8afe50964ae822135e240b55d1e183fe5265c1","amp;dn":"Evernote+Portable+Edition+Eng+Full.+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a8afe50964ae822135e240b55d1e183fe5265c1","infoHashBuffer":{"type":"Buffer","data":[90,138,254,80,150,74,232,34,19,94,36,11,85,209,225,131,254,82,101,193]},"announce":[],"urlList":[]}}