{"title":"Vecinos Invasores (Over the Hedge)","uid":3901559,"size":843960620,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ae4c0292180b5325059818048c224b205cfd05a&amp;dn=Vecinos+Invasores+%28Over+the+Hedge%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"imaginatelo","files":2,"time":1195593869,"description":"Despues de mucho tiempo de estar descargando peliculas supuestamente ripeadas de los dvds originales en cvcd, kvcd y otras variantes del mpg-1 y viendo que la calidad de imagen siempre fue deprimentemente mala o mediocre consiguiendo algunos una imagen &quot;supuestamente&quot; limpia al emborronar la imagen (filtro blur) para esconder los macrobloques (esos insoportables cuadraditos) sacrificando brutalmente la nitidez de la imagen original, me decidi a crear mi propio metodo de recodificacion y tomando en cuenta que siempre se ha dicho que lo mas dificil de recodificar son las animaciones decidi crear esta de Vecinos Invasores (Over the Hedge) entre muchisimas otras que he hecho para demostrar que eso no es mas que un mito, he mantenido e incluso creo superado la nitidez y el color del dvd original en un mpg-1 para un solo Cd. listo para quemarse como vcd no estandar y sin necesidad de cortar nada de la pelicula es decir hasta los creditos estan completos, asi mismo pongo la portada para estuche de Cd. en un archivo de Powerpoint solo usa una hoja A-4 e imprimela no necesitas modificarle nada.\nAsÃƒÂ­ que descargala disfrutala y por favor compartela con otros\n\nLos datos de la Pelicula son:\nResolucion de video 352 x 240 mpg-1\nRelacion de aspecto 4:3 T.V. Pantalla completa\nVelocidad de cuadros x segundo 23,976\nAudio mp2 estereo (Real) 128 kbps surround (simulado)\nIdioma espaÃƒÂ±ol (Latino)\n\nAgradeceria cualquier comentario al respecto, aunque estoy seguro que te va a sorprender la calidad de imagen y te aseguro que nunca has visto una asÃƒÂ­.\n\n","torrent":{"xt":"urn:btih:5ae4c0292180b5325059818048c224b205cfd05a","amp;dn":"Vecinos+Invasores+%28Over+the+Hedge%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ae4c0292180b5325059818048c224b205cfd05a","infoHashBuffer":{"type":"Buffer","data":[90,228,192,41,33,128,181,50,80,89,129,128,72,194,36,178,5,207,208,90]},"announce":[],"urlList":[]}}