{"title":"MillerÃ‚Â´s crossing","uid":3971250,"size":6755188736,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5b36f8afe8dfbd543471ffbbd615c271401da545&amp;dn=Miller%C3%82%C2%B4s+crossing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nonimo","files":21,"time":1200010930,"description":"Director:\nJoel Coen\nmore\nWriters:\nJoel Coen (written by) &amp;\nEthan Coen (written by)\nmore\nRelease Date:\nOctober 1990 (USA) more\nGenre:\nCrime / Drama / Thriller more\n\nIt Is Prohibition era 1930s as gang wars tear apart the city of gang lord Leo (Albert Finney) and his lieutenant Tom Regan (Gabriel Byrne). Tom is upset when Leo declines underling Johnny Caspar&amp;#039;s (Jon Polito) request to kill the crooked Bernie (John Turturro). Despite Toms objections, Leo thinks he made the right decision because Bernie is Vernas (Marcia Gay Harden) brother and Verna is LeoIs girl. Unfortunately, Caspar seems to be growing in power and just when Leo needs TomI is help most Tom admits is been fooling around with Verna. Tom is thrown out of Leo is mob and with nothing else to do he decides to join Caspar. But Tom is also talking to Bernie and Verna, and Caspar is ruthless henchman Eddie Dane (J.E. Freeman) starts to get suspicious. His suspicions rise when Tom is ordered to kill Bernie himself, but no one knows whether or not Tom carried out the order. Leaving Caspar searching for his desired power, Dane searching for answers, Verna searching for her brother and Tom searching for his own heart...if he has one anymore.\n\nIDIOMAS: Castellano 2.0 Surround, Ingles 4.0, Frances 2.0 Surround, Aleman 2.0 Surround e Italiano 2.0 Surround.\nSUBTITULOS: Castellano, Frances, Aleman, Italiano, Holandes, Sueco e Ingles para sordos.\nMENUS: Castellano, Ingles, Frances, Aleman e Italiano.","torrent":{"xt":"urn:btih:5b36f8afe8dfbd543471ffbbd615c271401da545","amp;dn":"Miller%C3%82%C2%B4s+crossing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b36f8afe8dfbd543471ffbbd615c271401da545","infoHashBuffer":{"type":"Buffer","data":[91,54,248,175,232,223,189,84,52,113,255,187,214,21,194,113,64,29,165,69]},"announce":[],"urlList":[]}}