{"title":"The Doors 8 albums (sidthefish)","uid":3978765,"size":404921923,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5bdb0cd95819a63f6c07d19f8e3694a0363360b0&amp;dn=The+Doors+8+albums+%28sidthefish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sidthefish","files":126,"time":1200427432,"description":"1967 - Doors\n1967 - Strange Days\n1968 - Waiting For The Sun\n1969 - The Soft Parade\n1970 - Morrison Hotel\n1971 - L.A. Woman\n1978 - An American Prayer\n1991 - In concert\n\n\nThe Doors were probably more controversial than they were influential, but they were certainly one of the signature rock bands of the 1960s. The group was formed in Los Angeles in 1965 by a pair of U.C.L.A. film students, keyboard player Ray Manzarek and vocalist Jim Morrison, along with guitarist Robby Krieger and drummer John Densmore. Because the group did not have a bass player their music was dominated by Manzarek&amp;#039;s distinctive electric organ work and Morrison&amp;#039;s evocative vocals of his evocative lyrics. Signed a year later to Elektra Records with the goal of capturing on vinyl what the group did in live performance, their self-titled debut album featured the hit &quot;Light My Fire&quot; and because of their distinctive sound became one of the best albums of psychedelic music. In fact, &quot;The Doors&quot; was such a great album that it made everything that came afterwards pale in comparison and gave credence to the idea the group was on a destructive arc fueled by Morrison&amp;#039;s personal problems and then went nova with &quot;Morrison Hotel&quot; and &quot;L.A. Women&quot; right before his death.\n\nThe music of the Doors was a peculiar blend of rock, blues, classical, jazz, and powerful lyrics. Nobody around played guitar like Krieger, while Manzarek&amp;#039;s classical influences showed up in his organ riffs, Densmore brought some Latin influences, and Morrison&amp;#039;s lyrics contained moments of searing emotional poetry. From the opening notes of &quot;Break on Through (To the Other Side)&quot; it is clear this group is different. For somebody who was consuming mass quantities of drugs and alcohol, Morrison&amp;#039;s lyrics were the sort that students should be discussing in literature class: &quot;I found an island in your arms/A country in your eyes,&quot; a love that becomes transmuted into &quot;arms that chain&quot; and &quot;Eyes that lie.&quot; Then the song explodes into sound as the band announces its presence with authority. This is such a key song in the history of the Doors that there is reason it leads off most anthologies and collections of their best songs.\n\n&quot;Light My Fire,&quot; and I can remember finally getting to listen to the long version having only heard the single version with the impressive, intricate organ solo that still stands alone as the epitome of what can be done with that instrument in a rock song. Then Jose Feliciano proved how good it was in his totally stripped down acoustic version. &quot;Take It As It Comes&quot; is also pretty good, even if not quite in that same class. Still, it is the moodiness of &quot;The Crystal Ship&quot; and the &quot;eleven-minute Oedipal drama&quot; of &quot;The End&quot; that defined the Doors as one of the strangest and most ambitious rock groups around. It is impossible to think of another Sixties rock group that was as disturbing as the Doors, an idea codified in popular culture by Francis Ford Coppola&amp;#039;s use of &quot;The End&quot; at the climax of &quot;Apocalypse Now.&quot; Not only literature classes but future psychologists and psychiatrists could have a field day analyzing Morrison&amp;#039;s lyrics as well. \n\n\n\n\nenjoy\n\nsidthefish","torrent":{"xt":"urn:btih:5bdb0cd95819a63f6c07d19f8e3694a0363360b0","amp;dn":"The+Doors+8+albums+%28sidthefish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bdb0cd95819a63f6c07d19f8e3694a0363360b0","infoHashBuffer":{"type":"Buffer","data":[91,219,12,217,88,25,166,63,108,7,209,159,142,54,148,160,54,51,96,176]},"announce":[],"urlList":[]}}