{"title":"Dwarf Fortress v0.27.169.33a","uid":3885036,"size":5569695,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5bfd6fe9731cc5d2f09f439716b7bf01161ff384&amp;dn=Dwarf+Fortress+v0.27.169.33a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sp1d3rx","files":1,"time":1194844973,"description":" Dwarf Fortress is a single-player fantasy game. You can control a dwarven outpost or an adventurer in a randomly generated, persistent world.\n\nAlthough Dwarf Fortress is still in a work in progress, many features have already been implemented.\n\n    * The world is randomly generated with distinct civilizations, dozens of towns, hundreds of caves and regions with various wildlife.\n    * The world persists as long as you like, over many games, recording history and tracking changes.\n    * Command your dwarves as they search for wealth in the mountain.\n          o Craft treasures and furniture from many materials and improve these objects with precious metals, jewels and more.\n          o Defend yourself against attacks from hostile civilizations, the wilderness and the depths.\n          o Support the nobility as they make demands of your populace.\n          o Keep your dwarves happy and read their thoughts as they work and relax.\n          o Z coordinate allows you to dig out fortresses with multiple levels. Build towers or conquer the depths.\n          o Build floodgates to divert water for farming or to drown your adversaries.\n          o Much much more...\n    * Play an adventurer and explore, quest for glory or seek vengeance.\n          o Meet adversaries from previous games.\n          o Recruit people in towns to come with you on your journey.\n          o Explore without cumbersome plot restrictions.\n          o Seamlessly wander the world -- 197376 x 197376 squares total -- or travel more rapidly on the region map.\n          o Accept quests from the town and civilization leaders.\n          o Retire and meet your old characters. Bring them along on an adventure with a new character or reactivate them and play directly.\n          o Z coordinate allows you to move seamlessly between dungeon levels and scale pyramids fighting adversaries above and below.\n    * The combat model uses skills, body parts, wrestling, charging and dodging between squares, bleeding, pain, nausea, and much more.\n    * A dynamic weather model tracks wind, humidity and air masses to create fronts, clouds, rain storms and blizzards.\n    * Over two hundred rock and mineral types are incorporated into the world, placed in their proper geological environments.\n    * Add new creatures, weapons, plants, metals and other objects via modifiable text files.\n    * Extended ASCII character set rendered in 16 colors (including black) as well as 8 background colors (including black).\n","torrent":{"xt":"urn:btih:5bfd6fe9731cc5d2f09f439716b7bf01161ff384","amp;dn":"Dwarf+Fortress+v0.27.169.33a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bfd6fe9731cc5d2f09f439716b7bf01161ff384","infoHashBuffer":{"type":"Buffer","data":[91,253,111,233,115,28,197,210,240,159,67,151,22,183,191,1,22,31,243,132]},"announce":[],"urlList":[]}}