{"title":"Half Past Dead for PSP","uid":3921124,"size":631289987,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:5d2c238a97b1579cf87df262458bc59fc564f3e2&amp;dn=Half+Past+Dead+for+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tsptorrent","files":2,"time":1196802265,"description":"For PSP\n\nA criminal mastermind has set in motion a plan to infiltrate a high tech prison in order to persuade a death row inmate to reveal the whereabouts of $200 million worth of gold. It&amp;#039;s up to an undercover FBI agent to stop him before it&amp;#039;s too late.  Written by Anonymous\n\nSascha Petrosevitch is a car thief who&amp;#039;s brought in by criminal Nick Frazier to work for crime boss Sonny Eckvall, who apparently shot and killed Sascha&amp;#039;s wife. When FBI Special Agent Ellen &quot;E. Z.&quot; Williams and her team show up to nail Nick, things go bad, and Sascha gets shot. After eight months of recovery following his brief bout of being clinically dead from the shooting, Sascha is incarcerated along with Nick in the newly reopened Alcatraz prison. Run by the charismatic warden, Juan Ruiz &quot;El Fuego&quot; Escarzaga, the place is known for its new state-of-the-art death chamber where the condemned can choose from five different ways to die -- lethal injection, gas chamber, hanging, firing squad, or electric chair. Lester McKenna is the first prisoner scheduled to be executed. An older man, Lester stole $200,000,000 worth of gold bricks in a heist that resulted in five deaths. Federal Bureau of Prisons head Frank Hubbard and Supreme Court Justice June McPherson have arrived to watch the execution, which is a result of June sentencing Lester. But she&amp;#039;s not the only one interested in Lester. A small but well-equipped team of terrorists -- the &quot;49ers&quot; -- have parachuted onto the island and gained control of it. Led by 49er One AKA Donny Johnson, Hubbard&amp;#039;s assistant, the team finds Lester, and wants him to give up the location of his hidden stash of gold. When Lester won&amp;#039;t tell them, Donny shoots a nearby priest and threatens to kill others if the info isn&amp;#039;t delivered. His plan is disrupted when Sascha decides to step in and fight back. It turns out that Sascha is an undercover FBI agent who&amp;#039;s been trying to use Nick to get to Sonny Eckvall. When Sascha rescues Lester, the 49ers strap June to the electric chair and threaten to kill her, while on the mainland, Ellen and her team plan an attack on the 49ers. With the help of Nick and other inmates such as Twitch and Little Joe, Sascha sets out to rescue June and bring Donny down, before Alcatraz becomes everyone&amp;#039;s final resting place. Written by Todd Baldridge\n\nA man who is scheduled to be executed for stealing 200 million dollars in gold, asks to see another inmate named Sasha; it seems that several months ago when the FBI raided the place where Sasha was, he was shot and was dead for a few minutes. Now the man wants to know Sasha&amp;#039;s experience before he goes. Before the execution can be carried out some men storm the prison and demand that the man tell them where he hid the gold, which he has never revealed. But in the process of breaking into the prison, they allow some of the inmates to be released. And led by Sasha, they try to stop them. Written by &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;daa8b9a9eaeeebeb9aa3bbb2b5b5f4b9b5b7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIn this movie, Steven Seagal and Ja Rule get put in the &quot;NEW ALCATRAZ&quot; apparently because Ja Rule kills a cop. While in jail they usually have fights with the security guard, a overweight lunatic. One day a man named Donny (Morris Chestnut) infiltrates a prison with a band of crooks looking for 200 million dollars worth of US gold. One of the inmates hid it. Now the inmates are retaliating, with Seagal and Ja Rule leading them. Written by Anonymous ","torrent":{"xt":"urn:btih:5d2c238a97b1579cf87df262458bc59fc564f3e2","amp;dn":"Half+Past+Dead+for+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d2c238a97b1579cf87df262458bc59fc564f3e2","infoHashBuffer":{"type":"Buffer","data":[93,44,35,138,151,177,87,156,248,125,242,98,69,139,197,159,197,100,243,226]},"announce":[],"urlList":[]}}