{"title":"Mr Big (UK) - Seppuku","uid":3363367,"size":66781184,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5d540764e07f0b1a678317db8aa3d26d2c4df8b8&amp;dn=Mr+Big+%28UK%29+-+Seppuku&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Alocacoc","files":12,"time":1122791220,"description":"Ian Hunter produced &quot;Seppuku&quot;, the third Mr Big album, in 1978 - but EMI decided not to release it at the time. It would not see the light of day until February 2001, when it was finally released by Angel Air Records. \n\nRecorded at: Chipping Norton Studios, Oxfordshire. Some work was done at the Manor.\n\nProduced by: Ian Hunter\n\nTrack listing: Senora / Woman / Place Your Bets / Here It Comes Again / Tonight / Lucy / Goosestep / You Won't See Me / Behind Enemy Lines / Come Rock With Me / Seppuku / Death Boy\n\nComments: all songs written by Dicken, except &quot;Senora&quot; by Dicken/Carter/Hunter \n\nDICKEN - lead &amp; backing vocals, acoustic &amp; electric guitars\nEDWARD CARTER - lead &amp; backing vocals, harmonica and tambourine, guitar\nPETER CROWTHER - bass guitar, acoustic guitars\nJOHN MARTER - drums\n\nwith IAN HUNTER - additional piano, organ, guitar\nwith PETER OXENDALE - keyboards \n\nwww.hunter-mott.com (February 2001) -\n(by Adrian Perkins) Mr Big were the English band in the mid-1970's fronted by Dicken, who hit the big time with their 1977 top-5 hit Romeo. They'd toured the UK supporting Queen on their Night At The Opera tour, and fame and fortune seemed just a step away. So it was that they entered the studios early in 1978 to record their third album, with Ian Hunter producing. If you've never heard Mr Big before, I'd say their style is similar to Styx, with Dicken sounding very much like Tommy Shaw. Senora is a great power ballad and briefly a single (why EMI withdrew it instead of pushing it is beyond me). Both Woman and Place Your Bets are lightweight, but that just throws a curve, because now's the time to test you audio system to its very limits and shake your house to its foundations. Here It Comes Again starts in the lightweight vein, with some soft piano before in comes some crunching guitar. The pace picks up for Tonight which really rocks. Lucy is great, a lovely ballad which just hits the spot. Dicken has a way of hitting the emotional nail right on the head. The pace picks up again for Goosestep, and its a adrenaline-fuelled dash for the finish as rocker after rocker hits you. Come Rock With Me is great, a total flat out rocker, and Death Boy finishes the album off in fine style. The CD comes complete with a 16-page booklet chronicling Mr Big's (and Dicken's) career and contains a complete Dicken worldwide discography. I find it unbelievable that EMI chose not to release this album first time round (in 1978). It is to Angel Air's credit they have tracked down the master tapes and finally released this album. It is not just a good album, it is a great album that will appeal to anyone who likes guitar-based rock. Essential.\n\n&quot;Record Collector&quot; (April 2001 - issue 260) -\n(by Tim Jones) The 70s Brit band led by Dicken recorded this 12-track opus in 1978 but it's been in the vaults till now. At the time, despite the plaudits lauded on Dicken by its producer, Ian Hunter, record company execs got cold feet on the mix of hard rockin', AOR, glam-pop and pomp. But while it's a variegated brew, there are some excellent numbers, from the glammy vocoder-assisted &quot;Woman&quot; to the Queen-esque &quot;Here It Comes Again&quot;, replete with full-on harmonies, building piano and synths, and a tough backbeat. A couple of tunes are too of their time - &quot;Tonight&quot; mixes ska-tinged Police with Thin Lizzy, and &quot;Goosestep&quot; has a frantic 2-Tone shuffle. But &quot;Behind Enemy Lines&quot; is a brooding hard rocker, &quot;You Won't See Me&quot; is a superb slab of hard AOR, and the title tracks brings to mind Saxon at their majestic best, culminating in an epic finale. Well worth collaring.\n\nClassic Rock (April 2001) -\n(by Dave Ling) ...Consigned to the Abbey Road vaults in 1978, 'Seppuku' was intended to be English five-piece Mr.Big's third album. That a major label would simply bury a record as good as this is unfathomable...Even more puzzingly, 'Seppuku' was overseen by no less a star than Ian Hunter...Hunter's praise for Mr Big head honcho Dicken seemingly knew no bounds...such lavish praise wasn't wholy without substance...Two decades later, the members of Mr Big must still be pondering the cruel insanity of the music business.\n","torrent":{"xt":"urn:btih:5d540764e07f0b1a678317db8aa3d26d2c4df8b8","amp;dn":"Mr+Big+%28UK%29+-+Seppuku","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d540764e07f0b1a678317db8aa3d26d2c4df8b8","infoHashBuffer":{"type":"Buffer","data":[93,84,7,100,224,127,11,26,103,131,23,219,138,163,210,109,44,77,248,184]},"announce":[],"urlList":[]}}