{"title":"13terShop Windows.zip","uid":3973559,"size":2373425628,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5d7bf1a5cf535e3471839bb4746d3fe1b14898b7&amp;dn=13terShop+Windows.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"deadletters63","files":1,"time":1200135082,"description":"Florian Thalhofer und Kolja Mensing\n\n[13terShop]\n\nEin Korsakow-Film. \nSoundtrack von Jim Avignon\nHardcover, 80 S. farbig, 90 Min. \n\nISBN 978-3-938539-07-1\n\n\nIm Mikrokosmos des Einkaufszentrums ueberlagern sich die sozialen Bereiche Arbeit, Freizeit und Konsum und formen ein neues Lebensgefuehl. Im 21. Jahrhundert ist der &quot;mall walker&quot; nicht einfach nur Kunde - er ist der Bewohner einer ganzen Welt, die ueber materielle Beduerfnisse laengst hinausgewachsen ist. \n\n31 Tage lang lebten der Filmemacher Florian Thalhofer und der Autor Kolja Mensing ununterbrochen in einem Einkaufszentrum. Ausgestattet mit Videokamera, Notizbuch und Laptop machten sie sich auf die Suche nach den Menschen in diesem kuenstlichen Raum und dokumentieren auch die Veraenderungen an sich selbst. Auf den Ladenstrassen, in den Geschaeftsraeumen und entlang der Sonderverkaufsbereiche haben sie Stimmen eingefangen und zu kleinen Alltagsromanen verdichtet. Da gibt es etwa die junge Centermanagerin, die sehr persoenliche Eindruecke von Ihrer Arbeit in einem von Maennern dominierten Karriereweg schildert, den Hobby-Astrologen, der jeden Tag im Center sitzt und jedem gegen einen Kaffee Mut zuspricht und die Reinigungsfrau, die den Filmemachern gleich Ihre ganze tragische Lebensgeschichte offenlegt. \n\nDiese Geschichten sind nun im Buch und auf der DVD zu lesen und zu sehen: literarische Texte, Bilder und ein 90-minuetiger Korsakow-Film auf DVD-Rom, musikalisch exklusiv unterstuetzt von Jim Avignon. Nach der Hochhaus- Reportage [13terStock] von 2005 nun also der zweite Teil der Doku-Reihe der beiden Berliner Kuenstler.\n\nText- und Filmproben auf www.13tershop.de\t\t","torrent":{"xt":"urn:btih:5d7bf1a5cf535e3471839bb4746d3fe1b14898b7","amp;dn":"13terShop+Windows.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7bf1a5cf535e3471839bb4746d3fe1b14898b7","infoHashBuffer":{"type":"Buffer","data":[93,123,241,165,207,83,94,52,113,131,155,180,116,109,63,225,177,72,152,183]},"announce":[],"urlList":[]}}