{"title":"Knight Rider Season One","uid":3351984,"size":8051499008,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5db44e46a4df9debc8c949d1f0b3ab42dc81f4b9&amp;dn=Knight+Rider+Season+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CodeFuture","files":21,"time":1120453974,"description":"&quot;One man can make a difference,&quot; intones a dying millionaire--well, one man and a superduper car, backed with millions of dollars! Welcome to the deliciously ridiculous world of Knight Rider, the early '80s TV series that launched the career of David Hasselhoff and his magnificent coif (both later seen in the insanely popular Baywatch). After being shot in the face, detective Michael Long is revived as Michael Knight (Hasselhoff) and partnered with an indestructible talking car called K.I.T.T. (voiced by William Daniels). The duo travel around the country solving crimes--basically, it's The Lone Ranger with the car as Silver and Tonto combined. Supported by finicky British executive Devon Myles (Edward Mulhare) and sexy engineer Bonnie Barstow (Patricia McPherson), Knight and K.I.T.T. take on everything from motorcycle gangs to corporate crooks to K.I.T.T.'s own evil twin, K.A.R.R. \nLike any good cheese, Knight Rider has only grown more pungent with age. Decked out in alarming '80s fashions (check out that blue Members Only jacket in the pilot), earnestly spouting some of the worst dialogue in the history of television, the absurdly handsome Hasselhoff radiates the unique charisma that's made him a Teutonic cult figure. In addition to the 21 episodes of the first season, Knight Rider: Season One includes a 1991 TV movie, Knight Rider 2000, that tried to launch a revamped series set in the near future (lacking the cheerful touch of creator Glen Larson, the attempt sank into oblivion) and brief interview footage (including Hasselhoff describing when he read the original script: &quot;It was glowing in my hands. This was gold.&quot;) It's unlikely this boxed set will appeal to anyone who didn't become a fan of the show at an impressionable age, but for those fans, Knight Rider: Season One is gold. --Bret Fetzer \n\n","torrent":{"xt":"urn:btih:5db44e46a4df9debc8c949d1f0b3ab42dc81f4b9","amp;dn":"Knight+Rider+Season+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db44e46a4df9debc8c949d1f0b3ab42dc81f4b9","infoHashBuffer":{"type":"Buffer","data":[93,180,78,70,164,223,157,235,200,201,73,209,240,179,171,66,220,129,244,185]},"announce":[],"urlList":[]}}