{"title":"Xbox - RLT - Mafia","uid":3367265,"size":3670543896,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:5e2a94d6160371d01d5831d16895ff6f999c15e9&amp;dn=Xbox+-+RLT+-+Mafia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shady78","files":1,"time":1123534537,"description":"NTSC\nENGLISH\n\n\n\nLINK:\nhttp://www.xbox.com/en-us/mafia/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=mafia\n\n\n\nJumping at the chance to work with the Salieri crime family, Tommy soon realizes there?s only one way to get out with his life and enough money to escape. If this doesn?t work, he?ll just be another Salieri hit. This is Mafia: the greatest gaming crime drama ever told.\n\n\n Features  \n \n \n\nAction-packed missions: More than 20 missions with tasks including mob hits, car chases, bootlegging, shootouts, assassinations, bank robberies, or simply escorting your love. \nImmersive environments: More than 12 square miles of city, with intelligent simulated traffic, landmarks, and surrounding countryside. Lost Heaven, a fictional city, was created with reference to authentic buildings and photos during this time period, resulting in a highly immersive and realistic environment. \nMore than 30 highly detailed, high polygon indoor locations: Rendered through the latest 3-D engine technology. Take a trip through a city of the 1930s, visit locations such as the airport, banks, galleries, restaurants, harbor, and many others. \nEpic story line: Inspired by real incidents that took place in the 1930s. The story is conveyed by spoken dialogue and motion-captured animations taken from professional actors. Mafia is one of the greatest crime dramas ever told in gaming! \n60 historic cars: Meticulously recreated according to the car models that were on the road in the 1930s. Faithful reproduction of their style and physics make car chases unlike any other console game. \nHuge selection of weapons: More than 12 weapons to choose from, including baseball bats, sawed-off shotguns, Magnums, or the legendary Thompson sub-machine gun to deal with those who cross your path.","torrent":{"xt":"urn:btih:5e2a94d6160371d01d5831d16895ff6f999c15e9","amp;dn":"Xbox+-+RLT+-+Mafia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e2a94d6160371d01d5831d16895ff6f999c15e9","infoHashBuffer":{"type":"Buffer","data":[94,42,148,214,22,3,113,208,29,88,49,209,104,149,255,111,153,156,21,233]},"announce":[],"urlList":[]}}