{"title":"T O K 3 N - Video 1 Runescape PK Video","uid":4002732,"size":104761031,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5e674c7b43a526a573f89f06688cdd55080b8bfd&amp;dn=T+O+K+3+N+-+Video+1+Runescape+PK+Video&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Doodlepieguy","files":1,"time":1201651606,"description":"PKer: T O K 3 N\nPK Category: Maxed Runepure\nLocation: Edgebased\nVideo: 1\nReleased: December &amp;#039;07\nEditor: Julz\nLength: 9:57\n\nSummary: Out of nowhere appeared Tok3n, like a messenger of God, returning to prove to us all that the maxed rune pure will live on. Between the release of piety and the release of the god sword, the maxed rune pure was in a very, very bad place. They were fighting people with their same strength capabilities, but had defense and prayer levels to replace the strength and attack levels that the rune pure had worked so hard to perfect on a low defense account.\n\nAnyway, I thought maxed rune pures were a lost cause. Elvian proved with his fifth video that there were still possibilities to be successful as a rune pure, but to do so, that player needed to sacrifice attack levels and the use of the abyssal whip.\n\nBut with upon the release of the God Sword, a new opportunity was granted to the rune pure. Were they as strong as they had once been? I wouldn&amp;#039;t say so. But they had a fighting chance -- briefly before the removal of the wilderness. And T O K 3 N monopolized on this offer for success.\n\nIn this video, he does something few Rune Pures would dare -- skull in fury in order to get skulled dharok fights. This is incredibly risky given his low defense, and the odds stacked against him when he fights a player with not only 25 more defense levels, but also much stronger armor.\n\nIn any event, with the help of Bandos Godsword, T O K 3 N was able to successfully pull off the first progressive and entertaining maxed rune pure video since T H E Do0rs 5th. Julz&amp;#039;s editing is spectacular, and would be the first in line of a trend of many well-edited videos. It seems now to be a pattern to have someone else edit videos, and editors themselves are finally getting the attention they deserve. This was the first time I encountered this practice to such a successful degree. The reason this video is so amazing is that all odds were stacked against it, yet it was able to produce results in spite of this factor.\n\n--\n\nSeeded by Doodlepieguy. Doodle can be contacted on the forums of Runevillage.com, under the user name &amp;#039;Doodle&amp;#039;.\t\t","torrent":{"xt":"urn:btih:5e674c7b43a526a573f89f06688cdd55080b8bfd","amp;dn":"T+O+K+3+N+-+Video+1+Runescape+PK+Video","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e674c7b43a526a573f89f06688cdd55080b8bfd","infoHashBuffer":{"type":"Buffer","data":[94,103,76,123,67,165,38,165,115,248,159,6,104,140,221,85,8,11,139,253]},"announce":[],"urlList":[]}}