{"title":"Sydney.White.2007.SWESUB.DVDRip.XviD-FETANKA","uid":3995429,"size":1461719040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:615976df90ee1cc1cccaa6e1a1cd6dc6a7ab84ea&amp;dn=Sydney.White.2007.SWESUB.DVDRip.XviD-FETANKA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FETANKA","files":2,"time":1201290238,"description":"After pledging her late-mother&amp;#039;s once dignified sorority, a college freshman aligns herself with seven social outcasts in an attempt to influence change over the school&amp;#039;s flawed social hierarchy in this comedy starring Amanda Bynes. College freshman Sydney White (Bynes) has just arrived at Southern Atlantic University ready and eager to pledge her late mother&amp;#039;s sorority. Once upon a time this sorority was dignified and respected, but that pristine reputation has been tarnished now that blonde tyrant Rachel (Sara Paxton) has taken over as Student Council President. After surviving the sorority&amp;#039;s vigorous pledging process, Syd is quickly banished for daring to question Rachel&amp;#039;s regime. Now left with nowhere to go but a condemned house on the edge of Greek Row, the dejected and rejected pledge quickly makes friends with seven of the biggest social outcasts on campus. But while these socially challenged frat boys may not be much to look at, it gradually becomes apparent to Syd that they all have their fare share of admirable qualities - especially love-struck super-geek Tyler (Matt Long). Perhaps if these nerdy frat boys and their new queen could successfully shake up the system by staging a successful takeover of the student government, the could restore the once-proud reputation of this prestigious university and offer a glimmer of hope to campus geeks everywhere!\n\nFETANKA | Tankafett . com","torrent":{"xt":"urn:btih:615976df90ee1cc1cccaa6e1a1cd6dc6a7ab84ea","amp;dn":"Sydney.White.2007.SWESUB.DVDRip.XviD-FETANKA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"615976df90ee1cc1cccaa6e1a1cd6dc6a7ab84ea","infoHashBuffer":{"type":"Buffer","data":[97,89,118,223,144,238,28,193,204,202,166,225,161,205,109,198,167,171,132,234]},"announce":[],"urlList":[]}}