{"title":"Idiocracy - (Luke Wilson) - Mike Judge wrote and directed","uid":3984957,"size":284760038,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6196dd6f3114cdc6e0ad7f894b8ff28270fa2f44&amp;dn=Idiocracy+-+%28Luke+Wilson%29+-+Mike+Judge+wrote+and+directed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"st2580smile","files":1,"time":1200762096,"description":"Plot Synopsis\n\nMike Judge wrote and directed this offbeat sci-fi comedy which gives a new meaning to the expression &quot;people are getting dumber all the time.&quot; In 2005, Pvt. Joe Bowers (Luke Wilson) is a soldier chosen to take part in a secret military scientific experiment in which he will be put into induced hibernation for one year, along with a woman named Rita (Maya Rudolph). Bowers is chosen for the assignment because he is statistically the most average man in the Army, while Rita is a hooker ordered to do some community service; however, Bowers and Rita are forgotten when the military base where the experiment took place is closed down, and when they wake up in the year 2505, Bowers finds himself living in a society where intelligence has taken such a landslide he&amp;#039;s now the smartest man in the world. Can Bowers save America from its own remarkable stupidity, and he can he get the dunderheads around him to believe what he says? Produced under the title 3001, Idiocracy also stars Dax Shepard as Bowers&amp;#039;s numb-skull lawyer, Stephen Root as a judge, and Terry Crews as Camacho, a former porn star and professional wrestler who is now president of the United \n \n(AMG)","torrent":{"xt":"urn:btih:6196dd6f3114cdc6e0ad7f894b8ff28270fa2f44","amp;dn":"Idiocracy+-+%28Luke+Wilson%29+-+Mike+Judge+wrote+and+directed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6196dd6f3114cdc6e0ad7f894b8ff28270fa2f44","infoHashBuffer":{"type":"Buffer","data":[97,150,221,111,49,20,205,198,224,173,127,137,75,143,242,130,112,250,47,68]},"announce":[],"urlList":[]}}