{"title":"La Isla TS-Screener XviD -Spanish-","uid":3367654,"size":1167313963,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6274f2d7a09f2e80c5872f8c1698bd4a41f494b9&amp;dn=La+Isla+TS-Screener+XviD+-Spanish-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Divxtotal.CoM","files":5,"time":1123619530,"description":"Lincoln Eco-Seis (Ewan McGregor) y Jordan Delta-Dos (Scarlett Johansson) se encuentran entre los cientos de residentes de un complejo cerrado a mediados del siglo XXI. Al igual que todos los habitantes de este entorno cuidado-samente controlado, todo en sus vidas cotidianas est&amp;aacute; controlado, aparentemente por su propio bien. La &amp;uacute;nica salida ?y la esperanza que todos comparten? es ser elegido para ir a &quot;La isla&quot;, el &amp;uacute;ltimo rinc&amp;oacute;n sin contaminar del mundo tras un desastre ecol&amp;oacute;gico que, seg&amp;uacute;n se dice, se cobr&amp;oacute; las vidas de todos los habitantes del pla-neta? excepto las de ellos. Lincoln, que &amp;uacute;ltimamente se ve acosa-do por pesadillas inexplicables, est&amp;aacute; inquieto y se cuestiona cada vez m&amp;aacute;s las restricciones que le han impuesto a su vida. Pero la verdad le coge desprevenido cuando su creciente curiosidad le lleva al terrible descubrimiento de que todo sobre su existencia es men-tira, que la isla es un cruel enga&amp;ntilde;o? y que &amp;eacute;l, Jordan, y todos a los que conocen son m&amp;aacute;s valiosos muertos que vivos. Sin tiempo que perder, Lincoln y Jordan emprenden una arriesgada huida a un mundo exterior que nunca han conocido. Una vez que est&amp;aacute;n en el exterior y lejos de la indiscreta mirada del instituto, la inocente amistad que compartieron comienza a convertirse en algo m&amp;aacute;s pro-fundo. Pero con las fuerzas del complejo persigui&amp;eacute;ndoles de forma implacable, Lincoln y Jordan tienen una misi&amp;oacute;n primordial: vivir.","torrent":{"xt":"urn:btih:6274f2d7a09f2e80c5872f8c1698bd4a41f494b9","amp;dn":"La+Isla+TS-Screener+XviD+-Spanish-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6274f2d7a09f2e80c5872f8c1698bd4a41f494b9","infoHashBuffer":{"type":"Buffer","data":[98,116,242,215,160,159,46,128,197,135,47,140,22,152,189,74,65,244,148,185]},"announce":[],"urlList":[]}}