{"title":"iGuidance 3.0 GPS software by iNav (US version)","uid":3917343,"size":1815868803,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6411874addfd9e56a265c22a27a898fd39fdf1ee&amp;dn=iGuidance+3.0+GPS+software+by+iNav+%28US+version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sporg","files":12,"time":1196556738,"description":"Iguidance 3.0 by Inav.\n\nNotes:\n\nOk after downloading this program from a torrent I discovered some annoying bugs. These bugs were caused by the fact that this program was intially on four CD&amp;#039;s. One CD had the installation files on it and the other three contained the Mapdata files for generating the maps.\n\nThe original uploader packaged the contents of the four CD&amp;#039;s into one image file. If you mounted it like that the Iguidance maploader often got confused and could not locate the mapdata files it needs to create your maps.\n\nTo solve the issue I made each data CD into a seperate image file which can be mounted whenever the maploader requests it (using daemon tools or similar) or burned to its own CD.\n\nBe aware that if you decide to burn the Data CDs you will have to use CDs which are larger than the standard 700MB CDs you find at your local shop.\n\nMaps in this edition cover the United States,Alaska,Hawaii.\n\n\nInstallation:\n\nTo install the program once downloaded you open the Iguidance folder and click setup. It does not require a serial number to install.\n\nOnce the program installs click on the maploader icon which is now on your desktop. This is the utility you use to create the maps Iguide needs to function. At this point is where you will need to mount the CD images  as virtual drives or insert the CD&amp;#039;s you created as asked for by the Maploader.\n\nThe maploader creates the maps from the data CD&amp;#039;s and saves them into the maps folder in your Iguidance directory. I would recommend only loading one or two states at a time becasue it can take quite a while for the maploader to create them. Loading a new state deletes whatever maps you already had in your maps folder.  \n\nHopefully this information will help avoid a bunch of &quot;it doesnt work&quot; comments\n\n-sporg","torrent":{"xt":"urn:btih:6411874addfd9e56a265c22a27a898fd39fdf1ee","amp;dn":"iGuidance+3.0+GPS+software+by+iNav+%28US+version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6411874addfd9e56a265c22a27a898fd39fdf1ee","infoHashBuffer":{"type":"Buffer","data":[100,17,135,74,221,253,158,86,162,101,194,42,39,168,152,253,57,253,241,238]},"announce":[],"urlList":[]}}