{"title":"[PSP]GRETZKY[USA] + Launcher.rar","uid":3360536,"size":75038995,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:64c4f70ff64b6f836940bd6f551143f33d990ce8&amp;dn=%5BPSP%5DGRETZKY%5BUSA%5D+%2B+Launcher.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thedios","files":1,"time":1122231481,"description":"Gamers can take their hockey game on the road and play anytime, anywhere with Gretzkyâ„¢ NHL&amp;reg; for the PSPâ„¢ handheld entertainment system. Officially licensed by the NHL and NHLPA, Gretzky NHL for the PSP features fast-paced skating, precision passing, bone-jarring checks and players that convey the power and emotion of their sport. To challenge the skill levels of all hockey videogame fans, Gretzky NHL for the PSP offers the Gretzky Challenge with unlockable, playable Gretzkys from his days as an Edmonton Oiler, Los Angeles King or New York Ranger. Additionally, hockey fans can play a quick game in either Quick Start or Exhibition Mode, act as owners in Season Mode, or compete locally against friends or other hockey fans in head-to-head play via wireless multiplayer connectivity. By combining authentic gameplay, intuitive play controls and an enhanced presentation with the fast, fluid, hard-hitting intensity of arcade style play, Gretzky NHL for the PSP delivers the look, feel and passion of hockey and provides gamers with a true-to-life simulation.","torrent":{"xt":"urn:btih:64c4f70ff64b6f836940bd6f551143f33d990ce8","amp;dn":"%5BPSP%5DGRETZKY%5BUSA%5D+%2B+Launcher.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64c4f70ff64b6f836940bd6f551143f33d990ce8","infoHashBuffer":{"type":"Buffer","data":[100,196,247,15,246,75,111,131,105,64,189,111,85,17,67,243,61,153,12,232]},"announce":[],"urlList":[]}}