{"title":"Benjamin_Fulford_on_Jeff_Rense_070507_FULL.mp3","uid":3760116,"size":44823969,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:652a9bf907a2ee565a93d69421d860e0bb0de7b6&amp;dn=Benjamin_Fulford_on_Jeff_Rense_070507_FULL.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"theratt","files":1,"time":1186013053,"description":"Benjamin Fulford, 46, is a Tokyo based journalist who appeared on the Jeff Rense Program, July 5th 2007, making some very radical claims. According to Fulford, a Chinese secret society with 6 million members, including 1.8 million Asian gangsters and 100,000 professional assassins, have targeted Illuminati members if they proceed with world depopulation plans. They contacted Fulford, a Canadian ex pat, after he warned that the Illuminati plan to reduce the Asian population to just 500 million by means of race-specific biological weapons. Essentially, this secret society, with Fulford as their spokesperson, is taking on the Illuminati!\n\nTRANSCRIPT\n\n-HOUR ONE-\n\nRENSE: I think we\\&amp;#039;re up and running here. A little rocky, the day after the fourth of July, but I think we\\&amp;#039;re connected to Japan.\n\nThis is going to be interesting. An awful lot of email has been coming in about the story from Dr. Henry Makow, Ph.D., called \\&quot;Chinese Secret Society Challenges Illuminati.\\&quot; This is a very interesting story, something the likes of which I have not seen in all the years of doing this program or website.\n\nThe author is Benjamin Fulford - the author quoted in the story. He is a North American, Canadian to be specific, expatriate living in Japan now. Let\\&amp;#039;s just bring him on and say hello, see how he\\&amp;#039;s doing and check this connection out. Are you there, Ben?\n\nFULFORD: Yeah, I\\&amp;#039;m here.\n\nRENSE: OK, we\\&amp;#039;ve got a little bit of delay.\n\nFULFORD: It\\&amp;#039;s a cell phone, so the reception is not so good.\n\nRENSE: Well, you sound all right. There\\&amp;#039;s a bit of a delay, so we\\&amp;#039;ll have to deal with that.\n\nA lot of people have been asking me, could this be real? Is this a hoax? Is this a joke? What is it? We\\&amp;#039;re going to find out much more about this story, so stay with us tonight as we continue this conversation with Benjamin Fulford.\n\nHe is the former Asia-Pacific bureau chief for Forbes Magazine, and he quit in disgust when Forbes refused to run a damaging story about one of its advertisers. Boy, I know that game, and many of us in the media do - [those] who try to tell as close to the truth as we can without losing our jobs. In this case, Ben did eventually lose his job, because Forbes wouldn\\&amp;#039;t back him. It\\&amp;#039;s a story I\\&amp;#039;ve heard before.\n\nHe speaks as a very principled man - a reporter, journalist in the best tradition. Let\\&amp;#039;s find out from Ben exactly what happened.\n\nFirst of all, Ben, when were you named Asian bureau chief for Forbes, and what was your background before that, if you would?\n\nFULFORD: Okay. I\\&amp;#039;ve been a journalist in Japan for about 20 years. I was bureau chief for Forbes from 1998 to 2004-2005.\n\nRENSE: That\\&amp;#039;s a good long stretch.\n\nFULFORD: Then I left for a lot of different complications.\n\nRENSE: Your relationship with Forbes, up until the time you decided to part ways with them, was how? You were there with them for almost eight years, I guess.\n\nFULFORD: It started out as a rather cushy job. They let me investigate a lot of stuff about Japanese organized crime and the seedier side of things in Japan. However, at a certain point I seemed to be getting too close to something they didn\\&amp;#039;t want me to get to, and they started stopping stories.\n\nThere was a corruption story about GE that didn\\&amp;#039;t make it. Another one about Citibank didn\\&amp;#039;t make it.\n\nThen when I finally found out there was an anti-virus software company who was actually making viruses, that was it.\n\nRENSE: [Laughs] Yeah.\n\nFULFORD: That was the last straw for me.\n\nRENSE: They do that, I\\&amp;#039;ve heard. Why not? Once in a while you hear about firemen actually starting fires. I don\\&amp;#039;t know, it\\&amp;#039;s bizarre. That\\&amp;#039;s what software companies that are in the anti-virus protection business are accused of doing from time to time - if not directly, then indirectly. It wouldn\\&amp;#039;t surprise me.\n\nWhen did you learn to speak Japanese?\n\nFULFORD: Well, I went to university in Japan. I came here when I was 19, and I\\&amp;#039;ve been here more than 20 years, so I just got it early on.\n\nRENSE: Did it come easy to you?\n\nFULFORD: Well, it\\&amp;#039;s a very difficult language. Not grammatically, but because you have to grasp a whole new way of thinking. You have to understand that Asian culture and Western culture parted ways about 40,000 years ago.\n\nRENSE: [Laughs]\n\nFULFORD: That means there\\&amp;#039;s 40,000 years of folk wisdom that you have to catch up with to really understand what\\&amp;#039;s going on, and that\\&amp;#039;s very, very difficult.\n\nRENSE: You mean four thousand, instead of forty thousand. There was nobody around back then, supposedly.\n\nFULFORD: What I mean is genetic tests show that\\&amp;#039;s when we separated - Orientals and Caucasians.\n\nRENSE: I got it. Okay. Now with respect to the Asian mind, Western minds - the American mind in particular, we\\&amp;#039;ll just keep it to North America and Canada - are not basically understood.\n\nI predicate that statement on not having been there, not having any experience, but having talked to the former TIME bureau chief for Beijing on the [Rense] program some years ago. He said, when I asked him what the Asian mind thought about American Western diplomacy, in China specifically, he laughed. He said they consider Americans to be but children in a sandbox. That\\&amp;#039;s the gulf we\\&amp;#039;re talking about here.\n\nNow would that remark ring true to you in any way?\n\nFULFORD: Yes, in part. Another way they look at Western society is as a slave society.\n\nRENSE: Slave society?\n\nFULFORD: A slave society.\n\nRENSE: Well, indeed it is. Go ahead.\n\nFULFORD: Controlled in secret by a group of, well, Huckleberry Finn slave drivers.\n\nRENSE: Well, we call them Illuminati, we call them Bilderbergers, CFR, Trilateral Commission. We can throw in Skull and Bones, the Club of Rome, the Fabian Society - all sorts of secret cartels, cabals and groups.\n\nBut at the top, it\\&amp;#039;s a fairly singular power source, and it is certainly one of slave-owner to slaves. The encumbering of the slaves is becoming ever more adroit. With each passing month, it seems, the technology and politics are changing so quickly over here.\n\nThe view from Japan of North America. Let\\&amp;#039;s talk about the United States. How is it for you, an expatriate from Canada?\n\nFULFORD: Living in Japan, you mean?\n\nRENSE: Yeah. What\\&amp;#039;s it look like over there? What we\\&amp;#039;re doing over here. And I mean \\&amp;#039;we\\&amp;#039; with President Bush, Vice President Cheney, of course enjoying the lowest ratings, probably, in Presidential and Vice Presidential history. The American polls show the respect for the US Congress virtually around 14-15 percent in terms of job satisfaction. So tell me more.\n\nFULFORD: It looks like maybe Russia did just before the Iron Curtain fell. It looks like a huge sea change is about to happen. Like the biggest thing since the Declaration of Independence, I think.\n\nRENSE: Well yes, almost the antithesis of [the Declaration of Independence]. I can see how that would be a view from over there, and it\\&amp;#039;s probably far more loaded with merit than we would like to agree.\n\nThings are happening over here, as I think you well know, at a very rapid pace now. The controllers are literally pushing things in the American public\\&amp;#039;s face that are so unconstitutional and illegal as to be laughable, if they weren\\&amp;#039;t so tragic.\n\nFULFORD: I think these people are scared. They are trying to carry out a plan. They are desperate now. Their plan is so horrendous and so bizarre, it provokes a split - even within their own ranks.\n\nRENSE: I\\&amp;#039;ve heard talk of factions. You mentioned the words \\&quot;they are desperate,\\&quot; the key word being \\&amp;#039;desperate.\\&amp;#039; There are others who have said the same kind of thing - [the controllers] sense there is a window through which they must move, now, if they are ever going to move. Do you agree with that?\n\nFULFORD: Yes. Let me tell you something. I was offered the job of finance minister in Japan by the Freemasons. Okay?\n\nRENSE: When?\n\nFULFORD: I brought [my case against] David Rockefeller. I actually was able to link him to some murders of bankers and other people in Japan, as a part of his effort to take over the Japanese financial system.\n\nWhen I confronted the former Japanese finance minister, Heizo Takanaka (ph) with this, he sent a ninja, believe it or not - a real live ninja - who offered me a gold Freemason badge. He told me I could either accept a job of great power or be killed.\n\nAt first I thought I had no choice, I had to go along, which is what happens to a lot of people when they get pulled into this. But then the Chinese secret society showed up and offered me protection. So that\\&amp;#039;s why I can talk about this.\n\nI want to tell you. I got right inside, right at the very top. Anybody up to a 33rd degree Freemason is a chump. They think they\\&amp;#039;re doing good for humankind and they\\&amp;#039;re doing God\\&amp;#039;s work. There are 13 degrees above the 33rd degree.\n\nRENSE: So I\\&amp;#039;ve heard.\n\nFULFORD: The first thing they learn is that there is no God. We are God. This is what they are taught. And they are, believe it or not, the descendants of Babylonian pirates. This goes back almost 6000 years. It\\&amp;#039;s ancient Babylonian slave-driver technology.\n\nThey use a combination of bribes, murder, ostracism, mind control, whatever. They have a huge arsenal. They think very, very long term.\n\nThe story I\\&amp;#039;ve figured out now is that when they started with the Zionism, they had this plan to make a capital in Jerusalem. A lot of the religious Jews thought of this as blasphemy, but they actually did it.\n\n[Bumper music begins]\n\nAnd then there was a convergence. There was a really radical faction that had this plan to eliminate Christianity. Now this is going to sound so horrendous, believe me...\n\nRENSE: Hold on right there, Ben. Let me ask you to pause. We\\&amp;#039;ll take a break, and come back to that thought. Eliminating Christianity. Very interesting.\n\nLots already on the table here. My guest is Benjamin Fulford, the former Asia-Pacific bureau chief for Forbes magazine, who has just a stunningly provocative piece up on the site written by Dr. Henry Makow, Ph.D., who interviewed Ben at great length. You\\&amp;#039;ll see it up there on Featured Stories, on the left hand side of my home page.\n\nSo by all means, take a look. Right under that, a story written by Benjamin Fulford - the Secret History of the Freemasons in Japan - as well. Be back in a minute.\n\n[Break]\n\nRENSE: Okay, back with Benjamin Fulford, live from Tokyo. He, by the way, has published 15 books written in Japanese, with cumulative sales running at over half a million copies. He\\&amp;#039;s got his own weekly two-hour television program over there, appears frequently on numerous other nationally broadcast programs in Japan, and has regular columns in a variety of best-selling Japanese magazines.\n\nMy guest, Benjamin Fulford. Lucky to connect with him. At showtime we couldn\\&amp;#039;t get through to his land line, which I had a hunch might be the case. These controversial subjects, one never knows who might be playing phone games. We have him on the line right now.\n\nGo ahead and tell us, then, what this story about abolishing Christianity is about. Is that about the one world, New World Order religion?\n\nFULFORD: Yes. What I first got wind of was a plan to kill Asians - reduce the population of Asians. They told me, once I was invited in, that they had a plan to reduce the population of Asians.\n\nRENSE: Okay, excuse me, Ben, but when you say \\&quot;They invited you in,\\&quot; who is \\&amp;#039;They\\&amp;#039; and what were you \\&amp;#039;in\\&amp;#039;?\n\nFULFORD: What happened was I interviewed Heizo Takanaka (ph), the former Japanese finance minister.\n\nRENSE: What year was this, approximately?\n\nFULFORD: This year, in fact. I hit a tender spot. I confronted him with having sold the Japanese financial system over to the Rockefellers. Then he sent the ninja, who offered me to join the Freemasons. They offered me the job as finance minister.\n\nRENSE: If I might interject here, please explain what it is. Most Americans and most listening in Canada, or wherever they\\&amp;#039;re listening from around the world, won\\&amp;#039;t understand why or how the Rockefellers are so heavily entrenched and powerful in Japan. In point of fact, the Rockefellers, I guess, own much of Japan, and have since World War Two. So tell us a little bit about that background, if you would.\n\nFULFORD: The Rockefellers, you have to understand their real influence. Everybody outside of America seems to know how powerful they are, but they try to hide this fact from their own people. You have to go back to the very first Rockefeller. You have to go back to 1918. This is what Forbes magazine figured out...\n\nRENSE: John Rockefeller?\n\nFULFORD: Yeah. He was worth about 250 billion in today\\&amp;#039;s money. And the ten richest people controlled about 70 percent of the money supply. This was before they took over the financial system - the Fed.\n\nWhat they\\&amp;#039;ve done is hidden it all through a series of charitable foundations. There\\&amp;#039;s over two hundred, three hundred foundations. They use this to finance universities, to finance research. So they control through money, and they hide it through these foundations.\n\nIf you do a check, you will see David Rockefeller is only worth three billion or so. That\\&amp;#039;s because the rest of it is hidden in these charitable foundations, which they own and control.\n\nRENSE: Okay, name a few of them. Just give us a few.\n\nFULFORD: Well, the Rockefeller foundation, for one. There\\&amp;#039;s a whole bunch. Just look under Google with Rockefeller and Foundation, and you\\&amp;#039;ll see so many. They\\&amp;#039;re always considered the secret rulers of the United States, and much of the world.\n\nThey are the hidden patriarchs of this secret government.\n\nRENSE: Okay. How did the Rockefellers, on the planet, stand up to the Rothschilds?\n\nFULFORD: There is an alliance and a split as well. The Rothschilds originally set the Rockefellers up. They helped them monopolize oil. What happened was the Rockefellers got very strong, and became the more dominant partners in the whole enterprise.\n\nEurope is still basically controlled by the Rothschilds. The head of the Rothschild side of the clan is Phillip Rothschild, in London. There is another group that controls France, Belgium and Holland, which is the Grand Lodge of the Orient in France, and is another branch of the Rothschilds.\n\nThere was a German branch of the Rothschilds. They have laid low since Hitler was purged.\n\nYou have to think of it as royalty. Royal families interbred with old financial families. They interbreed with each other and they keep control that way. The Freemasons are one of the secret societies they use to control European and North American society.\n\nRENSE: Who uses the Freemasons? The Rothschilds or the Rockefellers, or both?\n\nFULFORD: They both do. They also control Mossad and the CIA, as far as I can tell. Most of the people in the CIA think they\\&amp;#039;re working for the United States of America. The reality is they are working for robber barons.\n\nSo that\\&amp;#039;s how people look at the United States. They look at it as an enclave controlled by the Rothschilds and the Rockefellers.\n\nRENSE: How did that extend to Japan? By virtue of the victory in World War II?\n\nFULFORD: Yes. It keeps being a Rothschild sphere of influence and became a Rockefeller sphere of influence. You have to understand the Japanese were pretty independent before World War II, but they had close associations with the Rothschilds, who originally financed their modernization.\n\nRENSE: They also pushed the Japanese to engage in the Russo-Japanese war, did they not?\n\nFULFORD: Yes. Absolutely. They armed them for it, and they helped them, and it was a very successful venture. The Japanese had a deep gratitude as a result.\n\n[Bumper music]\n\nTo this day, they have very friendly feelings.\n\nRENSE: All right. Let\\&amp;#039;s pause on that, and we\\&amp;#039;ll come back and find out about the eradication of Christianity on the planet, and the Masonic influence, being of course employed at the behest of the Rockefellers and / or the Rothschilds. So we\\&amp;#039;ll explore that.\n\nMy guest is Benjamin Fulford, who has a dynamite article up there, courtesy of the superb, I call him brilliant writer, Henry Makow, Ph.D., who did a lot of research on this and interviewed Ben at great length. We\\&amp;#039;re very honored to have it. You\\&amp;#039;ll see it up there in Featured Stories. \\&quot;Chinese Secret Society Challenges Illuminati.\\&quot;\n\nBe right back with Ben Fulford in just a minute.\n\n[Break]\n\nRENSE: Okay, back with Benjamin Fulford. Read the article by Dr. Henry Makow, Ph.D., \\&quot;Chinese Secret Society Challenges Illuminati,\\&quot; and then read the article by Ben Fulford right under that, in the Featured Story box at &lt;http://rense.com/&gt;Rense.com. Click on Ben\\&amp;#039;s name, go to his own website in English. It\\&amp;#039;s his own website, in Japanese, of course, but he\\&amp;#039;s got one for all of us folks as well.\n\nOkay, the plan to eliminate Christianity. Now you mentioned how the Rothschilds and the Zionists set up their Jerusalem and their Middle East.\n\nFULFORD: What they did was they tried to make the Bible prophecy come true, without the intervention of God. In other words, they did it. It wasn\\&amp;#039;t any Divine intervention.\n\nSo they are God. They believe themselves to be as powerful as God. [They believe] there is no God; they are the equivalent [of God] on Earth. They are the descendants of Babylonian tyrants.\n\nSo one thing I\\&amp;#039;ve been hearing, and this was disturbing - when I was invited to join - was that they did plan to reduce the world\\&amp;#039;s population by seven billion people.\n\nRENSE: This goes back to Global 2000. One more word about this severely atheistic organization, which is using organized religion to hide behind, as they always have. It\\&amp;#039;s not a big surprise. And of course, that leads to all kinds of difficulties, shall we say. But it\\&amp;#039;s an interesting thing to know.\n\nOkay. You were invited to join the organization. A Rockefeller ninja was sent to make you an offer you could not refuse. But you decided not to accept.\n\nFULFORD: Yes.\n\nRENSE: How did you decide not to accept? We have plenty of time. So you get the offer, and what happened?\n\nFULFORD: The next day I get contacted by a gentleman who says he represents a Chinese secret society.\n\nRENSE: The very next day.\n\nFULFORD: The very next day.\n\nRENSE: And how did that person know to contact you the very next day? How did you determine later on that he or she might have known that?\n\nFULFORD: I don\\&amp;#039;t know. They keep their secrets quite well. I assume they have a mole very high up in the organization. You have to understand that the Chinese secret society also has deep roots in Japan. Maybe I should give you a brief history of these people.\n\nI recognized them from the history books. So when they approached me, I already had some knowledge about them.\n\nRENSE: May I ask another question? How did they approach you? Did they call you and say, \\&quot;Ben, we\\&amp;#039;d like to talk to you,\\&quot; or did they just come knocking at your door? What happened?\n\nFULFORD: I got a phone call from a gentleman who said he\\&amp;#039;d like to meet me and talk about something important.\n\nRENSE: Was he speaking English or Japanese?\n\nFULFORD: Japanese.\n\nRENSE: All right. So let\\&amp;#039;s go back and do a little history on this organization now.\n\nFULFORD: Okay. The Ming dynasty was the high point in Chinese history. This was when their civilization reached a peak. They were invaded by some very uncouth barbarians known as the Manchus. When this happened, the Ming army - they were betrayed by a border general - became an underground organization, a secret society.\n\nSo there are two branches. The old Ming army and the old Ming navy. These are their descendants.\n\nThey wanted to over throw the Qing [formed by the Manchus] and restore the Ming. Their first big attempt was what we know of as the Boxer Rebellion. Then later they got huge help from the Japanese royal family, from the Meiji.\n\nRENSE: That\\&amp;#039;s M-E-I-J-I, correct?\n\nFULFORD: Yeah. These are the people who modernized Japan. So we\\&amp;#039;re talking about the beginning of the 1900s.\n\nRENSE: So the Meiji family modernized Japan at the beginning of the 1900s. All right.\n\nFULFORD: Yeah. It was a bunch of Freemasons set up by the Rothschilds.\n\nRENSE: That\\&amp;#039;s how the Rothschilds first got involved with Japan and China. I understand.\n\nFULFORD: Right. Unknown to the Rothschilds - or maybe they knew at the time, I don\\&amp;#039;t know - the Japanese helped this Chinese secret society overthrow the Ming dynasty. They also got help from Chinatowns all over the world, which is where they have their bases. This is how Sun Yat-Sen overthrew the last emperor.\n\nRENSE: So you\\&amp;#039;re saying, in a way, Sun Yat-Sen was a tool of the Masons, who were a tool of the Rothschilds.\n\nFULFORD: Well, in appearances it is like that. The Asians don\\&amp;#039;t particularly want to be ruled by white people, so it doesn\\&amp;#039;t really work in fact all around. They\\&amp;#039;ll take their money, but they\\&amp;#039;re not going to do everything they\\&amp;#039;re told.\n\nRENSE: That was the political mechanism, in so many words. That\\&amp;#039;s how Sun Yat-Sen assumed power. Okay.\n\nFULFORD: He was later ousted. As you know, the Japanese invaded China, and they were trying to take it over. It was a huge battle over the future of the planet, which evolved into World War II. They were fighting a proxy war in China for over a decade before World War II started.\n\nRENSE: Very few Americans understand that.\n\nFULFORD: The secret society ended up fighting the communist Chinese, being defeated and going underground.\n\nRENSE: So they were a part of Chiang Kai-Shek\\&amp;#039;s apparatus. They were supporting him, allies?\n\nFULFORD: Well, they were allied with him, as I said, but not part of his apparatus.\n\nRENSE: Okay, so they were fighting with him, supporting him, and he lost. Okay. Mao Zedong?\n\nFULFORD: ...was financed by the Soviet Union, by the Rothschilds on that side of the equation. Then they kicked out the connection in the 1960s, and China became independent from Rothschild and Freemason control.\n\nRENSE: Was that a big shock to the Rothschilds at the time, or did they see it coming?\n\nFULFORD: No! It was a big shock. There was all this talk about \\&quot;who lost China?\\&quot; This was a major blow for them. But they never really controlled China. Like I said, the Chinese were on to them, and onto their game. They weren\\&amp;#039;t going to be fooled.\n\nRENSE: How did the British East India Company and the opium wars play into this in the 18th and 19th centuries?\n\nFULFORD: The story there is the British - while everyone else was buying lots of tea and had nothing to pay for it with - invaded China, unfortunately to buy opium, so they could have their tea. That was a war of invasion. But they couldn\\&amp;#039;t control China. It was just too big for them to manage. So instead they just threatened them and kept them as a vassal state, in that sense.\n\nRENSE: They had enough trouble with the United States before, and it was known as the colonies, but yes - trying to control China, I can see, would be virtually [impossible].\n\nFULFORD: It\\&amp;#039;s worth noting that the Skull and Bones were opium and slave traders. So they were deeply involved in all this.\n\nRENSE: A lot of Zionists were in the slave trade too. A tremendous Zionist / Jewish participation in that filthy business.\n\nFULFORD: Sure. There is still trading going on to this day.\n\nRENSE: Well, that\\&amp;#039;s called white slavery. I don\\&amp;#039;t know how many tens of thousands, if not hundreds of thousands of women and children are sold into slavery through various conduits that often run into Israel every year.\n\n[Bumper music]\n\nFULFORD: Sure.\n\nRENSE: All right, Benjamin, we\\&amp;#039;ll come right back in our conversation with Benjamin Fulford. Do visit his website, and do visit &lt;http://rense.com/&gt;Rense.com. Look for his article about the Freemasons and their history as well. It\\&amp;#039;s in the fifth featured story down - \\&quot;The Secret History of the Freemasons in Japan.\\&quot; Be right back.\n\n[Break]\n\nRENSE: Okay. Back with Benjamin Fulford. We\\&amp;#039;re going to pursue the issue of Christianity and its future, or lack thereof, in a few minutes. We\\&amp;#039;re doing a little background now on the Chinese secret society, which actually came to the rescue, as it were. Ben would either be filthy rich now, or dead.\n\nFULFORD: [Laughs]\n\nRENSE: [Laughs] Go ahead.\n\nFULFORD: Just to divert a bit, it is what is known in folklore as making a deal with the Devil, right? They offer you, I would have been finance minister and I would have earned billions of dollars - looting the Japanese to finance genocide.\n\nRENSE: Which goes back to our earlier comment about reducing the world population, which we\\&amp;#039;re going to get to. We have a lot of time tonight. That, of course, goes back to the actual printed projection of reducing the world population called Global 2000, by 75 or 80 percent. But we\\&amp;#039;ll get back to that in a few minutes. Go ahead.\n\nFULFORD: When I left the Chinese, at first I didn\\&amp;#039;t know what to make of it.\n\nRENSE: How was your meeting with them, Ben? Did they come to your place and sit down and talk to you?\n\nFULFORD: No, no. In a hotel room.\n\nRENSE: Was it one person or two?\n\nFULFORD: Two people.\n\nRENSE: Male or female?\n\nFULFORD: Male.\n\nRENSE: Dressed?\n\nFULFORD: Dressed in pretty ordinary, not very expensive-looking clothing.\n\nRENSE: Okay. They sat you down. You had never heard about this secret society before, correct?\n\nFULFORD: Oh, I had, I had!\n\nRENSE: But not in terms of it being active to the extent that it might pop up in your life. You\\&amp;#039;d heard about it in the past.\n\nFULFORD: I\\&amp;#039;ve studied Chinese history. I read about them in the history books as the Green and the Red Gang, who fought the communists in Shanghai, in 1949.\n\nRENSE: That was my point. Go ahead, please.\n\nFULFORD: For me it was like a ghost from the history books appearing in front of me. They told me they had a membership worldwide of six million, including 1.8 million gangsters - all the Asian gangsters in the world - and 100,000 professional assassins.\n\nNow, I wasn\\&amp;#039;t sure whether or not to believe these people. I later flew to Taiwan and met the heads. We were surrounded by hundreds and hundreds of men in black suits who looked like gangsters. I was getting some martial arts displays.\n\nI believe they are not lying when they say they have six million members, and a lot of them are gangsters.\n\nRENSE: Now are they headquartered in Taiwan, or did they just pick that as a meeting place for you?\n\nFULFORD: No. They are headquartered in Taiwan. It\\&amp;#039;s a very secret organization. They don\\&amp;#039;t really have a building where they say, \\&quot;This is our headquarters.\\&quot;\n\nRENSE: They\\&amp;#039;ve been there since Chiang Kai-Shek fled there in 1949, I guess, and before that.\n\nFULFORD: They\\&amp;#039;ve infiltrated the Chinese government right up to the politburo level. They are all over China and all over the world. The Japanese Yakuza gangs are also a part of this. Many of them.\n\nRENSE: The Yakuza?\n\nFULFORD: Yes. Yakuza gangsters. There\\&amp;#039;s about 150 thousand of them throughout Japan.\n\nRENSE: Let\\&amp;#039;s talk for a moment about their projection of power in the United States. There are a lot of Asians now, some Asian gangs. Certainly there are Chinatowns around the US. In every big city there is a Chinese community. Are they projecting power through those various locations and venues?\n\nFULFORD: Absolutely. They are everywhere. Remember that 2/3rds of the members are scholars, not gangsters. These will be people working as researchers, for example, in government laboratories, or as university professors.\n\nRENSE: Now we know, Ben, there are lots of Chinese over here in the United States. At the university level, certainly doing contract work for very important corporations. By the tens of thousands, they are over here. Now is this People\\&amp;#039;s Liberation Army, or is this a secret society, or is it both?\n\nFULFORD: These people are anti-Communist. You\\&amp;#039;ve got to get that clear. They are not part of the People\\&amp;#039;s Republic of China.\n\nRENSE: So the PLA has spies all over the place here, but the secret society is not part of that. They are completely opposed to it.\n\nFULFORD: Yeah. They are a totally separate organization. But they do have membership, of course, in the Chinese secret police, et cetera. It\\&amp;#039;s a weird mix.\n\nIf they do have one loyalty, the rules I was told were to protect the weak, fight against injustice, to help each other. There is nothing I would find morally objectionable in what they told me were their codes. It just reads like a book of morals.\n\nRENSE: It sounds like good old-fashioned values. That would work here.\n\nSo you had this meeting in Taiwan. Where did that take place, and what was the meeting like? Who were the people you met with? I don\\&amp;#039;t expect you to name them or show us pictures on the Internet, but what did these people say?\n\nFULFORD: Well, it was a meeting upstairs in a small Chinese restaurant, in a small, nondescript room.\n\nRENSE: Geez! It sounds like a Hollywood movie!\n\nFULFORD: [Laughs] Yeah! And these guys looked like something out of a Hollywood movie. Some of them were missing like four fingers. One guy I met said he personally killed a hundred people. They were pretty scary, funky people, let me tell you that. Some of them.\n\nSome of them had two Ph.D.\\&amp;#039;s, and were very sophisticated and charming.\n\nRENSE: The core group you met with were numbered how many?\n\nFULFORD: Well, there was a dozen, and then the real core... I don\\&amp;#039;t know how much I should be able to disclose, but, you know, I mean, uh...\n\nRENSE: Well, you don\\&amp;#039;t have to go any further than you don\\&amp;#039;t want to.\n\nFULFORD: They explained to me - they understood the urgency, that there was a genocide plan, and they were manufacturing diseases.\n\nRENSE: When I said you don\\&amp;#039;t have to go any further than you don\\&amp;#039;t want to, I imagine you don\\&amp;#039;t have to go any further than you want to, of course. I misspoke there. The gist of this, the crux of this thing was their concern of an ethnic-specific bio-weapon, perhaps, or something along those lines, that would eradicate much of the Asian population base?\n\nFULFORD: Yes. And SARS was artificially manufactured.\n\nRENSE: SARS, of course, first popped up in Guangdong Province in China, I believe, where the Chinese maintain, the People\\&amp;#039;s Liberation Army has one or two bio-weapons labs in Guangdong. Guangdong is also where H5N1 seemingly originated. That\\&amp;#039;s one of the most lethal strains of it in the bird community worldwide.\n\nSo yeah, interesting. Go right ahead.\n\nFULFORD: They don\\&amp;#039;t like the idea of plans to wipe out... what the Japanese freemason told me, the one connected to Rockefeller, was the plan was to reduce Asia\\&amp;#039;s population to 500 million. And Japan was ordered to reduce their population to 75 million.\n\nRENSE: Ordered by?\n\nFULFORD: By the Rockefellers and the Freemasons, and these interbred Illuminati. They tried to do it from birth control, which is ideal, but if not, then through disease or war - whatever is necessary.\n\nRENSE: Okay. You mentioned SARS, and it broke out. Interestingly enough, I\\&amp;#039;m going to make a point here. I think it\\&amp;#039;s very germane. You\\&amp;#039;re an ex-Canadian. Now SARS took a big toll of people in Canada - healthcare workers in hospitals specifically. In one hospital I know they lost a lot of people.\n\nAt one point in the SARS - we won\\&amp;#039;t call it an epidemic, but in the SARS outbreak here, they printed, in a major Canadian newspaper, pictures of all the fatalities of SARS in Canada. And there were about 50 to 100, Ben.\n\nI looked at those pictures and I said to myself, \\&quot;Uh-oh. SARS comes from China.\\&quot; I looked at these pictures, and all but 2 or 3 or 4 of the people - and let\\&amp;#039;s just say there were 50 - were Asians! They were all Asians!\n\nFULFORD: SARS affects people with only a certain genotype - and most of these people are Asian.\n\nRENSE: All right. That ties in with the picture I saw.\n\nFULFORD: Look at the Project for a New American Century, page 60, \\&quot;Rebuilding America\\&amp;#039;s Defenses.\\&quot; They are saying bio-weapons that can target specific genotypes can be used for political tools.\n\nRENSE: Well, they\\&amp;#039;ve had that capability for 20-25 years, at least. They can target blue eyes, green eyes, blonde hair, brown hair, height, weight. Certainly anything to do with race or genetics can be programmed into bio-weapons. That\\&amp;#039;s not a surprise.\n\nThe SARS thing was, in your opinion, what? Something introduced by the West to let the Chinese know that they are going to get...\n\nFULFORD: They were going to attempt to cull the Chinese population.\n\nRENSE: So that was a full-blown attempt to massively infect China with some kind of a pandemic that would wipe out a great deal of the people there? That wasn\\&amp;#039;t just an experiment or a calling card or a wake-up call?\n\nFULFORD: No. I believe it was a sincere attempt to kill them. And of course, people don\\&amp;#039;t like being killed, which is why this society re-activated itself after being dormant for so many years. It\\&amp;#039;s like an emergency fire brigade. Normally people just go about their lives and do their jobs - they don\\&amp;#039;t do anything illegal. But if there is a crisis, they all band together.\n\nAn interesting thing, as a digression. When Sun Yat-Sen took over, he found the Imperial Treasure - a horde of treasure built up by the Chinese emperors over the millennia. When the Communists took over, some of this treasure was shipped off to the National Palace Museum in Taiwan, but some of it was hidden in a mountain in China.\n\nThe Communists tortured three thousand people to try to find out where it was, and nobody spoke. This is their emergency war chest, which they will dig up and spend if they feel...\n\nRENSE: You mean the secret society.\n\nFULFORD: Yes.\n\nRENSE: Okay. So the Chinese communists could not find half of the treasure. Half went to Taiwan, half remained on the mainland. This is the secret society\\&amp;#039;s bankroll?\n\nFULFORD: Yes. It\\&amp;#039;s their emergency fund for rainy days.\n\nRENSE: It must be a pretty handsome fund for rainy days.\n\nFULFORD: Yes. It\\&amp;#039;s [worth] billions of dollars.\n\nRENSE: Yeah, I would think. Stand by, if you would, Ben. We have to take a break here and will be back momentarily. We\\&amp;#039;ll come right back and continue our wide-ranging conversation. It\\&amp;#039;s quite focused, really, when you look at the totality of it.\n\nAgain, SARS, when you look at Ben Fulford and his Chinese / Asian contact, was an attack. He believes it was a full-blown attack to unleash a bio-specific agent in China, a virus, to wipe out most Chinese.\n\nThat might account for some of the exclamations of the Chinese general staff, the second in command of the military, who has said twice now that China is preparing to wage and to win a nuclear war with the United States. Now maybe he was talking about the Rockefeller interests in the United States. I don\\&amp;#039;t know.\n\nThis is an interesting conversation, to put it mildly. Benjamin Fulford is my guest. We\\&amp;#039;ll be right back with hour number two of our conversation in a few minutes.\n\n[Break]\n\n-HOUR TWO-\n\nRENSE: Okay, back with Benjamin Fulford, the former Asian-Pacific bureau chief for Forbes Magazine for eight years. He\\&amp;#039;s got quite a CV. You can see it on his website by clicking on his name at &lt;http://rense.com/&gt;Rense.com.\n\nWe\\&amp;#039;re talking about the Asian / Chinese secret society, which has tentacles all over the world. It is more than concerned about the plans, and apparently one failed attempt, to massively reduce the Chinese population, enroute to an overall world population reduction of some 80 percent. At least that\\&amp;#039;s our understanding of the plans of a faction of the world elite, the Illuminati, the controllers, and so forth.\n\nAgain, a very fascinating conversation. In the Featured Story section of &lt;http://rense.com/&gt;Rense.com, Dr. Henry Makow\\&amp;#039;s article, \\&quot;Chinese Secret Society Challenges Illuminati,\\&quot; all about Ben Fulford. Ben\\&amp;#039;s article underneath it, \\&quot;The Secret History of the Freemasons in Japan,\\&quot; is a very interesting history lesson in and of itself.\n\nOkay, Ben. You had your meeting in Taiwan. You met upstairs in a rather plain, nondescript room in a Chinese restaurant. You met with these guys. They are well-dressed guys at this point, would you say?\n\nFULFORD: Some of them were obviously billionaires, and some were senior government figures. Some of them...\n\nRENSE: How could you think they were obviously billionaires, Ben? What was it about them that made you feel that?\n\nFULFORD: Well, the list of companies they owned...\n\nRENSE: Did they present their own CV to you to prove their pedigree?\n\nFULFORD: [With] some of them, you can see their faces in the newspaper all the time.\n\nRENSE: I see. Okay. With your knowledge, you knew who some of them were.\n\nFULFORD: Yeah.\n\nRENSE: And again, some of them, Ben Fulford would never have guessed. These are professional people, they\\&amp;#039;re not bums. Here they are, saying \\&quot;Ben, we trust you not to talk about this too much. And what we\\&amp;#039;re trying to do is...\\&quot;\n\nWhat did they say they were trying to accomplish?\n\nFULFORD: They want to stop these people, obviously.\n\nRENSE: Who are \\&amp;#039;these people\\&amp;#039;? The Rockefeller, Rothschild, Freemasons and Illuminati?\n\nFULFORD: The Rockefellers, the Illuminati families.\n\nRENSE: Would you call them anti-Asian? Westerners? What would you call them?\n\nFULFORD: They are racists, but they are more than that. They want to enslave humanity.\n\nRENSE: Okay. And the fewer the number left around, the easier it is to enslave them. So they want a skeleton crew, so to speak, left in China to run things.\n\nFULFORD: They like the Chinese. They want to keep some Chinese around because they make good stuff cheap, no?\n\nRENSE: Yeah, just like they want to keep some Africans around in sub-Saharan Africa to work the plantation.\n\nFULFORD: Right. That sort of thinking. Their plan, as I was told by the Japanese Illuminati, was to weaken China through disease, and also starvation. They are trying to engineer a global food shortage by creating viruses that affect our major food crops.\n\nThen they want to provoke a war by getting Taiwan to declare independence. Their hope, by that time, is to have the Japanese army as a subdivision of the US army, ready to pounce on China and divide it into six countries. This was the plan told to me by very senior Japanese people.\n\nRENSE: When was this plan cooped [laughs] - kooky plan, but when was it cooked up?\n\nFULFORD: Quite a long time ago. These people think in terms of decades or even longer.\n\nRENSE: The Japanese army is not able to go in and subjugate China. This is...\n\nFULFORD: The Japanese army is one of the biggest armies in the world. It\\&amp;#039;s huge. It would be working with the US Army and the Navy.\n\nRENSE: How big is the Japanese army? How many standing men in uniform?\n\nFULFORD: It\\&amp;#039;s an \\&amp;#039;instant ramen\\&amp;#039; army. What they have is lots and lots of officers and lots and lots of weapons. They have the third biggest military budget in the world. What they can do at any time is grab three million office workers off the street and turn them into soldiers.\n\nRENSE: Wow.\n\nFULFORD: That\\&amp;#039;s quite huge, and very up to date.\n\nRENSE: So this plan of subjugating China with this army, and other factors like what\\&amp;#039;s left of our army and military - is it a plan that is still cohesive, militarily?\n\nFULFORD: Not really. The Japanese are still going according to the original plan, but that blew up in Iraq, didn\\&amp;#039;t it?\n\nRENSE: It sure did!\n\nFULFORD: The plan was to grab all the oil in the Middle East, and then go and get China. But they couldn\\&amp;#039;t quite get their Middle Eastern part done. That\\&amp;#039;s why, a very important thing to understand is that because the Rothschild faction split with the Rockefellers, that\\&amp;#039;s when we had this \\&quot;Freedom Fries\\&quot; business and all this anti-French stuff.\n\nThey are not getting enough financing to maintain a big army there. That\\&amp;#039;s why there are 150,000 troops. The only money they\\&amp;#039;re getting now is from Japan. The Europeans aren\\&amp;#039;t willing to finance this adventure in Iraq anymore.\n\nSo there has been a very major schism here between the Rothschilds and the Rockefellers. That\\&amp;#039;s part of the reason why they can\\&amp;#039;t afford to run the Iraq thing properly.\n\nRENSE: Now the [Chinese] secret society, pointing to SARS as an attempt. That\\&amp;#039;s what galvanized them.\n\nI guess we come to the next obvious question. Why, then, Fulford?\n\nFULFORD: I wrote about this in a book in Japanese, which alerted them. Then they did their own research and confirmed that it was true.\n\nRENSE: You wrote about the population reduction plans?\n\nFULFORD: Yeah, and SARS and stuff, and how it only affected mainly Asians. Also an interesting little misquote can be found in the Congressional record, from July 13, 2005. You have a bio-weapons expert saying the weaponization of bird flu is taking place across Asia. In the Congressional record, they tried to erase it. I\\&amp;#039;ve got multiple copies stacked here and there.\n\nRENSE: We do know that on April Fool\\&amp;#039;s Day, April 1st of 2005, the resident of the White House, George Bush, signed an executive order which gave the federal government - i.e. George Bush and anybody he designates - full power of quarantine over any and all Americans, towns, cities, counties, states, which have been exposed to H5N1, Avian influenza, or any other exotic, infectious micro-organism. They\\&amp;#039;re not taking any chances.\n\nSo somebody knows something somewhere. We\\&amp;#039;ve been tracking this - you don\\&amp;#039;t know this - on my program for some three years now, with Dr. Henry Al-Nyman (ph), Ph.D., who is a brilliant micro-biologist and geneticist. He has been following this genetically from the beginning, forecasting what it would do, and how it is learning more and more about how to survive and thrive in mammals, which it is very close to doing now. It\\&amp;#039;s changing all the time, and getting closer and closer to true pandemic status.\n\nNow if there is an Asian genetic factor to this, I\\&amp;#039;m not aware of it, but we do know that Indonesia is rampant with H5N1, and Vietnam, Cambodia, and Taiwan have had a lot of trouble with it. So that\\&amp;#039;s a fact.\n\nFULFORD: It\\&amp;#039;s also a fact that the Asians are a little over sharing the bird flu data with the Americans. [They say,] \\&quot;Why should we give you stuff that will allow you to create a vaccine to protect your own people while we die?\\&quot;\n\nRENSE: That makes sense. We wondered why the genomes were being withheld, why the samples were being withheld.\n\nFULFORD: The Chinese haven\\&amp;#039;t been giving them for years now. They said, \\&quot;The hell with that. We\\&amp;#039;re not going to protect your own people while you try to kill us.\\&quot;\n\nRENSE: Okay. Back to the meeting in Taiwan.\n\nFULFORD: They decided that these people need to be overthrown.\n\nRENSE: The Rothschilds, the Illuminati, the Rockefellers.\n\nFULFORD: Yeah. The Illuminati. And specifically, if I have to, I will ally myself with the Rothschilds against the Rockefellers, if it comes to it. I\\&amp;#039;d rather get them both out of power, but the Rothschilds are a much mellower bunch at this point. They\\&amp;#039;re [promoting] the global warming thing. It\\&amp;#039;s stupid, but...\n\nRENSE: I wouldn\\&amp;#039;t agree with you, but I would suggest that what they\\&amp;#039;re doing in Europe with Bush\\&amp;#039;s so-called defensive missiles, threatening and pushing and provoking Russia, is not particularly sanguine; it\\&amp;#039;s pretty damn dangerous.\n\nThe Russians today announced they are going to deploy their new Iskander (ph). It\\&amp;#039;s a new medium-range cruise missile, in Western Russia, to oppose the so-called Bush \\&amp;#039;defensive\\&amp;#039; missiles, which of course are being placed there, or will be placed there, to knock down the Topol-M, which has also just been advanced dramatically.\n\nThe Topol-M was a single-bang warhead. Now it\\&amp;#039;s a MERV\\&amp;#039;ed warhead, and it has had two successful test firings. So the Topol-M is now MERV\\&amp;#039;ed, meaning it has ten independently targeted thermonuclear warheads in each rocket.\n\nNow the Topol has a triple-speed boost phase, which makes it very hard to knock down. These interceptor rockets that Bush wants to put in Europe are specifically designed to try to stop the Topol-M in its boost phase. That\\&amp;#039;s another story.\n\nGo ahead, please.\n\nFULFORD: What it means is we\\&amp;#039;ve now got the Russians and the Chinese. I\\&amp;#039;ve now been contacted by the Japanese secret government, and it looks like they\\&amp;#039;re also going to turn against the Rockefellers.\n\nRENSE: Now the Rockefellers have the Japanese by the shorthairs, or at least they have so far.\n\nFULFORD: Yeah. They have so far. The thing is, the Japanese want to keep friendly relations with the United States. They really do like that US-Japan relationship and they don\\&amp;#039;t want to damage that. But if they can preserve that relationship and get rid of the Rockefellers, that would be very happy for them - very happy indeed.\n\n[Bumper music]\n\nRENSE: So is this suggesting some kind of cooperation between the Chinese secret society and the Japanese government, which wants liberation from the yoke of the Rothschilds?\n\nFULFORD: Absolutely! Absolutely. They are cooperating. They are going to be given an ultimatum soon. We\\&amp;#039;re just waiting for all our ducks to be in a row.\n\nRENSE: All right, stand by. Hold on right there, Ben. We\\&amp;#039;ll come back and talk more about this.\n\nOkay. Wow. Quite a fortune cookie. We\\&amp;#039;ll be right back in just a few minutes with Benjamin Fulford.\n\n[Break]\n\nRENSE: Okay. And back with Ben Fulford. Hi, Ben. You want to carry on right where we were?\n\nFULFORD: Yes. They are going to be given an ultimatum.\n\nWhen these people first contacted me, once I knew they were for real, the first thing I thought was, \\&quot;We\\&amp;#039;ll play 9/11 movies in Chinatowns around the world.\\&quot; But then I thought, \\&quot;Wait a minute. These guys are really bad people.\\&quot; I thought about it.\n\nI realized the Illuminati and all their servants are about 10,000 people. Everyone below them - if they knew what the 10,000 were doing, they would be furious, and rip them out of their houses and hang them from the nearest lampposts. Right?\n\nRENSE: Mm hm.\n\nFULFORD: The Chinese [secret society has] six million. So that\\&amp;#039;s 600 to 1 odds. More specifically, there are ten professional assassins for each member of the Illuminati. So basically it\\&amp;#039;s checkmate for them.\n\nThe question is how to bring this out to the public and make this a formal thing.\n\nHowever, killing people is something I don\\&amp;#039;t like - and neither do they. So the first order of business is to try to talk, before things get radical.\n\nThe point is, there is the technical ability to wipe them all out in a matter of hours. They would all be assassinated.\n\nBut instead, I think, they\\&amp;#039;re going to be offered an opportunity. I don\\&amp;#039;t think - I know. They are going to be offered an opportunity to surrender.\n\nRENSE: Will you be playing a role in making such an offer?\n\nFULFORD: Absolutely. I am their spokesman. My job is to represent them in the Western world.\n\nI know what I am allowed to say and what I am not allowed to say.\n\nThe point is this. We would start by killing David Rockefeller, and then work our way down the list until they agree to our terms.\n\nRENSE: You speak, I want to make this clear. Ben Fulford is speaking hypothetically here.\n\nFULFORD: Hypothetically. What I\\&amp;#039;m saying is that if they do not surrender...\n\nRENSE: ...or comply, or become acquiescent...\n\nFULFORD: Yes. Then we have to protect ourselves from genocide. And the way to do that, with the minimum possible death, is we start at the top of the Eye and work our way down until they agree.\n\nRENSE: So the idea would be five or ten thousand is a lot better than a billion.\n\nFULFORD: Zero is a lot better than five or ten thousand!\n\nRENSE: And that was my next statement. Yes. I understand that.\n\nFULFORD: My job is to try to make sure that not a single person dies. That is the ideal. The commissions that are going to be offered - and I know David Rockefeller is going to be listening to this, so you\\&amp;#039;d better listen, David Rockefeller:\n\n1. They are going to be allowed to keep their palaces and their servants. They will be given an amnesty, but they must appear before a truth commission.\n\n2. And they must promise - them and their clan - to never, ever try again to enslave the human race.\n\n3. And third, they must spend the rest of their lives doing good deeds.\n\nThose are the conditions. I think they\\&amp;#039;re very good ones, and it\\&amp;#039;s the best they have available. They\\&amp;#039;d better hurry before the American people drag them out of their houses and hang them from the nearest lampposts, which I think is about to happen anyway.\n\nRENSE: Do those conditions apply to the Rothschilds as well?\n\nFULFORD: Yeah, I mean, maybe the Rothschilds can work themselves their own deal. I\\&amp;#039;m in contact with a Rothschild representative, and maybe we can come up with something else. The main point is to stop the genocide. That is the number one goal.\n\nRENSE: What would you term what the Americans are doing in Iraq and Afghanistan? We have seen the slaughter of over...\n\nFULFORD: Well, they\\&amp;#039;re irradiating it with nuclear dust!\n\nRENSE: We are turning it into nuclear dust, we have killed already close to one million Iraqis since the Iraq war began over four years ago. The threat now to invade Iran, a country of 70 to 80 million people, is quite clearly on the front burner again. So this is genocide.\n\nFULFORD: Yes.\n\nRENSE: And this is not being orchestrated entirely by the Rockefellers, although I do see the connection to what you\\&amp;#039;re saying. Now we want to quickly jump over to... go ahead.\n\nFULFORD: The Rockefellers are just one... I don\\&amp;#039;t want to put everything on that one name. You\\&amp;#039;ve got to remember that you have the JP Morgan descendants.\n\nWhat people in America need to do is get an old Who\\&amp;#039;s Who. Look up the names of the bankers, the six or seven families who took over the Fed in 1913. Get the Who\\&amp;#039;s Who and look up all their descendants. And then capture all the males. The United States would wake up.\n\nIt would be like the movie \\&quot;The Island,\\&quot; where everyone suddenly wakes up and realizes they\\&amp;#039;re being subjected to Freudian / Pavlovian mind control. It would be a miracle. It would be freedom!\n\nThat\\&amp;#039;s what you have to do to save America. Those are the people you need to make as your priority targets if you want to save the United States and stop this genocide. The court jesters are the Neocons, too, who are the servants of these people.\n\nRENSE: Well, the Neocons are essentially servants of the Zionist / Jewish / Rothschild cartel that is pushing the Middle East agenda, as much as we can tell.\n\nNow the oil issue, of course, appears to cross over to both sides. It appears that Zionism is taking on Russia now, and pushing very hard in that respect. The Rockefellers are hard at work in Iran, covertly, and Iraq of course overtly, and Afghanistan. That\\&amp;#039;s a simplistic overview.\n\nFULFORD: They need oil to control the world.\n\nRENSE: The Chinese need oil to continue to develop and progress, as do the Japanese.\n\nFULFORD: You know what? Actually they figured out that maybe they don\\&amp;#039;t need oil. They have these huge plants that are converting coal to oil now. To be honest, the Japanese had the technology to make fuel from water 30 years ago.\n\n[Bumper music]\n\nRENSE: I think several people have, if you simply spend an hour on the Internet and look up taking hydrogen from water and actually making it burn. There is a lot of potential out there, which the petroleum companies are not too fond of.\n\nFULFORD: Yeah. Actually let me tell you a personal story...\n\nRENSE: Hold on, let\\&amp;#039;s do that in just a minute, Ben, please. We have to pause. We\\&amp;#039;ll do the personal story next, with Benjamin Fulford, who has just laid out some pretty interesting conditions for an alleged offer that perhaps the Illuminati can\\&amp;#039;t afford to refuse. We will see.\n\n[Break]\n\nRENSE: Okay. Back with you. Benjamin Fulford, live from Tokyo, is with us. Pretty stunning material. All right, Ben, you had a personal story you wanted to share. Go ahead.\n\nFULFORD: My great grandfather was G.T. Fulford. He was one of the richest men in the world - George Taylor Fulford. You can find him on Wikipedia. He was one of the richest men on Earth, and he was the largest single shareholder in General Electric.\n\nHe was going to finance Nikola Tesla, but he was murdered by the Rockefellers in 1905. It was made to look like a car accident.\n\nRENSE: Your grandfather.\n\nFULFORD: Great grandfather.\n\nRENSE: Great grandfather. So really! Wow.\n\nFULFORD: And the family fortune was stolen. My grandfather was only three years old at the time. The family fortune was taken over by the Rockefellers. My grandfather didn\\&amp;#039;t know how to suspend his assets.\n\nI am telling the Rockefellers right now, they can think of me as the ghost of G.T. Fulford, come back over a century - from four generations - to get justice.\n\nRENSE: You speak in a very brave and cavalier way.\n\nFULFORD: I\\&amp;#039;ve got good people behind me!\n\nRENSE: And as I was going to say, you speak as if you are a man with great self-assurance, and you have a lot of friends.\n\nFULFORD: Absolutely. You have 100,000 assassins backing you up, you don\\&amp;#039;t have to be a chicken!\n\nRENSE: Well, you don\\&amp;#039;t sound like a chicken.\n\nFULFORD: No. I\\&amp;#039;m going to get these people if no one else does. If they don\\&amp;#039;t agree to my terms, they are doomed. And they know it. They have the intelligence agents.\n\nYou people out there, you don\\&amp;#039;t know because you don\\&amp;#039;t have access. You don\\&amp;#039;t know if I\\&amp;#039;m lying, if I\\&amp;#039;m a crazy guy, but they do. People in the CIA, the NSA, Mossad, they know I\\&amp;#039;m not kidding. This society is real. And they are moving.\n\nSo they realize this is not a bluff. This a promise. They must stop their crazy games.\n\nWhat these people are trying to do - I know it sounds insane. They are trying to artificially create Armageddon. They are trying to make people believe these are end times, by slaughtering people through disease and famine.\n\nI believe they even have, I know this will sound a bit crazy and you will start wondering about me, but they have some kind of microwave weapon that can heat up underground water near earthquake-prone zones, and trigger earthquakes.\n\nRENSE: Oh, I believe it. If that particular technology is true, it\\&amp;#039;s probably one of two or three. They can do it with harmonic resonance, with sonic-based weapons and devices. There are a lot of ways, apparently, to get earthquake faults to move.\n\nFULFORD: So what I\\&amp;#039;m getting, the feeling is these people are trying to artificially create the appearance of end times, just like in the Bible, and fool everybody.\n\nRENSE: They seem to be playing to that script.\n\nFULFORD: And you must not be fooled, because this has nothing to do with anything spiritual or otherworldly. This is right here on this earth.\n\nAnd the cults these people represent, they have been known by folklore over the years. You have to start with Nimrod, the Babylonian tyrant. Then Hammurabi.\n\nHammurabi is known to the Jews as Abraham - a Babylonian tyrant. A slave driver. These people have had a secret sect of slave drivers that is almost six thousand years old.\n\nThey have very, very sophisticated methods. They use secrecy, murder, bribery and ridicule as their main weapons. They have had a very good run, but this is checkmate for them, as far as I am concerned.\n\nThey are not going to get away with this. They\\&amp;#039;d better realize it. It\\&amp;#039;s game up. They\\&amp;#039;ve been exposed. People know about them. They are onto their game. And it\\&amp;#039;s not going to work.\n\nAll you\\&amp;#039;ve got to do is target the Eye. Hollywood - the people in Hollywood have been trying to warn the Americans for years! If you look at Tolkien\\&amp;#039;s movie, you have this Eye on the top of a mountain. Destroy the Eye and save the world.\n\nOr [destroy] the masters. Stanley Kubrick gave up his life to expose these people.\n\nSo you\\&amp;#039;ve got to remember this isn\\&amp;#039;t [associated with] the Jews. The Jews are your best friends in fighting these people, because they\\&amp;#039;ve been their biggest victims over the years.\n\nRENSE: Well, we\\&amp;#039;re talking about Zionists here, not Jews.\n\nFULFORD: Exactly. I\\&amp;#039;m talking about a specific - well, yeah, you can call them Zionists. I think at a higher level it is a very secretive sect of people who are pretending they are Gods.\n\nRENSE: What happened to Stanley Kubrick? I don\\&amp;#039;t mean the precise cause of death, but where was he going that got him into trouble with these people?\n\nFULFORD: It was the movie Eyes Wide Shut, exposing the Masonic orgies. They showed that there were people being killed. This is probably based on real events.\n\nI haven\\&amp;#039;t done the proper research, but there is an old man who dies in Eyes Wide Shut. If I\\&amp;#039;m not mistaken, the man in the movie died exactly the way Stanley Kubrick died in real life, just as he finished the movie.\n\nRENSE: It is also suggested that Kubrick was involved in creating the - at least some hoaxed Apollo moon footage, and knew all about that. His wife has intimated as much since his death.\n\nFULFORD: In 1938, on April Fool\\&amp;#039;s Day, they had the War of the Worlds on radio, with Orson Welles. All sorts of people believed it. So, they said \\&quot;Ha! This is a tool we can use. People will believe anything if it\\&amp;#039;s on the media.\\&quot;\n\nRENSE: Well, I think the media, then, with the work of Edward L. Bernays, began its ascendancy. It has become the most powerful tool of human oppression, social engineering, programming and mind control that has ever been on the planet.\n\nFULFORD: One of the most important instances of mind control is association. What they do, for example, with this holocaust stuff, is they show you something so horrible that everybody is disgusted. Killing innocent women and children in gas chambers, turning people into soap, it\\&amp;#039;s just so awful that you hate it. Anyone would.\n\nRENSE: Of course, the soap issue has been completely discounted, by the way.\n\nFULFORD: That\\&amp;#039;s not the point. The point is they fill you with this horrible story. Then they associate everything they don\\&amp;#039;t want you to think about with that.\n\nSo before I woke up to what was happening to me - if somebody tells me about a secret cartel of financiers who control the world\\&amp;#039;s central banks, I would have instantly said, \\&quot;Oh, yeah, that\\&amp;#039;s that anti-Semitic thing. Oh, you\\&amp;#039;re a Neo-Nazi. You want to kill people. Oh my God, you\\&amp;#039;re horrible. I can\\&amp;#039;t talk to you.\\&quot;\n\nAnd then the conversation shuts down. That\\&amp;#039;s how they do it! That\\&amp;#039;s the kind of mind-wash or brain control [they use] through association.\n\nRENSE: The Illuminati controllers have been bleeding the world\\&amp;#039;s populace for a long time. They are real good at it. What is it about your message that you think their ego will back down enough to take seriously? You laid the numbers out there. Is it going to take some kind of an example?\n\nFULFORD: I hope not. I really do. Even if you lose one assassin, this guy has got a family. He\\&amp;#039;s got people who love him. He\\&amp;#039;s going to be a suicide mission for sure.\n\n[Bumper music]\n\nWe\\&amp;#039;d rather not have to do that. And then his family has to be supportive. It\\&amp;#039;s not a nice thing to kill people.\n\nRENSE: No, it isn\\&amp;#039;t.\n\nFULFORD: It\\&amp;#039;s really a last resort.\n\nRENSE: All right. Stand by, Ben. We\\&amp;#039;ll take a break and come right back with Benjamin Fulford. Again, the Asia-Pacific bureau chief for Forbes magazine, for eight years. Take a look on his website, click on his article at &lt;http://rense.com/&gt;Rense.com.\n\nIt\\&amp;#039;s a remarkable conversation. If it is true, of course it changes the balance of power dynamics on this planet. Incredible. Time will tell. We\\&amp;#039;ll be right back.\n\n[Break]\n\nRENSE: Okay, we\\&amp;#039;re back. There are, of course, an awful lot of people around the world listening right now who will continue to read Henry Makow, Ph.D.\\&amp;#039;s story about Ben Fulford.\n\nWe\\&amp;#039;ll have more from Ben at &lt;http://rense.com/&gt;Rense.com. And they are probably cheering for this, or certainly entertaining this concept, this program, with a great deal of guarded optimism, shall we say. It would be nice to see that the status quo, which is quite cl\n","torrent":{"xt":"urn:btih:652a9bf907a2ee565a93d69421d860e0bb0de7b6","amp;dn":"Benjamin_Fulford_on_Jeff_Rense_070507_FULL.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652a9bf907a2ee565a93d69421d860e0bb0de7b6","infoHashBuffer":{"type":"Buffer","data":[101,42,155,249,7,162,238,86,90,147,214,148,33,216,96,224,187,13,231,182]},"announce":[],"urlList":[]}}