{"title":"Machines At War 1.1 PocketPc Full Incl Cracked-tsrh","uid":3980104,"size":8138802,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:65517d96f2e86a0fcf26445c55f334af8e99ba45&amp;dn=Machines+At+War+1.1+PocketPc+Full+Incl+Cracked-tsrh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bluey_Master","files":2,"time":1200505418,"description":"Description\n\n\nCommand an army of forces across the battlefield with ease in this real time strategy game. You are challenged to construct an epic war machine and use it to become a dominating world power.\nMachines at War features a random map system so every game you play is unique and poses new challenges. Build bridges to cross water, mow down forests to clear a path to the enemy, build walls to defend your position, track tread marks left by enemy tanks to their base, hide under trees for an ambush attack, these are just some of the unique game play elements available.\nExpand your city with over 40 structures and units to choose from. As your empire grows you can research technologies to guide the focus of your strategy. Choose to be a economic powerhouse and flood the enemy with an endless barrage of units. Or upgrade your defensive forces and build an insurmountable fortification of turrets and fortresses surrounded by walls and gates. If blitzkrieg is your style, then embolden your offensive forces with unique weapon upgrades and demoralize the enemy with an unstoppable force.\n\nBuild vehicles and aircraft to take control of the land and air including tanks, jeeps, trucks, helicopters, jets, VTOLs, turrets, and more. After each battle detailed statistics are displayed showing the how the tides of war changed for each player\n\nFeatures\n\n    * Command forces with hundreds of vehicles\n    * Build over 40 types of units and structures\n    * Choose from 7 landscape types to wage war on\n    * Enjoy beautifully rendered graphics and effects\n    * Research over 30 exciting technologies\n    * Play on randomized maps for unlimited game play\n    * Battle in 3 unique environments\n    * Scorch the destructible environment\n    * Learn from the built in help and tutorial\n    * Expand the powerful moddable game engine\n    * Customize the user interface to your liking\n    * Support for add on units and landscapes\n\n\nWindows Mobile System Requirements\n\n    * Windows Mobile 2003, 2003 SE, 5.0, 6, Standard, Professional, or Classic\n    * 10 MB storage memory\n    * 13 MB program memory when running the game\n    * Square, QVGA, VGA screens fully supported","torrent":{"xt":"urn:btih:65517d96f2e86a0fcf26445c55f334af8e99ba45","amp;dn":"Machines+At+War+1.1+PocketPc+Full+Incl+Cracked-tsrh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65517d96f2e86a0fcf26445c55f334af8e99ba45","infoHashBuffer":{"type":"Buffer","data":[101,81,125,150,242,232,106,15,207,38,68,92,85,243,52,175,142,153,186,69]},"announce":[],"urlList":[]}}