{"title":"WoW Bot- Zolofighter","uid":3980103,"size":808335,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:659b1f8a28e7c06eb7b05233423c9b94ab544792&amp;dn=WoW+Bot-+Zolofighter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rofflingnig","files":1,"time":1200505335,"description":"Wow ZoloFighter\n\nZoloFighter is a world of warcraft bot/javascript platform. The basic mode is easy to use, and for advanced users, zoloFighter has full javascript support to automate all aspect of WOW grinding and fishing. Simple tutorials now available.\n\n    * Click here to go to the download page\n    * Support npc sale waypoints.\n    * You can remotely control your bot now with some script/telnet (Advanced users only). Just set SRVROOT:1234 (or any port number) and telnet to that port to issue commands. Use javascript to get commands and do whatever you want to do to them. Will publish examples later.\n    * Added fishing mode, so you can use profile to run to fishing postion and fish, and if mobs attacking you, it will fight back now (Still in testing). I will put tutorial for how to do it in forum sometime next week.\n    * Supports UNICODE.\n    * Javascript enabled, you can now check your inventory, check players around you, check whispers. Check the script.js file for examples.\n    * Multiple running mode, ability to chain profiles through profile script (see p3.txt)\n    * Warden safe. Please do the following:\n          o Enable guest account. Guest account is used to launch WOW as an extra step to prevent detection.\n          o Run Fisher/Fighter under admin mode, and ONLY lunch WOW with the &quot;Launch WOW&quot; button\n          o If you use non-english version of windows, please modify GUEST: parameter in settings.txt to reflect the Guest user name for your version of windows.\n          o Don&amp;#039;t bot in populated areas. Other players will eventually notice you are a bot\n          o Don&amp;#039;t be too greedy, only sale small amount of your loot via AH. \n","torrent":{"xt":"urn:btih:659b1f8a28e7c06eb7b05233423c9b94ab544792","amp;dn":"WoW+Bot-+Zolofighter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"659b1f8a28e7c06eb7b05233423c9b94ab544792","infoHashBuffer":{"type":"Buffer","data":[101,155,31,138,40,231,192,110,183,176,82,51,66,60,155,148,171,84,71,146]},"announce":[],"urlList":[]}}