{"title":"Help!.NTSC.DVD5.ISO","uid":3985670,"size":4681420800,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:661d479e3b45c9ed80f2320ae84aae7aa9a938d8&amp;dn=Help%21.NTSC.DVD5.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SiLENT_RiP","files":1,"time":1200790960,"description":" &lt;a href=&quot;http://imdb.com/title/tt0059260/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imdb.com/title/tt0059260/&lt;/a&gt;\n\nTitle: \tHelp!: The Beatles (1965)\nStudio Line:   Stop worrying! HELP! is on the way!\n\nHelp!, the follow-up film to the Beatles&amp;#039; fantastically successful A Hard Day&amp;#039;s Night, is a fun-filled adventure that takes us back to a simpler era - a time when the Beatles and a whole generation took themselves less seriously. And now, the film that provided the soundtrack to many of our own lives and times has been newly remastered, along with the eight minutes of rare bonus footage.\n\nHelp! follows the Fab Four on a worldwide jaunt around the globe. When a fan sends Ringo an ancient sacrificial ring that becomes struck on his finger, he becomes targeted by a group of hilariously obsessed oriental mystics, as well as an ambitious scientist who has his own plans for the ring. On the run, the Beatles are chased from London to the Swiss Alps to the Bahamas, outwitting their pursuers, singing great songs and having a ball.\n\nAs an added bonus, the Help! digital video disc comes from a fully restored print made from the film&amp;#039;s original color negative, and includes the original theatrical trailer, two newsreels, silent footage of the film set and the world premiere, still photos and posters set to original radio ads, and an open radio interview that allows for a friendly &quot;chat&quot; with the Beatles.\n\nDirector: Richard Lester\nCast: John Lennon, Paul McCartney, George Harrison, Ringo Starr, Leo McKern\n\n&quot;Ringo finds himself the human sacrifice target of a cult and the band must try to protect him from it.&quot;\n\nGod Bless the Beatles. They&amp;#039;re one of the few musical groups that still remain as fresh and entertaining even today. And that applies to their films as well. &quot;Help!&quot; is a lot of fun. Take the &quot;Fab Four&quot; with a goofy plot of Ringo being the target of religious sacrificial cult, add a handful of great songs, and that&amp;#039;s the movie. The one-liners in this film are still very funny, with plenty of &quot;groaners&quot; and the typical quick British wit. Really nice camera work, great sets (the Beatles&amp;#039; apartment showcases clever diversity for each member&amp;#039;s personality) and just wild sub-plots throughout the film. (Paul&amp;#039;s tiny adventure and the tank chase comes to mind.) As I said before, the film&amp;#039;s main asset is the music, and one can&amp;#039;t help but find themselves caught up in the songs.\n\nThe strangest thing in the film is when it abruptly veers away from the cult chase to numerous songs and the Beatles just playing around. Even with a few more attempts on poor Ringo&amp;#039;s finger, it seems like everyone takes a break from the chase. It really doesn&amp;#039;t matter, however. The Beatles seem to be having a good time, and you can&amp;#039;t help but join in.\n\n&quot;Help!&quot; is a great showcase of Beatles music, fun writing and clever visuals. While not as great as &quot;A Hard Day&amp;#039;s Night&quot;, those who enjoyed that movie will be hard-pressed to find anything wrong here.\n\n- = - = - = - =\n\nDVD-5 rip from original R1 NTSC DVD-9 (November 6th, 2007) NOT the R2 (UK) version released a decade earlier, using DVD-Shrink @ 77%. Menus &amp; Subs intact; 5.1 DTS audio; all extras and unreferenced cell data removed.  Disc 1 only; Disc 2 (with commentary, deleted scenes, ect.) NOT included.\n\nEnjoy.\n\nSiLENT_RiP","torrent":{"xt":"urn:btih:661d479e3b45c9ed80f2320ae84aae7aa9a938d8","amp;dn":"Help%21.NTSC.DVD5.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661d479e3b45c9ed80f2320ae84aae7aa9a938d8","infoHashBuffer":{"type":"Buffer","data":[102,29,71,158,59,69,201,237,128,242,50,10,232,74,174,122,169,169,56,216]},"announce":[],"urlList":[]}}