{"title":"Z.iso","uid":3937768,"size":362444800,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:669dbc90a6bc6d3d5b92ddc6d45362d39dc335e2&amp;dn=Z.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"^2mMy^","files":1,"time":1197933906,"description":"Z (pronounced Zed) is a 1996 real-time strategy computer game by The Bitmap Brothers. It is about two armies of robots (red and blue) battling to conquer different planets.\n\nGameplay\n\nUnlike other traditional real-time strategy (RTS) games, collecting resources or building specific structures is unnecessary for creating an army. Instead, regions and structures within their borders are captured by moving troops to their respective flags. Also, instead of using resources to build units, constructing each unit requires a pre-set amount of time. The more regions are under the player&amp;#039;s control, the less the time required. More powerful units take more time to construct.\n\nThe objective of the game is to eliminate the opponent by taking out their command Fort: either by sending a unit to enter it, or by destroying it directly. Alternatively, destroying all of the opponent&amp;#039;s units immediately wins the game.\n\nAt the start of every mission, each side is given control of their Fort (the CPU) and a small group of units. A host of unmanned turrets and vehicles are usually scattered about the map and sending a robot to these will allow the player to add them to their army. However, the assigned robot will remain in the captured vehicle or turret as a pilot or a gunner.\n\nThe game is significantly different from others of its type: For example, vehicle drivers can take damage from enemy fire, and if the driver is destroyed, the vehicle they were commandeering will be unmanned and can be captured by either side. At the time of its release, Z was also noted for being more complex, intense, and challenging compared to other games of its time, like the original Command and Conquer, where the gameplay usually boiled down to tankrushing AIs showing a lack of aggression.\n\nThe game starts off with simple, symmetric levels where the CPU starts with roughly the same hardware as the computer. As the game progresses, the levels become more complex, demanding more skill to control all units effectively, and the computer gains an advantage in starting units. For example, the CPU&amp;#039;s fort usually has substantially more powerful guard turrets. The computer also gains more logistic advantages.\n\n[edit] Worlds","torrent":{"xt":"urn:btih:669dbc90a6bc6d3d5b92ddc6d45362d39dc335e2","amp;dn":"Z.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"669dbc90a6bc6d3d5b92ddc6d45362d39dc335e2","infoHashBuffer":{"type":"Buffer","data":[102,157,188,144,166,188,109,61,91,146,221,198,212,83,98,211,157,195,53,226]},"announce":[],"urlList":[]}}