{"title":"Invisible IP Map v2.7","uid":3923966,"size":1485764,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:66c89fceb1e7d10d684fa7cccf23c9afc2f1b456&amp;dn=Invisible+IP+Map+v2.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mt_dew","files":1,"time":1196971177,"description":"Invisible IP Map is user-friendly software that masks your real location. Every computer that is connected to the Internet has its own IP address which could easily be located on a map. This program will help you show yourself like you are surfing from another place on the planet.\n\nThis is a Mask IP software which is used to change your real Internet address while browsing. The software will deliver you fresh anonymous proxy servers every time you decide to click on &quot;Get IP Locations&quot;. The main benefit of this software is that you can&amp;#039;t be traced when browsing websites. Also if a website is restricted for users from specified country the program can bypass that protection. By hiding your IP you will prevent receiving spam from marketers which know your interests by tracking your IP when browsing websites. You can use web based e-mail to send anonymous e-mail. Post on bulletin boards without displaying your real IP address.\n\nIP Information\nThis screen will give you all the information about your IP and the remote IP. You can see information such as city, region, country, distance between you and the remote server, server type, timeout etc.\n\n\nScreen Shots\n\n\n\n\n\n\nPassword\nCode: bb.bearslinks.info\n\nmake sure to copy the ini file to the installed directory..\n\n\nSEED, SEED, SEED, SEED!!!!!\n\nIf you like it... at least leave a comment!  Seems everyone wants to leach and run!\n","torrent":{"xt":"urn:btih:66c89fceb1e7d10d684fa7cccf23c9afc2f1b456","amp;dn":"Invisible+IP+Map+v2.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66c89fceb1e7d10d684fa7cccf23c9afc2f1b456","infoHashBuffer":{"type":"Buffer","data":[102,200,159,206,177,231,209,13,104,79,167,204,207,35,201,175,194,241,180,86]},"announce":[],"urlList":[]}}