{"title":"WW II Tank Commander [English]","uid":3373738,"size":529866166,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:67da93ca972bb8c4a24eaff3f8cf70785108c95b&amp;dn=WW+II+Tank+Commander+%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pctorrent","files":5,"time":1124832873,"description":"It's World War II and you are a commander of an M4 Sherman tank in the 4th Armored Division, Patton's best and most elite division. From France to Germany, you will destroy opposition from the war's most fearsome tanks such as Panthers, Tigers and Hummels. Land on Utah Beach, cut off enemy forces at the Brittany Peninsula, smash Germans forces across the Moselle, relieve the besieged 101 st Airborne at Bastogne, cross the Rhine and chase the German forces into Czechoslovakia. Engage in non-stop military arcade action with authentic weapons. Multiple mission styles are included with objectives such as Assault, Escort, Defense, and Rescue.\n\nEasy to play, strong out of box experience \nEnjoy nonstop military arcade action with gunfire, mines, tracer fire and explosions. \nFight for your country and destroy Nazi tanks, armor, self-propelled guns and infantry. \nDesigned to appeal to the broadest base - arcade style tank combat makes the game fun for the casual gamer as well as the tank enthusiast and World War II buff \nTake control of the M4 Sherman tank with upgradeable weapons and ammo. \nFollows the campaigns of General Patton's Fourth Armored Division, ?Patton's Best? \nTake on 30 missions spread over 5 authentic levels \nComplete multiple objectives such as Assault, Escort, Defense, and Rescue. \nExtremely detailed environments with many special effects.","torrent":{"xt":"urn:btih:67da93ca972bb8c4a24eaff3f8cf70785108c95b","amp;dn":"WW+II+Tank+Commander+%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67da93ca972bb8c4a24eaff3f8cf70785108c95b","infoHashBuffer":{"type":"Buffer","data":[103,218,147,202,151,43,184,196,162,78,175,243,248,207,112,120,81,8,201,91]},"announce":[],"urlList":[]}}