{"title":"Tag&amp;Rename 3.4 - Final","uid":3926779,"size":3097502,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:687981ba64244bb516117e6c4ef341f00fd1e4c0&amp;dn=Tag%26Rename+3.4+-+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mt_dew","files":1,"time":1197144320,"description":"Tag&amp;Rename is a handy utility designed for music files management. With Tag&amp;Rename you can quickly and easily rename your music collection using the embedded tag data, write new or edit existing tag information, create tags based on file names, get songs information from freedb/amazon.com servers and mach more.\nTag&amp;Rename supports many additional tag fields including lyrics, cover art, rating, mood, disc #, part of a compilation, album artist, classical music fields (Composer, Conductor, etc.), file related URL&amp;#039;s and so on.\nTag&amp;Rename now support: mp3 (ID3v1, ID3v2.2, ID3v2.3 and ID3v2.4 tags), MusePack mpc/mp+ (APEv1, APEv2 and ID3v1 tags), Windows Media - wma, asf and wmv files, Ogg Vorbis/Flac/Speex (vorbis comments), Apple iTunes and iPod aac (m4a) files including mp4, lossless m4a and protected m4p files, most popular lossless codecs including Monkey?s Audio, Flac, Wav Pack, Optim Frog, True Audio, Apple and Windows Media lossless formats. Tag&amp;Rename include full Unicode support.\n\nTag&amp;Rename features:\n? Renamer for mp3, ogg, wma, m4a, mp4, flac, ape and wav files: easily rename files individually or whole directories at a time, preview changes before renaming or undo the last renaming process, rename the folder (including sub folders) containing your music files, and manually edit files and folders names.\n? Multi-file or manual tag editors: edit tags for multiple or single mp3/wma/ogg/m4a/mp4/ flac/ape files, fill-in tag fields using the file name.\n? Freedb support: Gets tag information for full music albums in seconds using the freedb Internet server.\n? Amazon.com support: search and import album information and cover art from the amazon.com, amazon.co.uk and amazon.de servers to files tags.\n? Text case conversion functions: convert case or capitalize the first letter of each word within file names or tags.\n? Support for: mp3 (ID3v1, ID3v2.2, ID3v2.3 and ID3v2.4 including ANSI, Unicode and UTF8 encoded tags), MusePack mpc/mp+ (APEv1, APEv2 and ID3v1 tags), Windows Media wma, asf and wmv files, Ogg Vorbis/Flac/Speex (vorbis comments), Apple iTunes and iPod aac (m4a) files including mp4, lossless m4a and protected m4p files, most popular lossless codecs including Wav, Monkey&amp;#039;s Audio, Flac, Wav Pack, Optim Frog, True Audio, Apple and Windows Media lossless.\n? Rename folders with music according to it files tag information.\n? Tags synchronization wizard: you can synchronize ID3v1 and ID3v2 tag data.\n? Export wizard can export your music information into any format (csv, xml, html and tab delimited text).\n? M3u playlists: create m3u play lists using the unique Quick Save Playlist feature.\n? Play music files: listen to your music files using your favorite music player.\n? Full support for files drag and drop.\n? Full Unicode support.\n? Explorer shell extensions: Tag&amp;Rename can be added to the context menu of MS Explorer so that you can access T&amp;R faster (right-click mouse) from the MS File Manager.\n\nChanges in Tag&amp;Rename v3.4 (12/05/2007):\n* minor bugs fixed\n\nChanges in Tag&amp;Rename v3.4 beta 2 (10/24/2007):\n* Tag&amp;Rename can work in portable mode now (portable option in installation)\n* some bugs fixed\n\nChanges in Tag&amp;Rename v3.4 beta 1 (10/04/2007):\n* &quot;Rename Actions&quot; added: now both album files and folders can be renamed in one click\n* added ability to import album information from TrackType.org server\n* &quot;Show ID3v1/ID3v2 tag is not present indicator&quot; file list option added\n* minor improvements in ID3v2.4 support\n\n","torrent":{"xt":"urn:btih:687981ba64244bb516117e6c4ef341f00fd1e4c0","amp;dn":"Tag%26Rename+3.4+-+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"687981ba64244bb516117e6c4ef341f00fd1e4c0","infoHashBuffer":{"type":"Buffer","data":[104,121,129,186,100,36,75,181,22,17,126,108,78,243,65,240,15,209,228,192]},"announce":[],"urlList":[]}}