{"title":"Scott Finch &amp; Gypsy - Haze Of Mother Nature (Blues/Psych US 2001","uid":3369140,"size":122815571,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6a093f13ffe27a4613ef355d6423811182999244&amp;dn=Scott+Finch+%26+Gypsy+-+Haze+Of+Mother+Nature+%28Blues%2FPsych+US+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"test78","files":19,"time":1123914812,"description":"Search for test78 if you are interested in my other uploads.\n\nBluesy american psychedelic rock from 2001. A lot of people compare this to Hendrix.\n\n\nScott Finch &amp; Gypsy got together in Wisconsin back in the eighties to form a compelling and authoritative trio that reawakened our senses and re-ignited our interest in that important period of rock music. Horizon Records (Akarma) recognizes the significance and the value of the music, and how the music buying public have become increasingly receptive to guitar oriented blues based rock. With all of those thoughts in mind, I proceeded to give this music an intense overview with my ears and mind. \n\nI had to wonder if this CD/LP was going to live up to the elaborate critique that was so convincingly described by Jo Anne Green in the intense liner notes. The story foregoing the recording is quite fitting to be sure. I found out immediately that this was not merely another Hendrix impressionist. Scott Finch (guitar, vocals), Joe Steil (bass, vocals) and Gregg Slavik (drums, percussion, vocals), are an original blues-rock power trio that ingeniously construct their own identity and style. Finch plays and sounds like Jimi often enough during the course of this larger-than-life release that you may find yourself thinking that it's actually the man himself back from the grave for one more jam session. They readily summon images of the master at several points during the course of the entire 76 minutes found on this generous rock excursion. \n\nIn its entirety, this music is like watching several points of light coming together to create a supernova. Finch mentions in the liner notes that musical nirvana is the ultimate goal that the group strives to achieve. I think it's safe to say that musical nirvana is obtainable. Just listen to this music.\n\n\n\n224Vbr\n\nTracklist:\n\n1. Flowers Of The Jungle \n2. Gypsy Waltz \n3. Dream Of The Dove \n4. People From The Darkside \n5. Little Bird \n6. The Goddess \n7. The Race \n8. Can't Live Without It \n9. Dragnet \n10. Godorn \n11. Acid Joe \n12. Time Keeps Rolling On \n13. Pipe Dream \n14. Haze Of Mother Nature \n15. I Don't Live Today \n16. Love Or Confusion \n17. If 6 Was 9 \n18. Little Wing \n\n\nEnjoy !","torrent":{"xt":"urn:btih:6a093f13ffe27a4613ef355d6423811182999244","amp;dn":"Scott+Finch+%26+Gypsy+-+Haze+Of+Mother+Nature+%28Blues%2FPsych+US+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a093f13ffe27a4613ef355d6423811182999244","infoHashBuffer":{"type":"Buffer","data":[106,9,63,19,255,226,122,70,19,239,53,93,100,35,129,17,130,153,146,68]},"announce":[],"urlList":[]}}