{"title":"Click-The views from The Pirate Bay[XviD](oan)","uid":3918802,"size":210470631,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6a2f6f9f234c73aab847a2f73a7c010a66f663a2&amp;dn=Click-The+views+from+The+Pirate+Bay%5BXviD%5D%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oneanight","files":3,"time":1196649360,"description":"Click-The views from The Pirate Bay[XviD](oan)\n\n\nThe Pirate Bay is one of the most popular file-sharing websites in the world and much of the content reachable via the site is pirated. Here the founders of the site and those that keep it running talk about what they do, why they do it and how hard it is to stop them.\n\nIn times when the laws of many nations criminalise the swapping of pirated content, be it music, movies or software, the continued existence of The Pirate Bay might seem to be an anomaly.\n\nThose behind the site say they do not fall foul of those laws because it acts as a search engine and does not directly host any of the content\n\n\t\n\n\nExtended interview with The Pirate Bay&amp;#039;s co-founders\nThe IFPI&amp;#039;s view on The Pirate Bay\n\nBut although it may not break Swedish laws that has not prevented the authorities from trying to close it down. Last year police raided the building and seized its servers.\n\nBut what the authorities did not expect were the public protests that followed.\n\nIn the main the protesters were angry about the US film industry telling their parliament what to do. They believed that senior US politicians forced their government to shut The Pirate Bay down, even though it was not doing anything illegal under Swedish law. And that really sparked public debate.\n\nThe raid happened during an election year and file-sharing became a mainstream issue - it spawned a dedicated political party that quickly became Sweden&amp;#039;s third largest outside of parliament.\n\n&quot;You could argue that this is stealing,&quot; says Rick Falk Vinge, Pirate Party leader. &quot;The point is it doesn&amp;#039;t matter.&quot;\n\n&quot;If you are to enforce copyright in the digital age, where a lot of this takes place in private communications, if you are to enforce that you need to monitor all private communications, and that&amp;#039;s not worth it to society or politically.&quot;\n\n&amp;#039;Okay to copy&amp;#039;\n\nThree days after The Pirate Bay was shut down it came back to life and now Sweden&amp;#039;s pirates say they cannot be stopped.\n\nThis is partly because now The Pirate Bay servers have moved abroad. The site&amp;#039;s controllers say that they do not even know where they are. At least one server stayed in Sweden and it is in the vaults of a bank in Stockholm, where it is hoped it will remain safe.\n\n\t\nI still go to the movies, I still spend money on the movies. Everybody does it so everybody wants to download movies\nPeter Sunde, The Pirate Bay\n\nThe re-location of the servers is all part of the cat and mouse game the site plays with police.\n\nFredrik Neij and Peter Sunde make up half of team behind The Pirate Bay. Their weapons are standard laptops, hardwired to the net because they do not trust wireless connections.\n\nFredrik does all the technical stuff: the server maintenance, the upgrading, the hardware and Peter works with the media and does a bit of programming on the site.\n\nNeither one sheds a tear for makers of movies, music and software.\n\nSays Peter: &quot;I think it&amp;#039;s okay to copy. They get their money from so many places that the sales is just one small part.\n\n&quot;Take the latest Bond movie. What car was it? Oh, it&amp;#039;s a BMW. His phone is a Sony Ericsson. I don&amp;#039;t think that&amp;#039;s a coincidence. I think they got a load of money for having those products in the movie.&quot;\n\nBoth Fredrik and Peter use their site to download content.\n\n&quot;I don&amp;#039;t care,&quot; says Peter. &quot;That&amp;#039;s the big thing, I don&amp;#039;t care. If I want it, I take it, &amp;#039;cause I can. It might be moral to some people but I think it&amp;#039;s up to me to decide.\n\n&quot;Why should they [take action against me]? I still go to the movies, I still spend money on the movies. Everybody does it so everybody wants to download movies. The public opinion is it should be legal.&quot;\n\nNor does Peter feel obliged to pay for what he is downloading.\n\n&quot;I do pay for it by listening to music, by bringing the music to my friends, they bring it to their friends and they go to concerts, I go to concerts,&quot; he says. &quot;The actual product doesn&amp;#039;t have to cost anything in order to make money.&quot;\n\nTargeting the file-sharers\n\nUnsurprisingly, that is not a view shared by the entertainment industry, as Jo Oliver from the International Federation for the Phonographic Industry explains.\n\n&quot;It&amp;#039;s just not practical to give away a creation for free,&quot; she insists. &quot;There are people that need to be paid, who have worked on those recordings.\n\n\t\nWe&amp;#039;ll see what happens in the criminal trial in Sweden next year. Hopefully that will lead to the closure of The Pirate Bay, but that remains to be seen.\nJo Oliver, IFPI\n\n&quot;Copyright is the mechanism and the law to make sure that that investment is rewarded and therefore that there will be more money to foster new artists, bring new content to the public.\n\n&quot;That&amp;#039;s how it works.&quot;\n\nFor those not persuaded, legal action awaits. The UK music sharing site OiNK has recently been taken down as has the popular TV Links sharing site.\n\nThere have also been wins for the industry in France, where the president is pressing for file-sharers to be tracked and disconnected should they persist.\n\n&quot;We don&amp;#039;t want The Pirate Bay to continue to operate in its current form just simply because of the damage that it&amp;#039;s causing,&quot; says Jo Oliver.\n\n&quot;There is a Swedish criminal action underway. We&amp;#039;ll see what happens in the criminal trial in Sweden next year. Hopefully that will lead to the closure of The Pirate Bay, but that remains to be seen.&quot;\n\n\t\nPeter Sunde\nNobody is crying that people who used to go around selling ice to people do not have a job anymore because of the fridge\nPeter Sunde, The Pirate Bay\n\nThe future\n\nRough waters may lie ahead for The Pirate Bay - but even if the legal challenge succeeds, not all are sure anything will change.\n\nAt least one national newspaper reporter thinks politicians have little appetite here to start changing Sweden&amp;#039;s laws, just to close down the site.\n\n&quot;In Sweden, surprisingly many people have been file-sharing,&quot; explains Mats Carlbom, a Swedish political reporter. &quot;And it&amp;#039;s not only young people, obviously. Maybe over a million, maybe two million people have been file sharing.\n\n&quot;The politicians haven&amp;#039;t solved the problem. That&amp;#039;s why I think the whole issue is put on hold. They don&amp;#039;t know how to tackle this problem.&quot;\n\nAs Swedish society ponders the way forward, Fredrik is busy shoring up defences. He is working on a new system of sharing files. He says it will be faster, more reliable, and make users harder to track.\n\nThe open source version, he says, cannot be brought up or brought down by commercial interests. They are both taking the music and film industries to court for what they claim are illegal attacks on their site. And if The Pirate Bay is outlawed they will just move abroad and run it from another country.\n\nThe ship, they claim, can no longer be sunk.\n\n&quot;Nobody is crying that people who used to go around selling ice to people do not have a job anymore because of the fridge,&quot; says Peter. &quot;It would be stupid but it is the same thing.\n\n&quot;Technology has changed. You can&amp;#039;t go back, there&amp;#039;s no way to go back. And I don&amp;#039;t think there&amp;#039;s a will to go back.&quot; ","torrent":{"xt":"urn:btih:6a2f6f9f234c73aab847a2f73a7c010a66f663a2","amp;dn":"Click-The+views+from+The+Pirate+Bay%5BXviD%5D%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a2f6f9f234c73aab847a2f73a7c010a66f663a2","infoHashBuffer":{"type":"Buffer","data":[106,47,111,159,35,76,115,170,184,71,162,247,58,124,1,10,102,246,99,162]},"announce":[],"urlList":[]}}