{"title":"S.T.A.L.K.E.R. - Nuclear Snow [mod] - Reseed","uid":3764139,"size":368654170,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6b5eb8398a71465ac6931b8bb7adee305d803170&amp;dn=S.T.A.L.K.E.R.+-+Nuclear+Snow+%5Bmod%5D+-+Reseed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"saveO","files":1,"time":1186354912,"description":"WHAT IT IS:\nNUCLEAR SNOW is a graphical overhaul of Stalker, where the world mostly is\nblack and white with strong contrasts whilst some objects, effects and blood\nis highlighted with color, making even more contrast between the edited graphics.\nThe movie Sin City has been used as a reference (http://www.imdb.com/title/tt0401792/), which should give you an idea of what to expect.\n\n\nTHE CHANGES:\n-Retexturing of over 3000 textures\n-Stronger bumpmaps\n-Stronger parallaxmaps\n-Bigger bloodmarks\n-Bigger bloodpuffs\n-Light from headlamp extended\n-Weathercolors altered\n-Fireparticles extended\n-Modified Carrymod2 inserted, compatible with Carrymod3\n\n\nHOW THIS RESULT WAS ACHIEVED:\nSeveral tests were made before I came up with a somewhat good result. What I had\nto do was to change many textures, sky, ground, foliage and actors to be able to\nsee how the result might end up, so before making the final overhaul, there were\nplenty of hours photoshoping and batchrunning. The final retexturing took me several days, mostly because of the different settings for every texture to not loose alphachannels and to get a good result on the image - amongst the other textures.\nSo, when I ended up with my favorite result, I recorded it in Photoshop as a macro and then ran it on a couple of files at the time, mostly the same group of textures, just to not loose track of where I was editing. To be able to edit and save into Stalker&amp;#039;s textureformat I used Nvidias DDS-plugins for Photoshop.\nAfter that, the fun part took place, I started editing some images, like blood, artifacts and some other textures, to achieve the strong contrast in a gamescene. Then some shaderediting and lightcolorchanges in the engine took place, and finally it ended up with this result. Some time was also spent on looking for the grasstexture, which GSC has hidden well, thank you nokturnal over at oblivion-lost.de&amp;#039;s forum for pointing them out.\n\nSo, hopefully now you&amp;#039;ll be able to play this with the amusement it was intended to give.\n\n\nINSTALLATION:\nTo make this mod run correctly, all you need to do is to extract the folder &amp;#039;gamedata&amp;#039; in the rar-package to your STALKER&amp;#039;s rootdirectory, for instance: C:Program FilesTHQS.T.A.L.K.E.R.gamedata\n\n\nNOTE: \nThis mod should be installed on top of Carrymod3 (or just leave out the file\nsystem.ltx if you install Carrymod3 afterwards). \nIt is not compatible with any other mod that changes textures on ground, sky or models, it will run but it will not retain the intended overall look.\t","torrent":{"xt":"urn:btih:6b5eb8398a71465ac6931b8bb7adee305d803170","amp;dn":"S.T.A.L.K.E.R.+-+Nuclear+Snow+%5Bmod%5D+-+Reseed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b5eb8398a71465ac6931b8bb7adee305d803170","infoHashBuffer":{"type":"Buffer","data":[107,94,184,57,138,113,70,90,198,147,27,139,183,173,238,48,93,128,49,112]},"announce":[],"urlList":[]}}