{"title":"Ouran High School Host Club - All 26 episodes!!","uid":4004345,"size":4773650432,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6b9f193fea940768f7153bfaf54723029e9a2205&amp;dn=Ouran+High+School+Host+Club+-+All+26+episodes%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AkQ","files":26,"time":1201736050,"description":"Haruhi Fujioka is a scholarship student at Ouran High School, a fictional school located in Bunkyo, Tokyo. Because of the superlative cost of the school uniform, Haruhi resorts to wearing long slacks, polo shirts and vests. Combined with her large glasses and tousled short hair, Haruhi's look causes her to be confused for a boy.\n\nLooking for a quiet place to study, Haruhi stumbles upon the Third Music Room, the working place of the Ouran Host Club, a group of six attractive male students (Takashi &quot;Mori&quot;, Mitsukuni &quot;Hunny&quot; Kaoru and Hikaru, Tamaki, and Kyoya) who spend their time charming and entertaining the school's girls for profit. During their first meeting, Haruhi accidentally knocks over a vase valued at 8,000,000 yen, estimated to be 80,000 dollars.\n\nIn order to pay off the large deabt, Haruhi is employed as the club's &quot;dog&quot; and constantly ordered to do menial tasks like serving food or cleaning up. The Club president, without knowing she is really a girl, promotes Haruhi to &quot;host&quot; as soon as he discovers her potential. Even after the truth comes out in the Club, Haruhi continues the charade and is allowed to pay off the rest of her debt working as a host; provided she conceals her true identity/gender from the customers.\n\n\n\n\nGroup is Lunar!\n\n\n\n","torrent":{"xt":"urn:btih:6b9f193fea940768f7153bfaf54723029e9a2205","amp;dn":"Ouran+High+School+Host+Club+-+All+26+episodes%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b9f193fea940768f7153bfaf54723029e9a2205","infoHashBuffer":{"type":"Buffer","data":[107,159,25,63,234,148,7,104,247,21,59,250,245,71,35,2,158,154,34,5]},"announce":[],"urlList":[]}}