{"title":"BBC.Bloody.Omaha.avi","uid":3968057,"size":500127744,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6bc89f48d1607ae9d1cca1c52a8f3f3320cb8de6&amp;dn=BBC.Bloody.Omaha.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"howardroarke","files":1,"time":1199844168,"description":"More than 60 years ago, the fate of World War II turned on five beaches in Normandy, France. D-Day was the greatest amphibious invasion ever attempted. History remembers it as a great victory. But new research reveals that on Omaha Beach, it was very nearly a disaster. German defences there were far more ferocious than expected. A massive air strike intended to take them out, was a total failure. For the troops charged with this mission, it would become a killing zone.\n\nBecause it was the toughest and the bloodiest, Omaha Beach has become a symbol to represent all of the Normandy Invasion. History records that within hours 2,000 men were cut down. But now new research has found that in reality, the casualty figures were more than double that.\n\nThe story of D-Day has been re-told in dramas such as Saving Private Ryan. But what really happened on Omaha Beach in June 1944? What was it like for the men who had to fight their way ashore here - and how did they manage to win when so much seemed to go so wrong?\n\nBloody Omaha uses strong, emotional personal testimony; expert interviews with historians and military experts from both of the Atlantic; ambitious drama reconstruction and state of the art Computer Generated Imaging to she new light on one of the iconic stories of WWII.\n\nThe discovery of a captured German map and the re-emergence of an entire German battery, hidden under the Normandy soil for over sixty years, bring a new insight into how the strength of the German defences had increased significantly between the planning for D-Day and the invasion itself.\n\nThe latest historical research reveals a startling turning point to a battle we thought we knew. Timewatch goes in search of the full true story of Bloody Omaha.","torrent":{"xt":"urn:btih:6bc89f48d1607ae9d1cca1c52a8f3f3320cb8de6","amp;dn":"BBC.Bloody.Omaha.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bc89f48d1607ae9d1cca1c52a8f3f3320cb8de6","infoHashBuffer":{"type":"Buffer","data":[107,200,159,72,209,96,122,233,209,204,161,197,42,143,63,51,32,203,141,230]},"announce":[],"urlList":[]}}