{"title":"Moshiach The Creed. (dvd islam 911 bbc)","uid":3776957,"size":1120782624,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6c359e2eec22db6a550130de4d2d5076151f926b&amp;dn=Moshiach+The+Creed.+%28dvd+islam+911+bbc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sayanim","files":36,"time":1187425419,"description":"Moshiach - The Creed.\n\n&quot;I believe with perfect faith in the coming of the moshiach, and though he may tarry, still I await him every day.&quot; - Principle 12 of Rambam&amp;#039;s Thirteen Principles of Faith.\n\n\nThe main track of this DVD NTSC (other tracks are present) is a fascinating presentation by ordained Rabbi Mordechai, who kindly shares with us the understandings and goals of what appears to be : Rabbinic Judaism.\n\nAt the end of each session, Rabbi Mordechai tells us to &quot;pray in unison for the coming of MOSHIACH, the real jewish messiah&quot;.\n\nMoschiach, the long awaited jewish messiah, is described by jewfaq.org as follow :\n\n_ &quot;The word &quot;moshiach&quot; does not mean &quot;savior&quot;...&quot; \n\n_ &quot;Belief in the eventual coming of the moshiach is a basic and fundamental part of traditional Judaism.&quot;\n\n_ &quot;In the Shemoneh Esrei prayer, recited three times daily, we pray for all of the elements of the coming of the moshiach : ingathering of the exiles...&quot;\n\n_ &quot;The moshiach will be a human being, not a god, demi-god or other supernatural being.&quot;\n\n_ &quot;The moshiach will be a great political leader.&quot;\n\n_ &quot;The moshiach will be a great military leader, who will win battles for Israel.&quot;\n\n_ &quot;The moshiach will bring about the political and spiritual redemption of the Jewish people by bringing us back to Israel and restoring Jerusalem. HE WILL ESTABLISH A GOVERNMENT IN ISRAEL THAT WILL BE THE CENTER OF ALL WORLD GOVERNMENT.&quot;\n\n\nSome researchers assert that those beliefs and convictions play a key role in shaping the course of our world today (...WWI, WWII, 9-11, iraq, lebanon, iran, &quot;war on terror&quot;...etc).\n\nEducating The Amalekites...One Goy at a Time.\n\n================================\n\nKeywords : dvd islam 911 9-11 alex jones nwo malcolm x noam chomsky cat stevens yusuf islam empire of faith lone gunmen zionism ted pike bbc pbs iraq documentary jesus bible quran new world order psychology wtc world trade center cia anti-christ the illuminati vietnam september 11 ","torrent":{"xt":"urn:btih:6c359e2eec22db6a550130de4d2d5076151f926b","amp;dn":"Moshiach+The+Creed.+%28dvd+islam+911+bbc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c359e2eec22db6a550130de4d2d5076151f926b","infoHashBuffer":{"type":"Buffer","data":[108,53,158,46,236,34,219,106,85,1,48,222,77,45,80,118,21,31,146,107]},"announce":[],"urlList":[]}}