{"title":"Joomla!Mambo Phill-Taylor Professional Plugins","uid":4005675,"size":2959316,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6d03491e723d49199a896e287180fdd14f1ea103&amp;dn=Joomla%21Mambo+Phill-Taylor+Professional+Plugins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boghitza","files":1,"time":1201813022,"description":"The password can be found @\n\n &lt;a href=&quot;\nhttp://www.template-tuners.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.template-tuners.com&lt;/a&gt;\n\n\n\n=============================================\n\n\nAkoForms.Component\n\nmosDirectory_v2.2.4\n\nmosKnowledgebase.v0.6\n\nmosListMessenger.v2.0.6\n\nMultisites.Site.Manager.v1.0.3\n\nPhil_a_form.v1.2.00\n\nmosIPN.v2.5.1\n\nmosGuestBook.v2.0\n\nMosLock.v2.8\n\nMyPMS.Pro\n\nSEF.Advance.v4.2.2\n\nJoomla Components by Phil Taylor are some of the leading Joomla extensions available, written by the world&amp;#039;s leading commercial developer of Joomla Plugins. This site has been providing quality Joomla! solutions and products for over 3 years.\n\n&quot;&quot;We don&amp;#039;t do this as a hobby - we do this as a company for a living!&quot;&quot;\n\n\n* AkoForms Mambo Component - AkoForms is a fully integrated form mailer component for Joomla!/Mambo CMS. It was especially developed to set up forms inside Joomla!/Mambo fast and simple.\n\n\n* mosDirectory v2.2.4 - mosDirectory is a Joomla Component for creating a web based directory like yellow pages by using Joomla!\n\n\n* mosGuestBook v2.0 - With this component you will be able to let visitors leave their own little personal stamp on your website. Written to take advantage of all features in Joomla/Mambo you can now accept comments on your site and even get instant notification when comments are left.\n\n\n* mosIPN v2.5.1 - mosIPN takes orders made by PayPal and delivers the software or digital download by Email to the purchaser.\n\n\n* mosKnowledgeBase v0.6 - mosKnowledgebase is a Component for creating and managing a complete Knowledgebase system easily all within Joomla!\n\n\n* mosListMessenger v2.0.6 - mosListMessenger is a mailing list component for Joomla, allowing you to send emails to 1000&amp;#039;s of people using Joomla!\n\n\n* mosLock v2.8 - mosLock takes orders made by PayPal and creates registered users on your Joomla website. Use this to charge for entry to your Joomla site.\n\n\n* Multisites Site Manager v1.0.3 - A new component from elearningforce.dk, this is one of the few components currently available for Joomla that will allow you to manage multiple Joomla websites. The component is advertised as a tool to set up an elearning website. By creating new Joomla websites for &quot;courses&quot; you are able to quickly clone a base Joomla installation and transfer users. On closer examination, this component might be useful to anyone that needs to maintain more than one Joomla website, learning or otherwise.\n\n\n* MyPMS Pro - MyPMS is a professional private messaging system designed specially for powerful Joomla!/Mambo CMS. This script is a full blown private messaging solution that enables users to send messages to other users and have full control over their messages.\n\nAmong the features: Multiple boxes, Fully backend configuration, Mambo native templating system, User Support Features (for admins), multilanguage support, multiple(bulk) messages, message tracking, Enhanced User Profiles,\n\n\nMambo 4.5.0 and 4.5.1a Compatibility, Community Builder - SimpleBoard Support, Realtime message check and so many other features.\n\n\n* Phil-A-form v1.2.00 - Phil-A-Form allows Joomla!/Mambo admins to easily create complex dynamic forms using this component on their Joomla!/Mambo site, quickly with no programming knowledge!\n\n\n* SEF Advance v4.2.2 - SEF advance is a Joomla!/Mambo addon which will extend built-in search engine friendly URL functionality and raise it on a higher level. Instead of ordinary SEF URLs like: http://www.site.com/content/view/1/2/ which don&amp;#039;t tell much about your content you will get URLs in form:\n &lt;a href=&quot;\nhttp://www.site.com/Section_Name/Catego&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.site.com/Section_Name/Catego&lt;/a&gt; ... Item_Name/","torrent":{"xt":"urn:btih:6d03491e723d49199a896e287180fdd14f1ea103","amp;dn":"Joomla%21Mambo+Phill-Taylor+Professional+Plugins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d03491e723d49199a896e287180fdd14f1ea103","infoHashBuffer":{"type":"Buffer","data":[109,3,73,30,114,61,73,25,154,137,110,40,113,128,253,209,79,30,161,3]},"announce":[],"urlList":[]}}