{"title":"Home comming saga","uid":3976864,"size":1226669582,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6dbfe3d53751897f73ff17ab43f96e8bc04d070f&amp;dn=Home+comming+saga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hater-hater","files":182,"time":1200328456,"description":"Humanity has lived for 40 million years on a planet called Harmony, after leaving an Earth that has been destroyed by human conflict. In order not to repeat the mistakes that led to the destruction of civilization on Earth, a computer, known as the Oversoul, was left as guardian of this planet.\n\nIts main mission was to prevent humans from developing technologies that could make wars a global affair. For that, humans were genetically modified so they could communicate with the Oversoul. However, after this long time the Oversoul is beginning to fail, and it chooses a group of humans to return to Earth in search of the Keeper of Earth, in the hopes it will be able to find a way to maintain power over the people on Harmony.\n\nTo this end the Oversoul recruits Volemak, father of Nafai, the protagonist of the story. Nafai and Issib, his brother, begin to try and defy the Oversoul&amp;#039;s capability to override thought. Through this they learn of the danger that it is in. Nafai begins hearing the Oversoul&amp;#039;s voice in his mind. The first book focuses on the family&amp;#039;s eventual betrayal, the taking of the Index, and the downfall of the man Gaballufix, who had been planning to ally the city with a malignant nation.\n\nNafai, Elemak and Mebbekew, his older half brothers, Issib, his father Volemak, and Zdorab are eventually forced to leave the city. They come back to retrieve the Index of the Oversoul, which allows them to communicate with it directly. Because of Nafai&amp;#039;s careless blunders and miraculous successes, Elemak, Nafai&amp;#039;s oldest brother, begins to hate him, a theme that will play out throughout the rest of the saga.\n\nWhile technically this book is science fiction, its main focus is drama and the complex relationships between people.","torrent":{"xt":"urn:btih:6dbfe3d53751897f73ff17ab43f96e8bc04d070f","amp;dn":"Home+comming+saga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dbfe3d53751897f73ff17ab43f96e8bc04d070f","infoHashBuffer":{"type":"Buffer","data":[109,191,227,213,55,81,137,127,115,255,23,171,67,249,110,139,192,77,7,15]},"announce":[],"urlList":[]}}