{"title":"Between Science and Garbage (2004-tzadik-xvid)","uid":3362223,"size":734059837,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6e2c8f9f5978e4a39745c893fc25d8a28e1ad845&amp;dn=Between+Science+and+Garbage+%282004-tzadik-xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"batztoutai","files":3,"time":1122558302,"description":"Living Cinema: Between Science and Garbage\n\nThis experimental video/performance is a Living Cinema/Tzadik release where Pierre H&amp;eacute;bert (invented 'live scratch animation' in 1986 which he presented in concerts with various musicians) and Bob Ostertag (who has released 21 cd's and appeared at music, film and multimedia festivals around the globe) presents us with a avantgardish/noiseinspired improvisational concert/happening. This is art in the making, and the soundtrack is fabulous! Everything is made 'live' (both music and videoart), and for me it was a real blast to see, I was totally sucked up by the evolving soundscapes and dazzling imagery.\n\n----------------------------------------------------------------------\n\n[from http://detritus.net/ostertag/lc-dvd.html]\n\nLiving Cinema is an open-ended project which has tried to reflect the changing world in which it was created. The current phase, which we call Between Science and Garbage, began in San Francisco in 1999 during a residency at the Yerba Buena Center for the Arts.\n\nThis was when San Francisco was attracting unprecedented wealth from around the world through financial speculation in internet technology, yet homelessness was rising at the same time. The themes of food (both wholesome and garbage) and technology (today's being science, yesterday's being garbage) come from this period.\n\nThe work took a major turn when we performed a concert at the Walker Art Center in Minneapolis just days after September 11, 2001. It was at this point that the weight of world events became so heavy that it was impossible to keep them out of the project. For example, what we had intended as a rain of people and garbage was now interpreted as a rain of falling bodies and debris from the World Trade Center. Flour, which we had thought of as snow on ruins, was universally understood as Anthrax. And so on.\n\nSince we could not keep world events out of the piece, we decided to throw open the door and let them in. The airplane and exploding space shuttle were added. An oil tanker broke apart off the Spanish coast while we were touring in Europe, and its image was added. The Red Brigades killed a policeman on a train in Italy, and this was also added, as was a train of US military supplies bound for Iraq which passed through Slovenia while we were performing in Ljubljana. And we started using the front page of the day's newspaper from whatever city we were in as the first image in the show (some of which are seen at the start of the DVD).\n\nThere is really no appropriate way to end these notes. The winds of world history, far from subsiding, continue to gather force and the forecast is ever more dark. Living Cinema will continue to be tossed and turned in the tempest, along with everything else. The present work is just a snapshot (actually, a video clip) of a critical period in the gathering storm.\n\nWe hope it helps give meaning to others who feel as overwhelmed as we do.\n\n\n-- Pierre H&amp;eacute;bert and Bob Ostertag, September, 2003\n\nThe &quot;film&quot; version of Between Science and Garbage which is featured on this DVD was made from concert recordings during a European tour in February and March 2003. Some concert segments were incorporated without alteration, while others were reprocessed, and in some cases new material was added.\n\nOur approach is not one of creating a &quot;concert recording&quot; from which the &quot;mistakes&quot; were removed. Rather, we wanted to use the transition from live performance to DVD as an opportunity to develop our work in another direction. Our intention was to produce a work that is more nuanced and controlled than what is possible in a live performance, yet without losing the urgency that results from the improvisational origin of both sound and image.\n\nFurther performances will no doubt be fundamentally influenced by the experience of making the DVD. In this sense, Living Cinema is similar to many of our projects, which do not center on a fixed work of art, but are more like an idea stream which flows through different media. Different realizations are like snapshots of the stream at different points along the route.\n\n\nSource.........: DVD Retail\nFormat.........: Xvid\nSize...........: 716 MB\nPAL/NTSC.......: NTSC\nScreen format..: 4:3\nVideo bitrate..: 1711 kb/s\nFps............: 29.970\nQf.............: 0.290 bits/pixel\nAudio..........: 256 kb/s (128/ch, stereo) CBR MP3\nFs.............: 48000 Hz","torrent":{"xt":"urn:btih:6e2c8f9f5978e4a39745c893fc25d8a28e1ad845","amp;dn":"Between+Science+and+Garbage+%282004-tzadik-xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2c8f9f5978e4a39745c893fc25d8a28e1ad845","infoHashBuffer":{"type":"Buffer","data":[110,44,143,159,89,120,228,163,151,69,200,147,252,37,216,162,142,26,216,69]},"announce":[],"urlList":[]}}