{"title":"SoundConverter +[K].dmg","uid":3370705,"size":16142952,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6e8d1283b5c6f3fff8ca5ffe1f2c078bc59490f2&amp;dn=SoundConverter+%2B%5BK%5D.dmg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cedrik_tt","files":1,"time":1124220362,"description":"OVERVIEW\n---------\n\nSoundConverter is a Cocoa OSX application for converting sound files between different sound formats. \nNote that not all wav and wma encodings are supported.\n\nINPUT FORMATS\n--------------\n\n4xm, 8svx, ac3, aif, aifc, aiff, al, au, auto, avi, avr, cdr, cvs, dat, dv, fap, ffm, flac, gsm, h263, h264, hcom, ircam, la, lu, m4v, mat, mat4, mat5, maud, mov, mp2, mp3, mpc, mpeg, mpegts, nist, nul, ogg, paf, prc, pvf, raw, redir, rm, rtp, rtsp, s16be, s16le, s8, sb, scm, sd2, sdp, sf, sffd, shn, sl, smp, snd, sndt, sph, svx, sw, swf, txw, u16be, u16le, u8, ub, ul, uw, vms, voc, vorbis, vox, w64, wav, wma, wve, xi\n\nOUTPUT FORMATS\n----------------\n\n8svx, aac, ac3, aif, aifc, aiff, al, au, auto, avr, cdr, crc, cvs, dat, dv, fap, ffm, flac, gsm, h263, h264, hcom, ircam, la, lu, m4v, mat, mat4, mat5, maud, mp2, mp3, mp4, mpeg, mpegts, nist, nul, ogg, paf, prc, pvf, raw, rm, rtp, s16be, s16le, s8, sb, sf, shn, sl, smp, snd, sndt, sph, svx, sw, swf, txw, u16be, u16le, u8, ub, ul, uw, vcd, vms, vob, voc, vorbis, vox, w64, wav, wve, xi\n\nRINGTONE FORMAT\n---------------\n\n3210, bmp, emelody, emy, imelody, imy, kws, midi, mid, nokia, sckl, rtttl, rtx, siemens, 3210, bmp, dsp, emelody, emy, ems, imelody, imy, kws, midi, mid, mot, nokia, sckl, pdb, rtttl, rtx, samsung1, samsung2, siemens, seo\nnotes \n\nNOTES :\n------\n\n1. Conversion from sample based formats (mp3, wav, etc) to note based formats (midi, ring tones, etc) is not supported. \n2. Real Media formats are not well supported. \n3. DRM protected files conversions are not supported\n\nUSAGE \n------\n\nJust set the options and drag in sound files to the app window or onto the app icon. If a folder is dragged in, SoundConverter will recursively descend all subfolders and convert found files.\n\nREQUIREMENTS\n-------------\n\nMacOSX 10.2 - 10.3 required for some conversions\n\n\nHOW TO CRACK ?\n---------------\n\nInstructions for cracking are in French in dmg files.\n\nHere's the translation in English :\n\n- Install Application Enhancer if it's not installed on your mac\n- Reboot\n- Unzip SoundConverter and Crackbox\n- Launch CrackBox\n- Drag the application SoundConverter in &quot;autocrack&quot; field of CrackBox\n- Clic on &quot;Apply&quot;\n\nSometimes you need to retry this several times to crack SoundConverter\n\n\nEnjoy !","torrent":{"xt":"urn:btih:6e8d1283b5c6f3fff8ca5ffe1f2c078bc59490f2","amp;dn":"SoundConverter+%2B%5BK%5D.dmg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e8d1283b5c6f3fff8ca5ffe1f2c078bc59490f2","infoHashBuffer":{"type":"Buffer","data":[110,141,18,131,181,198,243,255,248,202,95,254,31,44,7,139,197,148,144,242]},"announce":[],"urlList":[]}}