{"title":"Pop Cap Hits Vol.1 [USA] [PS2DVD] ","uid":4013355,"size":1376748075,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:6f8ff19cff47ad839b1005b4b4de3c4ae4ca91c1&amp;dn=Pop+Cap+Hits+Vol.1+%5BUSA%5D+%5BPS2DVD%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"spatorrent","files":4,"time":1202222679,"description":"PopCap brings casual hits to the PlayStation 2! BEJEWELED 2: Hall of Fame Inductee: Computer Gaming World 2002 (the only puzzle game inducted since Tetris in 1988). Its the gem swapping puzzle classic, now on PlayStation 2! Players swap gems in sets of three or more for brilliant, explosive acgtion. Secret game modes, timed play, brain twisting puzzles and more. Wildly addictive, high carat fun! Dazzling 3D special effects Explosive jewels: Power Gems, Hyper Cubes and Time Bombs Stunning planetary backdrops, stirring sound effects and entrancing music Four ways to play: Classic, Action, Puzzle, and Endless Unlockable secret modes. ASTRO POP: Fire your rockets and blast off to high speed, arcade puzzle action. As one of four space pilots, players use unique abilities and weaponry to grap groupls of bricks, blast them in combos, and clear a path to the stars. An offbeat storyline adds to the stellar fun. Stunning 3D special effects, cool sound FX and hi res, full screen graphics Four pilots to choose from, each with unique skills Hours of play in two modes: Classic and Survival Dozens of bonus rounds to challenge your wits and stamina.","torrent":{"xt":"urn:btih:6f8ff19cff47ad839b1005b4b4de3c4ae4ca91c1","amp;dn":"Pop+Cap+Hits+Vol.1+%5BUSA%5D+%5BPS2DVD%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f8ff19cff47ad839b1005b4b4de3c4ae4ca91c1","infoHashBuffer":{"type":"Buffer","data":[111,143,241,156,255,71,173,131,155,16,5,180,180,222,60,74,228,202,145,193]},"announce":[],"urlList":[]}}