{"title":"Eviscerated Zombie Tampon - F*ck Easter Sessions (Noise/Grind)","uid":3349914,"size":142575767,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7157a0527495eca424d21a8ff3af502db9d8a751&amp;dn=Eviscerated+Zombie+Tampon+-+F%2Ack+Easter+Sessions+%28Noise%2FGrind%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"splattergod","files":14,"time":1120012037,"description":"Just a little head's up regarding EZT..... \nEZT is a comedy based improv noise/grind band out of Tampa, Florida.... \nTotally politically incorrect, and bound to offend most.... \nMore of a social commentary, than typical music act..... \nOften compared to Anal Cunt meets Gwar... \nCrazy stage shows, lots of insanity, and noise! \nEnjoy \n\n------------------------------------------------------------------------ \n\n\nArtist - Eviscerated Zombie Tampon \nGenre - Noise/Blur/Grind \nTitle - Fuck Easter - Original Master \nLocation - The Brass Mug \nDate - 04/03/04 \nRecorded by - JD \nSoundboard Recording \nRunning Time - 22:29 \n\nThis is the original live recording of EZT's Infamous \n\n&quot;Fuck Easter&quot; Release. \nTotally raw and unmixed!!! \n\nSONGS- \n\n1) Fish Heads (The Ballad of Club Venom) 1:53 \n2) Fuck Easter 0:49 \n3) I Fucked My Neighbor's Cat Just to See the Expression on it's Face 1:40 \n4) Cum-Filled Easter Egg Hunt 0:24 \n5) Anti-music in Total Opposition of Scene Support 1:34 \n6) Let's Enroll in Columbine High and Finish the Job/Fuck You Nu-metal Fags 1:42 \n7) The 8th Sin Must Be Homosexuality 1:15 \n8) I Want To Join Judas Priest ( So I Can Rape Retarded Boys) 1:13 \n9) Cock: The Real Passion of Christ 2:04 \n10) Half the Band Couldn't Make it So We Got These Fuckers Instead 2:47 \n11) Went to Rhode Island for the World's Biggest Barbecue 0:54 \n12) Lars Ulrich Sucks Corporate Cock 2:05 \n13) Pederast Priest (Racist Redneck Rebels cover) 4:04 \n\nBIO - \n\nEviscerated Zombie Tampon (EZT) was conceived one evening \n\nduring the summer of 2003 following a week of consuming \n\nmass quanities of drugs and alcohol. Completely annoyed \n\nabout the state of the current underground scene (and \n\npretty much everything else) Sir Nekro Cuntsplitter and \n\nPussymaggot Bootylicious decided to join forces and \n\nunleash the most vile, retarded, over -the- top form of \n\nblur/grind that the world had ever heard. Ignoring the \n\nfact that neither of them had any musical ability, talent \n\nor experience, they began to seek out like minded (other \n\nassholes) people who shared their vision of aural chaos. \n1st to be contacted was Josh Maggotruin. After forcing him \n\nto ingest a shitload of roofies and taking pictures of him \n\nwith farm animals, he was blackmailed into joining the \n\nband. \n\nNext to be &quot;coerced&quot; into joining was Pete DeMaio. After \n\npromising him riches, drugs, and hookers, he was tricked \n\ninto signing a 50 year contract as EZT's guitarist. \n\nNext to come along was one of Tampa's most reknowned \n\nassholes, &quot;Moshing&quot; Martin Manley. As he had no \n\nexperience/ability to play any instrument, he was \n\nimmediately given the bass guitar position. \n\nIt was about this time that Sir Nekro Cuntsplitter was \n\nkidnapped by a perverted, sexcrazed lunatic by the name of \n\nBlack Wydow who proceeded to sexually assault him for a \n\nmonth straight with objects better left undiscussed. She \n\nwas eventually offered the positions of keyboardest and \n\nsecond drummer, as she has shown herself to be more than \n\ncapable of handling big sticks. In exchange for being \n\nallowed to join the band, she promised to free Sir Nekro 1 \n\nweekday a month, to recuperate. \n\nSpacey King Cosmo III, never a true member of the band, \n\nwas a last minute addition who filled in for Pete during \n\nEZT's debut live performance. The band decided he had to \n\ngo mainly due to his bizarre obsession with Michael \n\nJackson's monkey, &quot;Bubbles&quot; (don't ask) \n\nUnfortunately, Josh was no longer able to commit to the \n\nriggers of being in EZT and was replaced by Baron von \n\nQueefhuffer, formerly of the boy band, Anal Pleasures. \n\nAfter deep meditation, or an overdose of prescription pain \n\nmedication, &quot;Moshin&quot; Martin Manley has re-awoken and \n\nchristened himself as Muhamed Faahk Yeumahma. Proving that \n\ntalent and EZT do NOT go hand in hand, Buster Highman was \n\noffered the guitar slot, vacated by Pete DeMaio, and \n\nunfortunately accepted. \n\nAfter about 1/2 year of stability, EZT suffered another \n\nline-up change after Baron von Queefhuffer opted to leave \n\nin order to fulfil his lifetime goal of being an Animal \n\nPornographer. After 5 minutes of tryouts (and one helluva \n\nblowjob) Harry Rectum was offered the job of \n\nstick-banger....actually, we demanded that he be our \n\ndrummer and after he was forced to endure 16 hours of \n\nStryper, he gladly accepted our gracious offer. This \n\nline-up is now as stable as a 3-legged table along the \n\nCalifornia faultline. \n\nOfficial Website: http://www.geocities.com/ezt_rules \n\nBio/Discography Site: \n\nhttp://www.tartareandesire.com/bands/ezt.html \n","torrent":{"xt":"urn:btih:7157a0527495eca424d21a8ff3af502db9d8a751","amp;dn":"Eviscerated+Zombie+Tampon+-+F%2Ack+Easter+Sessions+%28Noise%2FGrind%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7157a0527495eca424d21a8ff3af502db9d8a751","infoHashBuffer":{"type":"Buffer","data":[113,87,160,82,116,149,236,164,36,210,26,143,243,175,80,45,185,216,167,81]},"announce":[],"urlList":[]}}