{"title":"Spaced_[TV-serie]_-_Made_and_acted_by_the_director_of_Shaun_of_t","uid":3352439,"size":3260747776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:71b4b605e5459538ecad2a178c425d0a0ebff806&amp;dn=Spaced_%5BTV-serie%5D_-_Made_and_acted_by_the_director_of_Shaun_of_t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smartypants","files":14,"time":1120564473,"description":"If you like: Shaun of the dead, Family Guy, South Park and/or American Dad, you will love this tv-serie!\n\nhttp://www.imdb.com/title/tt0187664/\n\nAll comedies should be like this, 3 February 2001\nAuthor: Damian Keenan (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e581888b8e80808ba5848a89cb868a88&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\n\nHaving just watched this series again, I am prepared to say that &quot;Spaced&quot; is definitely one of the greatest comedy shows EVER!\n\nFunny, striking, imaginative, clever, compassionate, sarcastic, inventive, etc, etc, etc. You get the impression that co-stars and co-writers, Simon Pegg and Jessica Stevenson, just cannot write a boring line of dialogue or envisage a predictable scene. Using its &quot;nothing new&quot; premise (mismatched couple pretend to be romantically entangled to find a place to live), this show twists and turns its way off into many brilliant and original directions, while never failing to provide the required belly laughs along the way.\n\nIt uses movie in-jokes and references in a way that would make Tarantino envious, and the hipness of its execution makes it both a show that, paradoxically, is of the moment but is also certain to be talked about in ten or twenty years from now.\n\nThe cast are all first-rate: Pegg and Stevenson manage to be both madcap and touching, and are backed up by a sterling supporting cast of fresh and exciting talent. Julia Deakin as Marsha, the flirtatious middle-aged landlady and Mark Heap as the pretentious but vulnerable artist from hell, Brian, make a hilarious double act; Nick Frost is a real find as military mad Mike; and Katy Carmichael as the initially snobby Twist manages to be dotty without turning up the annoyance factor.\n\nEven the guest appearances are great. My two personal favourites are Michael Smiley as the chemically enhanced Tyres O'Flaherty, a non-stop raver who even dances to the ringing of a telephone; and the excellent Charles Dale (II), who is usually cast as the heavy, but gives a marvellous comic performance here as the &quot;yes man&quot; security guard who helps our bumbling heroes rescue their beloved pooch, Colin, from an evil freelance vivisectionist!\n\nCredit must also be given to director Edgar Wright who has created a unique and vivid look to the show, enhancing the script's wired look at the banalities of everyday life with his brilliant use of camera movement, lighting, cross-cutting, flashbacks, etc. Even if it wasn't funny (which it most emphatically is), &quot;Spaced&quot; would get top marks for being the best looking show on the box.\n\nI could go on, but &quot;Spaced&quot; is a comedy that needs to be seen to be believed, and then seen again...and again...and again...","torrent":{"xt":"urn:btih:71b4b605e5459538ecad2a178c425d0a0ebff806","amp;dn":"Spaced_%5BTV-serie%5D_-_Made_and_acted_by_the_director_of_Shaun_of_t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71b4b605e5459538ecad2a178c425d0a0ebff806","infoHashBuffer":{"type":"Buffer","data":[113,180,182,5,229,69,149,56,236,173,42,23,140,66,93,10,14,191,248,6]},"announce":[],"urlList":[]}}