{"title":"Fraps 2.6.0 LATEST!!! registered version (game movie recorder)","uid":3348871,"size":2846385,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:71b66e8ed340a5837495690e8f75ddbab772f21e&amp;dn=Fraps+2.6.0+LATEST%21%21%21+registered+version+%28game+movie+recorder%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polyvinyl","files":1,"time":1119792567,"description":"15th June 2005 - Fraps 2.6.0 Released\n\nThis major update adds a much requested feature to directly specify the video capture frame rate. You can now enter any value from 10 fps up to 100 fps with three decimal places of precision. Great for capturing directly to many common video formats including 23.976, 29.97, and 59.94 fps.\n\nHardware mouse cursors are a feature in many modern games and you now have the ability to capture the screen with or without the cursor overlay. Simply select the No Cursor option to prevent the HW cursor from being saved in your film.\n\nWe've introduced a new 64-bit video capture engine for games such as Far Cry and Chronicles of Riddick now available in native Windows x64 format. 64-bit code offers many performance advantages and we will be continuing to optimize in this area with future releases.\n\nA brief reminder to please ensure that your video drivers are up to date. This means at least the 71.89 Forceware drivers available from nVidia, or the 5.6 Catalyst drivers from ATI. The 5.6 Catalysts fix a lot of issues with OpenGL and are highly recommended for Radeon owners.\n\n\nChangelog\n\n2.6.0 - 15th Jun 2005\n- Added custom movie frame rate selection (record from 10 to 100 fps)\n- Added option to capture video with or without hardware mouse cursor\n- Added support for 1-bit Windows hardware cursors\n- New 64-bit video capture engine under Windows x64\n- Improved performance capturing half-size video on most systems\n- Fixed PNG and JPG screenshots for native 64-bit games\n- Fixed detailed benchmark statistics not saving for native 64-bit games\n- Fixed OpenGL error raised when capturing with Radeon graphics card\n- Fixed horizontal graphic noise in video capture of old DirectX titles\n- Fixed graphic corruption capturing Winamp AVS plugin\n- Fixed codec playback crash when out of memory","torrent":{"xt":"urn:btih:71b66e8ed340a5837495690e8f75ddbab772f21e","amp;dn":"Fraps+2.6.0+LATEST%21%21%21+registered+version+%28game+movie+recorder%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71b66e8ed340a5837495690e8f75ddbab772f21e","infoHashBuffer":{"type":"Buffer","data":[113,182,110,142,211,64,165,131,116,149,105,14,143,117,221,186,183,114,242,30]},"announce":[],"urlList":[]}}