{"title":"Loop!station - Conversations With Water [2005] MP3 192kbps","uid":4005938,"size":57356470,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:733a2dc9bae8d774660441041b5424aa151d103c&amp;dn=Loop%21station+-+Conversations+With+Water+%5B2005%5D+MP3+192kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dkords","files":8,"time":1201822551,"description":"Loop!Station are a contemporary classical duo from San Francisco who have mastered the art of live looping technology. Their music has classical influences that are juxtaposed with a cappella harmonies. Golden cello player Sam Bass begins each song by introducing a backing track precisely sequenced into the loop station. He then establishes a bassline which rest upon a harmonious melody. Once enough audio layers have been arranged, the vocal talents are performed by the gifted Robin Coomer. Her triple vocal harmonies are at times operatic and at tranquil moments, will be soft and soothing.\n\nLoop!Station have an unforgettable stage presence that amazes everyone when they perform their live sessions. It&amp;#039;s incredible to witness two musicians map an entire world of music around them. Their equipment consists of one microphone, four digital delays, three reverbs and a distortion pedal. All loops are originally created and sequenced live on stage in front of an entire audience. During their Studio Z set, the duo treated the audience to a never-play-live track entitled: &quot;Last Time I Saw You I Nearly Drank Myself To Death&quot;. Additional highlights included the live version of &quot;Hello&quot;. Robin Coomer&amp;#039;s resonating vocals have an astonishing effect, as they will stay with you well after the live performance has finished.\n\nLoop!Station&amp;#039;s debut album &quot;Conversations With Water&quot; reflects suttle moods with deeply beautiful layers of music. Most memorable is the penultimate track &quot;Fandango&quot; which perfectly integrates all of Loop!Station&amp;#039;s greatest strengths. Complex sound sculptures are created using multiple loops cleverly correographed together. Loop!Station paint a wonderful soundscape which is best experienced live. Cellist Sam Bass also performs with Deadweight and has featured on Mr. Bungle&amp;#039;s &quot;California&quot; release on Warner Bros. Records. Robin Coomer has also contributed her vocals to Birdsaw, Eric McFadden and Faun Fables. Loop!Station are currently recording their next album and showcasing their new material to audiences from San Francisco to New York..","torrent":{"xt":"urn:btih:733a2dc9bae8d774660441041b5424aa151d103c","amp;dn":"Loop%21station+-+Conversations+With+Water+%5B2005%5D+MP3+192kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733a2dc9bae8d774660441041b5424aa151d103c","infoHashBuffer":{"type":"Buffer","data":[115,58,45,201,186,232,215,116,102,4,65,4,27,84,36,170,21,29,16,60]},"announce":[],"urlList":[]}}