{"title":"Solitude - Trying To Make A Difference","uid":4012796,"size":2796609,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:73ecbe7e16142b970f8ec9345472833f76fdc42d&amp;dn=Solitude+-+Trying+To+Make+A+Difference&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"solitude123","files":1,"time":1202190245,"description":"Myspace.com/solitude123\n\n\nBorn and raised in Connecticut ( CT ), Solitude is making waves in the rap / hip-hop world on both a local and national level. Solitude is well known for his strong views, outrageous opinions, and large fan base, especially on the popular friend networking site Myspace. Solitude is recognized for starting Do It Up Productions, a company run by him and a very close business partner. Do It Up Productions is also based out of Connecticut ( CT - 203 ), and is an independent record label.\n\n\nSolitude has multiple search keys that turn results on large search engines such as Google.com and Alltheweb.com :\n\n&quot; Rapper Solitude &quot;\n&quot; Rap Solitude &quot;\n&quot; CT Solitude &quot;\n\nAlso, topics about this artist can be seen on other largely popular websites targeting the youth such as: UrbanDictionary.com (one of the 2000 highest web traffic sites)\n\n\nIt has also been reported that Solitude may be a child prodigy. According to most people, this isn&amp;#039;t far from believable considering that by age 17, Solitude has had 6 years of experience in the music business and is already returning #1 search results on Google, a search engine which indexes more than 8 billion pages.\n\nNotable for his steady increase in followers, Solitude&amp;#039;s music page has risen to: over 18,000 fans - more than 76,000 views - and exceeded 100,000 plays in less than 2 years time.\n\n\n(Influences: Eminem, Kid Rock, D-12, 50 Cent, Dr. Dre, Ludacris, Xzibit, Ja Rule, Slipknot, Hatebreed, Pantera, Nirvana, Nickelback, Three Days Grace, Korn, Metallica, Monster Magnet and others)\n","torrent":{"xt":"urn:btih:73ecbe7e16142b970f8ec9345472833f76fdc42d","amp;dn":"Solitude+-+Trying+To+Make+A+Difference","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73ecbe7e16142b970f8ec9345472833f76fdc42d","infoHashBuffer":{"type":"Buffer","data":[115,236,190,126,22,20,43,151,15,142,201,52,84,114,131,63,118,253,196,45]},"announce":[],"urlList":[]}}