{"title":"Jetico Personal Firewall v.2.0.0.37 full {rar with keygen}","uid":3893065,"size":3423206,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:74d4e25dd2d7c7d760e24f63983fbd646502a595&amp;dn=Jetico+Personal+Firewall+v.2.0.0.37+full+%7Brar+with+keygen%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fil76","files":1,"time":1195085892,"description":"Jetico Personal Firewall v.2.0.0.37\n\nSuperior defence\nJetico Personal Firewall uses multiple level filtering scheme to provide highest protection level. Jetico Personal Firewall outperformed Zone Alarm, Outpost and other well known products in independent tests: \n  Matousec.com personal firewall test results.\n  Firewallleaktester.com personal firewall test results.\nFlexible configuration\nJetico Personal Firewall is unique rule based firewall on the market. Its open confuguration does not contain hidden rules and dependencies. You can inspect or modify every bit of configuration. \nTotal control\nIn addition to real-time statistics, Jetico Personal Firewall displays real-time rules activity information. Logging subsystem allows user to trace down any firewall event. \nJetico Personal Firewall operating systems support\nWindows Vista\nWindows Vista x64 edition\nWindows Server 2003\nWindows Server 2003 x64 edition\nWindows XP\nWindows XP x64 edition\nWindows 2000\n\nNew features in Jetico Personal Firewall v.2\n\nSystem-related\nJetico Personal Firewall v2 runs as privileged Windows service. It can protect computer before user logon. \nNative support for Windows XP Fast User Switching and Terminal Services.\nJetico Personal Firewall supports Access Control Lists for all main functions. Administrator can configure ACL to grant access to particular firewall functions for any user or group.\nWindows XP Service Pack 2 Security Center support.\nUser interface\nImproved rule editing interface.\nNew popup message. The new look for popup dialog is presented. Popup message text and rule creation options can be modified.\nFirewall variables formerly controlled by Configuration Wizard, are integrated into main application window.\nLanguage file support for easy localization. All translatable words and phrases are taken from single UTF-8 encoded text file. \nConfiguration\nNew XML-based open configuration file format. Detailed documentation is available upon request.\nThe new version maintains single protected firewall configuration for all users.\nSimplified controls for configuration.\nNew hash handling scheme. Separate table for hash checking.\nEach firewall filtering layer has own root table.\nNew automatic variables (per-connection) for local connections are supported.\nFirewall rules\nRules support lists of parameters where possible.\nIP rules support IP address ranges.\nLow level protocol rules support filtering by MAC address.\nApplication rules have events for direct and indirect access to network. Indirect access details are also available.\nNew module for hash checking created.\nApplication, Process attack and Hash checking rules support wildcards in file paths.\nLogging subsystem\nLog entries can be associated with rule.\nFirewall can create rule based on log information.\nNew WELF-compatible text log format. WELF is supported by many log analyzers.\nImproved log control.","torrent":{"xt":"urn:btih:74d4e25dd2d7c7d760e24f63983fbd646502a595","amp;dn":"Jetico+Personal+Firewall+v.2.0.0.37+full+%7Brar+with+keygen%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d4e25dd2d7c7d760e24f63983fbd646502a595","infoHashBuffer":{"type":"Buffer","data":[116,212,226,93,210,215,199,215,96,226,79,99,152,63,189,100,101,2,165,149]},"announce":[],"urlList":[]}}