{"title":"Nine Inch Nails - Y34RZ3R0R3M1X3D D474 (Year Zero Remixed Data)","uid":3979156,"size":7087562876,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:75b497f7c94c8e391750868e320375f026786547&amp;dn=Nine+Inch+Nails+-+Y34RZ3R0R3M1X3D+D474+%28Year+Zero+Remixed+Data%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"MrOmega","files":1,"time":1200445135,"description":"Nine Inch Nails - Y34RZ3R0R3M1X3D D474 (Year Zero Remixed Data)\n\nThis is the DVD Bonus (CD DATA) that is in the Special Edition of the HALO 25 - Y34RZ3R0R3M1X3D\n\nThe DVD has not compressed, so it&amp;#039;s a full DVD!\n\nTo burn the .UIF files you will need the program MagicISO ( http://thepiratebay.se/tor/3976662/Magic_ISO_Maker_5.4_with_serial )\n\n---------------------------\nThe DVD info that is on the cd &quot;book&quot;\n\n&quot;Data Disc\n\nTo expand the concept of the &quot;remix record&quot; we&amp;#039;ve decided to give you all the tools necessary to experiment with the process yourself. Included on this DVD is everything you need to get strarted remixing every track from Year Zero. Simply place this Data DVD in you Mac or PC and view the Read Me file.\n\nContained on this Data DVD all of the tracks from Year Zero as Multitrack Files in the following formats:\n- Garageband for MAC (works with logic as well)\n- Ableton Live for PC or Mac (demo applications included)\n- Generic Wave Files at 16 bit 44k for any audio editor\n\n\nAn explanation:\nIn the studio, we recorde everything in a multitrak format, separating all the parts onto different &quot;tracks&quot; that can be manipulated individually. These tracks are then mixed down to two tracks - left and right (stereo) - that arrive to you in the form of a CD or MP3.\nWe&amp;#039;re giving you all of the individual multitraks that were used to create the stereo ones you know. By loading those tracks into the eppropriate multitrack application of your choice you can remix and manipulate the original parts to your liking.\n\nOn a MAC, Garageband is the easiest way to check the process out. Simply load a song and hit the cpace bar - then start pushing buttons and see what happens.\nAbleton Live ia an application that we use a lot for composing. It runs on MAC or PC so we&amp;#039;ve also included that format for your convenience.\nAgain, load a song and hit the space bar to get started.\nThe generic Wavw Files are included for those that use any other program that can load wave files (which should be all of them, MAC or PC).\n\nIf you&amp;#039;d like to see what others have done with this or add your own creations, please visit: remix.nin.com and join the community.&quot;\n---------------------------\n\n\n\nAnd once again, if you like this DVD buy it! (but I think that Trent will be happy if you still this =P )","torrent":{"xt":"urn:btih:75b497f7c94c8e391750868e320375f026786547","amp;dn":"Nine+Inch+Nails+-+Y34RZ3R0R3M1X3D+D474+%28Year+Zero+Remixed+Data%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75b497f7c94c8e391750868e320375f026786547","infoHashBuffer":{"type":"Buffer","data":[117,180,151,247,201,76,142,57,23,80,134,142,50,3,117,240,38,120,101,71]},"announce":[],"urlList":[]}}