{"title":"Coach Carter [DVD XViD AC3 2005]","uid":3358240,"size":1467591723,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76973e5cfcc0e5ec97cec415777cf7dfc66041c6&amp;dn=Coach+Carter+%5BDVD+XViD+AC3+2005%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Divxtotal.CoM","files":5,"time":1121804999,"description":"TITULO.ORIGINAL:Coach Carter \nNACIONALIDAD:EE:UU \nG&amp;Eacute;NERO:Drama \nA&amp;Ntilde;O:2005 \nDIRECTOR:Thomas Carter \nFECHA DE ESTRENO EN DVD:20.07.05 \nDURACION:136 Minutos \nREPARTO:Samuel L. Jackson, Rob Brown, Robert Ri'chard, Rick Gonzalez, Nan Gbewonyo, Antwon Tanner, Channing Tatum, Ashanti, Texas Battle, Denise Dowse, Debbi Morgan, Mel Winkler, Vincent Laresca, Sidney Faison, Octavia Spencer, Sonya Eddy, Gwen McGee \nPUNTUACION.EN.IMDB:6.8/10 (3,141 votos) \nDISTRIBUIDORA:Paramount \n\nSIPNOSIS: \n\nLa tensi&amp;oacute;n iba en aumento seg&amp;uacute;n los Oilers de Richmond High se preparaban para enfrentarse al inminente campeonato de baloncesto. La ciudad bull&amp;iacute;a de excitaci&amp;oacute;n en torno a su invicto equipo local y en cada partido las gradas se llenaban de fans vociferantes. Nadie pod&amp;iacute;a imaginar que el d&amp;iacute;a 4 de enero de 1999 la comunidad iba a dividirse de una forma tan violenta, alterando para siempre el destino de muchas vidas, a causa de una decisi&amp;oacute;n del entrenador Ken Carter, que sell&amp;oacute; el gimnasio y se neg&amp;oacute; a permitir que entraran en &amp;eacute;l los jugadores por haber suspendido &amp;eacute;stos sus ex&amp;aacute;menes. Jugar al baloncesto en el high school requiere algo m&amp;aacute;s que habilidad, perseverancia, disciplina y trabajo en equipo... sobre todo si tu entrenador es alguien como Ken Carter. Para poder saltar a la pista de juego hay que firmar un contrato por el que uno se compromete a dar lo mejor de s&amp;iacute; mismo en la cancha y en las clases. Carter no se preocupa s&amp;oacute;lo de ganar el partido sino de asegurar el futuro de su equipo. Por eso, cuando sus jugadores empiezan a suspender, Carter cierra el gimnasio e impide que el equipo practique e incluso que juegue. \nCarter persiste en su actitud pese a la oposici&amp;oacute;n de los directivos del high school y de los airados padres de los jugadores, que ven en el baloncesto la &amp;uacute;nica v&amp;iacute;a para que sus hijos puedan salir de Richmond. Tambi&amp;eacute;n Carter estudi&amp;oacute; en Richmond High y tambi&amp;eacute;n le encantaba jugar al baloncesto. Y aunque era un buen jugador - tiene en su haber varios records no superados a&amp;uacute;n en el historial de la escuela - Carter piensa que el lugar que ocupa en la vida se lo debe a sus estudios y no al baloncesto. Y quiere que los chicos de su equipo antepongan la educaci&amp;oacute;n al ocio, quiere que sus sue&amp;ntilde;os de futuro no se circunscriban al aro del tablero de baloncesto, sino que contemplen una serie ilimitada de opciones y posibilidades. \n","torrent":{"xt":"urn:btih:76973e5cfcc0e5ec97cec415777cf7dfc66041c6","amp;dn":"Coach+Carter+%5BDVD+XViD+AC3+2005%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76973e5cfcc0e5ec97cec415777cf7dfc66041c6","infoHashBuffer":{"type":"Buffer","data":[118,151,62,92,252,192,229,236,151,206,196,21,119,124,247,223,198,96,65,198]},"announce":[],"urlList":[]}}