{"title":"Bukowski - Tales of Ordinary Madness - Marco Ferreri Double Feat","uid":4012654,"size":8018855936,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7a02a4e8c111bbd75c2a92d19cd94e64afac14ac&amp;dn=Bukowski+-+Tales+of+Ordinary+Madness+-+Marco+Ferreri+Double+Feat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"oddeven","files":1,"time":1202180736,"description":"Tales of Ordinary Madness - 1981 http://imdb.com/title/tt0086410/\n\nDon't Touch the White Woman! - 1974 http://imdb.com/title/tt0072305/\n\nAnother Bukowski installment.  Somehow nobody ever resembles him (even symbolically)... Mickey Rourke? Matt Dillon? Patrick Bouchitey?  All somewhat pretty faces to take on the role of the haggard Henry Chinaski in all his variations. Josse De Pauw came the closest in Crazy Love. Maybe after Mickey Rourke's boxing damage and plastic surgery disasters, he might do well to reprise his role.\n\nBen Gazzara works well here without damning Hollywood looks, but it's the supporting characters who really fit the story well.\n\nThis one is based on &quot;Erections, Ejaculation, Exhibitions, and General Tales of Ordinary Madness&quot;\n\nThere are some scenes which, like Lune Froide, make it clear why this was not well distributed in the US (not that I agree with that choice in any way).\n\nAs I noted in the title, this is a double feature.  It's an original DVD9 with two films on it, so don't expect the greatest quality. Tales of Ordinary Madness is clearly in better shape than Don't Touch the White Woman!  Also, Don't Touch the White Woman! has English permasubs, since the movie is in French.  Don't get shocked when the titles for Tales of Ordinary Madness come up in French, the movie is an English original, but an Italian/French coproduction.\n\nA few words about Don't Touch the White Woman:\n\nThere is a reprise of most of the male actors from Marco Ferreri's &quot;La Grande Bouffe&quot; from a year earlier http://imdb.com/title/tt0070130/ , a classic that I might up soon. Marcello Mastroianni, Michel Piccoli, Ugo Tognazzi, and Philip Noiret.  The female lead is Catherine Deneuve.\n\nThe story covers the life of George Custer, and filming was done in the pit which would become the Pompidou Centre.\n\nIf you like this stuff, I highly recommend the other two Bukowski ups I have here.\n\nUncompressed PAL iso\n\nQuantity is better than quality when seeding, a rarity in nature. Seed at least 1:1, rather than a long trickle until people give up and the torrent dies.","torrent":{"xt":"urn:btih:7a02a4e8c111bbd75c2a92d19cd94e64afac14ac","amp;dn":"Bukowski+-+Tales+of+Ordinary+Madness+-+Marco+Ferreri+Double+Feat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a02a4e8c111bbd75c2a92d19cd94e64afac14ac","infoHashBuffer":{"type":"Buffer","data":[122,2,164,232,193,17,187,215,92,42,146,209,156,217,78,100,175,172,20,172]},"announce":[],"urlList":[]}}