{"title":"Lost - Missing Pieces","uid":4002911,"size":102845212,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7a147218c6152ed0899a0ec5b82aa10cbfbe2c86&amp;dn=Lost+-+Missing+Pieces&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"themainburger","files":25,"time":1201657016,"description":"Lost: Missing Pieces is a series of 13 mobisodes/webisodes, available for viewing first on Verizon mobile phones, and six days later on ABC.com. Featuring new content that is incorporated into the existing storyline of Lost, the mobisodes are considered a canonical extension of the series. Each mobisode fills in a narrative gap somewhere in the timeline from the first three seasons. The mobisodes are released weekly, leading up to the Season 4 premiere, and are between 1:22 &amp; 3:27 minutes in length.\n\n    01 - The Watch\n    02 - Hurley and Frogurt\n    03 - King of the Castle\n    04 - The Deal\n    05 - Operation: Sleeper\n    06 - Room 23\n    07 - Arzt &amp; Crafts\n    08 - Buried Secrets\n    09 - Tropical Depression\n    10 - Jack, Meet Ethan. Ethan? Jack\n    11 - Jin Has a Temper-Tantrum On the Golf Course\n    12 - The Envelope\n    13 - So It Begins\n\nGetting the mobisodes into production was a two-year process that underwent several delays involving contract negotiations with actors, writers, and directors.\n\nThe mobisode series was originally announced in November 2005 under the name Lost Video Diaries. ABC had intended for it to be a spin-off series produced separately from Touchstone Television, introducing new characters played by non-union actors, similar to the mobisode series 24: Conspiracy. However, believing that it should be made with the union talent from the television series, the cast and crew of Lost called upon the major entertainment guilds to negotiate contracts for the mobisodes. \n\nWith the distribution of the Lost storyline on the forefront of new technologies (e.g., ARGs, podcasts, online viewing, and iTunes downloads), the financial issues of mobile content distribution had been wholly unknown to entertainment industry unions. Brenda Ching of SAG&amp;#039;s Hawaii branch first encountered these issues with regard to Lost and described them to the larger national unions. In April 2006, the three major guilds negotiated a first-of-its-kind agreement in the industry between Touchstone and Lost, allowing for actors, writers, and directors to work under guild auspices and be compensated for the mobisode series.\nLost Video Diaries\n\nAt Comic-Con 2006, it was announced that the mobisodes would be appearing during the Season 3 winter break. The premise was that Hurley would find a functional DHARMA video camera and use it to record events on the Island, and that the video tape would have a previously unseen DHARMA orientation film on it. Some people speculate that some of this footage was shot and kept in storage however it was never released to the public. As Season 3 came around, some of the cast members&amp;#039; contracts still had not been secured for the mobisodes, and Touchstone was being dissuaded by other industry producers from going ahead with the deals. As a result, production was further delayed, and the 13 week break was instead filled with Lost Moments.\n\nIn June 2007, after Season 3 had aired, it was reported that the mobisodes would appear in the fall of 2007, featuring the entire cast. Carlton Cuse said the mobisodes would give the hardcore Lost viewer more information that they probably weren&amp;#039;t going to get through the show itself. On November 6, 2007, the second day of the WGA strike (where one of the primary issues was the same sort of residuals that Lost cast and crew were receiving for the mobisodes) The Watch appeared on Verizon phones, and the series was revealed to be titled Lost: Missing Pieces.\n\n\nThe Watch \t\nThe Watch\nMobisode number: 01\nOriginal air date: November 6, 2007 (Verizon)\nNovember 12, 2007 (ABC.com)\nMain characters: Jack Shephard\nWritten by: Carlton Cuse\nDirected by: Jack Bender\nPlot: Christian is talking with Jack about his wedding, which is later that day. Christian reveals that his father disapproved of him marrying Margo, and that was the reason he didn&amp;#039;t wear the watch given to him by his father on his wedding day. However, he tells Jack that he is doing the right thing marrying Sarah and passes the watch to Jack, who immediately puts it on.\nGuest starring: John Terry as Christian Shephard\n\t\n\nHurley and Frogurt \t\nHurley and Frogurt\nMobisode number: 02\nOriginal air date: November 13, 2007 (Verizon)\nNovember 19, 2007 (ABC.com)\nMain characters: Hugo Reyes\nWritten by: Edward Kitsis and Adam Horowitz\nDirected by: Jack Bender\nPlot: Hurley comes out of Rose&amp;#039;s and Bernard&amp;#039;s tent. Neil comes up, and ask what he is doing. He looks at the bottle of DHARMA Cabernet that Hurley has dropped, and then asks if Hurley is going to make a move on Libby. He asks because he has his eyes upon her himself. Hurley tells him that he just now has a date with Libby. Neil reluctantly relents and walks away.\nGuest starring: Sean Whalen as Neil Frogurt\n\t\n\nKing of the Castle \t\nKing of the Castle\nMobisode number: 03\nOriginal air date: November 20, 2007 (Verizon)\nNovember 27, 2007 (ABC.com)\nMain characters: Ben Linus and Jack Shephard\nWritten by: Brian K. Vaughan\nDirected by: Jack Bender\nPlot: Ben and Jack play chess. Ben asks Jack if he would consider staying on the Island. Jack asks Ben if he intends to keep his promise to let Jack leave. Ben says that its not all up to him in that the Island will not necessarily let Jack leave. He also tells Jack that if he does leave, there might be a time when he would want to come back. Jack tries an aggressive move in the game and Ben immediately counters with another move (Castling).\nGuest starring: none\n\t\n\nThe Deal \t\nThe Deal\nMobisode number: 04\nOriginal air date: November 26, 2007 (Verizon)\nDecember 3, 2007 (ABC.com)\nMain characters: Michael Dawson and Juliet Burke\nWritten by: Elizabeth Sarnoff\nDirected by: Jack Bender\nPlot: Michael is tied up, when Juliet walks in. She tells him the boat is his, so that he can take Walt away after he will have saved Ben. She comments that Walt is special, that he&amp;#039;s not an ordinary boy, and that&amp;#039;s why she is worried about him. Juliet is glad that Michael is going to get Walt away from the Island and assures him that Ben will do what he wants. She then reveals the deal with Ben she has made herself, concerning her sister. Then she mentions Michael&amp;#039;s list and wishes him good luck.\nGuest starring: none\n\t\n\nOperation: Sleeper \t\nOperation: Sleeper\nMobisode number: 05\nOriginal air date: December 3, 2007 (Verizon)\nDecember 10, 2007 (ABC.com)\nMain characters: Juliet Burke and Jack Shephard\nWritten by: Brian K. Vaughan\nDirected by: Jack Bender\nPlot: Jack is asleep on the beach when Juliet wakes him up. She tells him that since Jack brought her to the camp Sayid and the others have not trusted her and think she is there to hurt them. Before Jack can say he will protect her, Juliet tells him that they are right and she is still working for Ben and she has been sent to the camp to do tests to find out which of the women are pregnant. Jack asks her why she is telling him this and she tells him how she saw Sun&amp;#039;s baby the night before and that she is tired of living Ben&amp;#039;s dream.\nGuest starring: none\n\t\n\nRoom 23 \t\nRoom 23\nMobisode number: 06\nOriginal air date: December 10, 2007 (Verizon)\nDecember 17, 2007 (ABC.com)\nMain characters: Juliet Burke and Ben Linus\nWritten by: Elizabeth Sarnoff\nDirected by: Jack Bender\nPlot: Juliet is outside Room 23 where there is some sort of commotion and an alarm sounding. Ben arrives and Juliet tells him that he (presumably Walt) has done something again and that everybody is too scared to go in there. Juliet suggests that they could bring him back to Michael, but Ben refuses. Ben tells her that Walt is special and that Jacob wanted him there, but Juliet says that he is dangerous. When Ben counters that he is only a child, Juliet brings him outside to show what he has done: a group of dead birds lay on the stairwell.\nGuest starring: none\n\t\n\nArzt &amp; Crafts \t\nArzt &amp; Crafts\nMobisode number: 07\nOriginal air date: December 17, 2007 (Verizon)\nDecember 24, 2007 (ABC.com)\nMain characters: Jin-Soo Kwon, Sun-Hwa Kwon, Michael Dawson and Hugo Reyes\nWritten by: Damon Lindelof\nDirected by: Jack Bender\nPlot: Dr. Arzt tries to convince Jin and Sun not to move from the beach to the caves as Jack has proposed. When Hurley and Michael tell him they can&amp;#039;t understand him, he also expresses his doubts in Jack&amp;#039;s role as a leader to them. However he changes his mind and decides to move to the caves after all when the roaring of the monster interrupts their conversation.\nGuest starring: Daniel Roebuck as Dr. Arzt\n\t\n\nBuried Secrets \t\nBuried Secrets\nMobisode number: 08\nOriginal air date: December 24, 2007 (Verizon)\nDecember 30, 2007 (ABC.com)\nMain characters: Jin-Soo Kwon, Sun-Hwa Kwon and Michael Dawson\nWritten by: Christina M. Kim\nDirected by: Jack Bender\nPlot: Sun is watching Jin fish and then walks into the jungle. There she buries a California drivers license when Michael runs by looking for Vincent. Seeing the license he picks it up and Sun tries to explain that she was going to leave Jin. Michael comforts her telling her it will be okay. The two almost share a kiss but Vincent appears barking before anything can happen, prompting Sun to leave.\nGuest starring: None\n\t\n\nTropical Depression \t\nTropical Depression\nMobisode number: 09\nOriginal air date: December 31, 2007 (Verizon)\nJanuary 7, 2008 (ABC.com)\nMain characters: Michael Dawson\nWritten by: Carlton Cuse\nDirected by: Jack Bender\nPlot: Dr. Arzt is catching a spider in the jungle when Michael comes up and asks about the weather conditions for launching the raft. Then Arzt admits he made up the story about the monsoon because he wanted them to get help with the raft as soon as possible. He then tells Michael he went to Sydney to meet a woman whom he had met on the internet, but that she disappeared during their first dinner in a restaurant.\nGuest starring: Daniel Roebuck as Dr. Arzt\n\t\n\nJack, Meet Ethan. Ethan? Jack \t\nJack, Meet Ethan. Ethan? Jack\nMobisode number: 10\nOriginal air date: January 7, 2008 (Verizon)\nJanuary 14, 2008 (ABC.com)\nMain characters: Jack Shephard\nWritten by: Damon Lindelof\nDirected by: Jack Bender\nPlot: Jack is searching for supplies when he meets Ethan Rom, who gives him a case full of medicine that he says he found in the jungle. Ethan mentions that Claire might have to deliver the baby on the island, and Jack thanks him for his assistance. Ethan tells Jack his own wife died in childbirth along with the baby, and they both hope that rescue is on the way.\nGuest starring: William Mapother as Ethan Rom\n\t\n\nJin Has a Temper-Tantrum On the Golf Course \t\nJin Has a Temper-Tantrum On the Golf Course\nMobisode number: 11\nOriginal air date: January 14, 2008 (Verizon)\nJanuary 21, 2008 (ABC.com)\nMain characters: Jin-Soo Kwon, Michael Dawson and Hugo Reyes\nWritten by: Drew Goddard\nDirected by: Jack Bender\nPlot: Hurley, Michael, and Jin are playing golf on the golf course. After Jin misses a putt to win the game, he goes on a temper-tantrum, shouting in Korean. As Hurley and Michael look on, Jin lets out all of his anger: he is unhappy, he doesn&amp;#039;t want to be pitied, nobody understands him, and he is tired of the handcuff on his wrist. As Michael and Hurley eventually leave, Jin sits down, half crying, and repeating I&amp;#039;m so alone.\nGuest starring: none\n\t\n\nThe Envelope \t\nThe Envelope\nMobisode number: 12\nOriginal air date: January 21, 2008 (Verizon)\nJanuary 28, 2008 (ABC.com)\nMain characters: Juliet Burke\nWritten by: Damon Lindelof and J.J. Abrams\nDirected by: Jack Bender\nPlot: In a familiar scene, Juliet is at her home at the Barracks when she notices that the muffins in the oven are burning. After scalding her hand while taking them out, the doorbell rings. It is Amelia. She helps Juliet, getting some ice for her hand, but realizes that something else is troubling Juliet. She asks if it is Ben, and Juliet says that things have gotten awkward between them. Amelia asks if he finally told her how he felt, but Juliet says he didn&amp;#039;t; things are complicated. After Amelia further presses Juliet about what is going on, Juliet hints that they are somehow in trouble. Juliet then asks Amelia to keep quiet about something she is about to show her. As Juliet pulls an envelope out of the kitchen drawer, the doorbell rings, and the mobisode ends.\nGuest starring: Julie Adams as Amelia\n\t\n\nSo It Begins \t\nSo It Begins\nMobisode number: 13\nOriginal air date: January 28, 2008 (Verizon)\nMain characters: Vincent and Jack Shephard\nWritten by: Drew Goddard\nDirected by: Jack Bender\nPlot: Vincent is running through the jungle on the island, when he encounters Christian Shephard. Christian tells Vincent to find Jack and wake him up because he has work to do. The first scene of Pilot, Part 1 then replays with Vincent encountering Jack as he is regaining consciousness.\nGuest starring: John Terry as Christian Shephard","torrent":{"xt":"urn:btih:7a147218c6152ed0899a0ec5b82aa10cbfbe2c86","amp;dn":"Lost+-+Missing+Pieces","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a147218c6152ed0899a0ec5b82aa10cbfbe2c86","infoHashBuffer":{"type":"Buffer","data":[122,20,114,24,198,21,46,208,137,154,14,197,184,42,161,12,191,190,44,134]},"announce":[],"urlList":[]}}