{"title":"Current Star Wars Comics (up-to-date as of 1-25-08)","uid":3995684,"size":1065557750,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7a30058be8b6bcdf185ed62c76e067976a974aa5&amp;dn=Current+Star+Wars+Comics+%28up-to-date+as+of+1-25-08%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Falleen_Fan_No_1","files":65,"time":1201298568,"description":"Star wars comics are reaching a new plateau in 2008!  \n\n&quot;Star Wars: Vector is a comic to be released by Dark Horse in 2008. It will include the writers John Ostrander and John Jackson Miller, and will cover a single character&amp;#039;s journey through the continuities of Knights of the Old Republic, Dark Times, Rebellion, and Legacy. It will be &quot;similar to Civil War in its scope and style.&quot;[1] \nThe storyline will proceed from Knights of the Old Republic, to Dark Times, then to Rebellion, and finally to Legacy, with each chapter being essentially self-contained.[2] According to Ostrander, it will not involve flow-walking, and the events of Vector will influence all four comics, with the future direction of Legacy being written based on the events of Vector. Jan Duursema will do the art for the Legacy portion.[3] Josh Elliot is working on cover design. (From http://starwars.wikia.com/wiki/Star_Wars:_Vector)\nIf you like Star Wars, but never really read any Star Wars Comics, you might be saying, &quot;But I won&amp;#039;t know what&amp;#039;s going on!!!  Well that&amp;#039;s what I am here for.  I have all of the current running books here up to date (as of 1-25-08) for you to catch up on.  This includes:\n*Knights of the Old Republic 0-24 plus the KotOR Handbook\n*Dark Times 1-7\n*Rebellion 0-10\n*Legacy 0-18 plus 0.5 which is a Legacy Era Handbook.\nThis is all you need to catch up.  Please go buy Knights of the Old Republic #25 on Jan. 30 to support your comic industry!  Because we all know deep down there&amp;#039;s nothing better than a paper comic book.\n\nThanks to all the scanners!  Also, you need CDisplay to view these as a note to newbies to digital comics.\n\n\n\n\n","torrent":{"xt":"urn:btih:7a30058be8b6bcdf185ed62c76e067976a974aa5","amp;dn":"Current+Star+Wars+Comics+%28up-to-date+as+of+1-25-08%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a30058be8b6bcdf185ed62c76e067976a974aa5","infoHashBuffer":{"type":"Buffer","data":[122,48,5,139,232,182,188,223,24,94,214,44,118,224,103,151,106,151,74,165]},"announce":[],"urlList":[]}}