{"title":"Men in Trees S01E05 - Heisse Brise (German)","uid":4018133,"size":413108224,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7a803131f449c5afb4c2a30c32d8ef0b493d81c2&amp;dn=Men+in+Trees+S01E05+-+Heisse+Brise+%28German%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gwodus","files":1,"time":1202495658,"description":"Rip: TV Rip\nFormat: AVI XviD\nResolution: 624 x 352\nLanguage: German &amp; English Track\n\nKurzbeschreibung:\nAlaska wird von einer Hitzewelle heimgesucht, von der auch Elmo nicht verschont bleibt. Das ungewohnte Wetter macht den Bewohnern zu schaffen, doch die schwuele Atmosphaere steigert nicht nur die Schweissproduktion, sondern hat auch einen angenehmen, erotischen Nebeneffekt: Sex liegt in der Luft!\n\nDas erste Paar, das vom Fieber gepackt wird, hat jedoch mit einigen Schwierigkeiten zu kaempfen. Annie ist der Meinung, dass es an der Zeit waere, mit Patrick zu schlafen. Dieser traut sich jedoch nicht zuzugeben, dass er noch Jungfrau ist und Angst vor dem ersten Mal hat. Nachdem Marin ihm Mut zugesprochen hat, nimmt er sich schliesslich doch ein Herz und gesteht Annie seine Jungfraeulichkeit. Annie, die nun alles besonders schoen fuer Patrick machen will, inszeniert ein romantisches Date. Doch Patrick ist so ueberfordert von den ganzen Kerzen und Annies scheinbar hohen Anspruechen an einen Liebhaber, dass der Abend in einem Desaster endet...\n\nBen glaubt nach einem missglueckten Versoehnungsversuch mit Theresa, dass er moeglicherweise ein schlechter Liebhaber sei. Er stattet Sara einen Besuch ab, mit der er einige Jahre zuvor eine Beziehung hatte. Sie findet, dass er der beste Lover ist, den sie je hatte. Zwischen den beiden knistert es gewaltig.\n\nMarin ist besorgt, da es dem Waschbaeren, den sie mittlerweile in ihrem Wandschrank beherbergt, offensichtlich nicht gut geht. Sie bittet Jack um Hilfe. Auch Marin und Jack koennen sich der heissen Atmosphaere nicht entziehen und landen im Bett. Doch danach ergreift Jack ploetzlich die Flucht...\n","torrent":{"xt":"urn:btih:7a803131f449c5afb4c2a30c32d8ef0b493d81c2","amp;dn":"Men+in+Trees+S01E05+-+Heisse+Brise+%28German%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a803131f449c5afb4c2a30c32d8ef0b493d81c2","infoHashBuffer":{"type":"Buffer","data":[122,128,49,49,244,73,197,175,180,194,163,12,50,216,239,11,73,61,129,194]},"announce":[],"urlList":[]}}