{"title":"Jazzinho","uid":3351908,"size":104087460,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7b0ebeb06d74edac0b7cb0a672990f6d99c2f3fc&amp;dn=Jazzinho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"michels","files":16,"time":1120435090,"description":"It's records like this that might one day make acid jazz guru Gilles Peterson up and quit, so complete is this fusion of jazz, Brazilian, '70s FM soul, and any other sound that evokes the image of congas and sequins. One is left to wonder where else the music could possibly go. Translated into &quot;Sweet Little Jazz&quot; in her native Portuguese, Guida de Palma is far more than just a chirpy vocalist meaning to conjure up Pan American fantasies of mojito-lubricated good times. In fact, she produced much of this album with her husband, Stephan Chalangea, joined by Da Lata mastermind Chris Franck, who wrote several of the songs. More upbeat than most of her contemporaries, including Richard Dorfmeister and dZihan &amp; Kamien, yet remaining sultry at every turn, de Palma sings in both English and her native tongue; although either way, the lyrics seem secondary to the constant shake of the maracas. But her songs about love and lush life are exactly the sort of feel-good music one looks for when checking out the Latin jazz section of the iPod. This expanded release comes with additional remixes from London's Phil Asher and Zagreb's hottest house duo, Eddy &amp; Dus, both of whom add some additional low-end punch for the dancefloor while allowing the live vibe to swing free. So this is great music for swinging, too. ~ Joshua Glazer, All Music Guide\n","torrent":{"xt":"urn:btih:7b0ebeb06d74edac0b7cb0a672990f6d99c2f3fc","amp;dn":"Jazzinho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b0ebeb06d74edac0b7cb0a672990f6d99c2f3fc","infoHashBuffer":{"type":"Buffer","data":[123,14,190,176,109,116,237,172,11,124,176,166,114,153,15,109,153,194,243,252]},"announce":[],"urlList":[]}}