{"title":"Vista.Performance.And.Reliability.Pack.Unofficial-Roger525","uid":3758262,"size":12759215,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7be19e95f3b87b9d9cf2fc90380246d4b326d956&amp;dn=Vista.Performance.And.Reliability.Pack.Unofficial-Roger525&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Roger525","files":3,"time":1185846111,"description":"Hey guys, just picked this one up from Neowin.net. I don&amp;#039;t think that download link is going to work for much longer, so here&amp;#039;s a torrent  \n\nHappy downloading! \n\nGreets, Roger525 \n\n--------------------------------------------------------------- \nRelease Notes \n--------------------------------------------------------------- \nThanks Nekrosoft for the news on this major update to Windows Vista that should for most of us improve the speed and reliability of Windows Vista significantly! \n\nPlease note: These fixes break all current methods of bypassing driver singing requirements except the good old F8 during boot (that you have to do every single time you start vista) \n\nIF you are using Rivatuner, atitool and or Peerguardian on 64bit vista, you will have to use F8 every single time to disable driver signing requirements to use those two programs. x86 version is unaffected. \n\nThese updates should go official on the next patch Tuesday (in one weeks time). Please read more for the download links and information on these updates. \n\n938979 Vista Performance and Reliability Pack \nThis update resolves a number of individual issues which may be affecting some computers running Windows Vista. These issues have been reported by customers using the Error Reporting service, product support, or other means. Installing this update will improve the performance and responsiveness for some scenarios and improves reliability of Windows Vista in a variety of scenarios. Some examples of the improvements contained in this update are: \n\nImproves performance in resuming back to the desktop from the Photo and Windows Energy screensaver. \n\nResolves an issue where some secured web pages using advanced security technologies may not get displayed in Internet Explorer on Windows Vista. \n\nResolves an issue where a shared printer may not get installed if the printer is connected to a Windows XP or Windows Server 2003 system and User Access Control is disabled on the Vista client. \n\nResolves an issue where creating AVI files on Vista may get corrupted. \nImproves the performance in calculating the ?estimated time remaining? when copying/moving large files. \n\nImproves performance in bringing up Login Screen after resuming from Hibernate. \n\nResolves an issue where synchronization of offline files to a server can get corrupted. \n\nResolves a compatibility issue with RAW images created by Canon EOS 1D/1DS Digital SLR Camera which can lead to data loss. This only affects RAW images created by these two specific camera models. \n\nResolves an issue where a computer can lose its default Gateway address when resuming from sleep mode. \n\nImproves the performance when copying or moving entire directories containing large amounts of data or files. \n\nImproves the performance of Vista?s Memory Manager in specific customer scenarios and prevents some issues which may lead to memory corruption. \n\n938194 Vista Compatibility and Reliability Pack \nThis update resolves a number of individual issues which may be affecting some computers running Windows Vista. These issues have been reported by customers using the Error Reporting service, product support, or other means. Installing this update will improve the reliability and hardware compatibility of Windows Vista in a variety of scenarios. Some examples of the improvements contained in this update are: \n\nImproved reliability and compatibility of Vista when used with newer graphics cards in several specific scenarios and configurations. \n\nImproved reliability when working with external displays on a laptop. \n\nIncreased compatibility with many video drivers. \n\nImproved visual appearance of games with high intensity graphics. \n\nImproved quality of playback for HD-DVD and Blue-Ray disks on large monitors. \n\nImproved reliability for Internet Explorer when some third party toolbars are installed on Vista. \n\nImproved Vista reliability in networking configuration scenarios. \n\nImproved the reliability of Windows Calendar in Vista. \n\nImproved reliability of systems that were upgraded from XP to Vista. \n\nIncreased compatibility with many printer drivers. \n\nIncreased reliability and performance of Vista when entering sleep and resuming from sleep. ","torrent":{"xt":"urn:btih:7be19e95f3b87b9d9cf2fc90380246d4b326d956","amp;dn":"Vista.Performance.And.Reliability.Pack.Unofficial-Roger525","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7be19e95f3b87b9d9cf2fc90380246d4b326d956","infoHashBuffer":{"type":"Buffer","data":[123,225,158,149,243,184,123,157,156,242,252,144,56,2,70,212,179,38,217,86]},"announce":[],"urlList":[]}}