{"title":"Meet.Miss.Young.and.Her.All.Boy.Band[KRISTEENYOUNG]2005-fierce d","uid":3933696,"size":89302588,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c49aa3b814abd2ad54ac4486188529524922778&amp;dn=Meet.Miss.Young.and.Her.All.Boy.Band%5BKRISTEENYOUNG%5D2005-fierce+d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uncommon.muse","files":14,"time":1197662232,"description":"\nTo learn more of Miss Young (Kristeen Young) visit: http://ectoguide.org/artists/young.kristeen (links there to her personal spaces)\n\nin a nut shell/ an excerpt from the link:\n\nShe was described to me as &quot;Emily Bezar&amp;#039;s evil twin&quot;, and I can sort of see that, though there is a liberal dose of Lene Lovich in here, and even some Diamanda Galas as well. I don&amp;#039;t quite know what I think of it yet. There&amp;#039;s lots of piano, of course, and alternately sweet and banshee-like vocals, with various other things happening in the background.\n\n     For those of you who haven&amp;#039;t heard any of Ms. Young&amp;#039;s music, the most often heard comparisons are really the most apt: Imagine Kate Bush (during her &quot;Babooshka&quot;-video phase) and Lene Lovich, and you&amp;#039;re part of the way there\nshe has a tremendous range, sometimes diving below to low, grungy sounds and then SUPER SUPER (mariah carey...) high notes that are crystal clear and unstrained. she plays piano and composes odd progressions and time signatures. her voice i would compare to kate bush/sarah mclachlan but trust me, there&amp;#039;s no way to compare her to anybody! it&amp;#039;s like her voice quality changes from song to song. anyone who gets her album meet miss young and her all boy band i couldn&amp;#039;t imagine being anything less than stupored! of course, i&amp;#039;m just a HUGE HUGE fan!! her music ranges from alternative to heavy metal to pop to jazz to folk to opera to....\n\nEven stick in the mud ass critics, find her to be exceptional...\n\n&quot;Meet Miss Young &amp; Her All Boy Band is a self-consciously challenging album from Kristeen Young, demonstrating debts to both riot grrrl and New York performance art. Young channels these through the piano, creating a disarmingly noisy and dissonant racket, and while most listeners will find it difficult to meet her halfway, fans of alternative singer-songwriters like Tori Amos and PJ Harvey will find that a handful of her songs have considerable promise.&quot; ~ Stephen Thomas Erlewine, All Music Guide\n\nBottom line: If you enjoy Tori Amos, the Smiths, Dresden Dolls, *just to name a couple widely known/somewhat similar artists* Check out KristeenYoung","torrent":{"xt":"urn:btih:7c49aa3b814abd2ad54ac4486188529524922778","amp;dn":"Meet.Miss.Young.and.Her.All.Boy.Band%5BKRISTEENYOUNG%5D2005-fierce+d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c49aa3b814abd2ad54ac4486188529524922778","infoHashBuffer":{"type":"Buffer","data":[124,73,170,59,129,74,189,42,213,74,196,72,97,136,82,149,36,146,39,120]},"announce":[],"urlList":[]}}