{"title":"O Vidente (Next) 2007 DVDRip Dual Audio","uid":4017257,"size":1796402662,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c63b648d879db26f94365813fc44d1fc1dc3d72&amp;dn=O+Vidente+%28Next%29+2007+DVDRip+Dual+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bozano","files":3,"time":1202436162,"description":"Cris Johnson (Nicolas Cage) e um magico de Las Vegas que possui o dom de prever alguns minutos do futuro proximo. Esta habilidade o ajuda em seu trabalho e tambem nas mesas de blackjack dos cassinos, onde consegue uma boa quantia. Os guardas da seguranÃƒÂ§a de um cassino estao de olho nele, tentando descobrir qual e o truque que Cris usa com as cartas e que lhe da tanta sorte. Paralelamente a agente Callie Ferris (Julianne Moore) o procura para que a ajude a impedir um ataque terrorista em Los Angeles. Porem a medida que o tempo passa a ameaca de uma explosao nuclear torna-se mais real, fazendo com que Cris seja a peca-chave para impedir que uma tragedia ocorra.\n\nLas Vegas showroom magician Cris Johnson has a secret which torments him: he can see a few minutes into the future. Sick of the examinations he underwent as a child and the interest of the government and medical establishment in his power, he lies low under an assumed name in Vegas, performing cheap tricks and living off small-time gambling &quot;winnings.&quot; But when a terrorist group threatens to detonate a nuclear device in Los Angeles, government agent Callie Ferris must use all her wiles to capture Cris and convince him to help her stop the cataclysm.\n\nEnjoy...","torrent":{"xt":"urn:btih:7c63b648d879db26f94365813fc44d1fc1dc3d72","amp;dn":"O+Vidente+%28Next%29+2007+DVDRip+Dual+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c63b648d879db26f94365813fc44d1fc1dc3d72","infoHashBuffer":{"type":"Buffer","data":[124,99,182,72,216,121,219,38,249,67,101,129,63,196,77,31,193,220,61,114]},"announce":[],"urlList":[]}}