{"title":"[Kung Fu] From The Great Beyond aka Those Merry Souls (Yuen Biao","uid":3925205,"size":447231710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7cfa85794d9e3bfcfade40c1e13e9cb2ae163cbb&amp;dn=%5BKung+Fu%5D+From+The+Great+Beyond+aka+Those+Merry+Souls+%28Yuen+Biao&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JamesKees","files":8,"time":1197046300,"description":"From The Great Beyond aka Those Merry Souls (Yuen Biao, 1985) CN - VCD/Rmvb\n\nReviewed by Phil Mills\n\nLung (Biao) and Kwai Tak (Tsang) are two stuntmen who are light years apart in talent but couldn&amp;#039;t be closer in the friendship department.  As they go about their happy go lucky lives, they are completely oblivious to the eerie reality that Lung&amp;#039;s father is in fact a messenger of death - a role passed down through generations where one must guide the souls of the recently departed to the afterlife.  This wouldn&amp;#039;t be a big deal if it didn&amp;#039;t turn out that his next victim was to be Kwai Tak, forcing him to choose between taking the life of his son&amp;#039;s best friend or doing his devilish duty.  Of course being a good father he is unable to bring misery to Lung&amp;#039;s life and chooses to bypass his duty and allow Kwai Tak to live on.  A bad move on his part though as spirits make the worst enemies and as Kwai Tak continues his existence, he is completely unaware of the terrors that not only await Lung&amp;#039;s father for his disobedience but a price that will be repaid by Lung as well.\n\n&amp;#039;Those Merry Souls&amp;#039; is one of those typically quirky 80&amp;#039;s Hong Kong films that falls firmly into the category of &quot;strange but immensely fun&quot;.  Whilst nowhere near the dizzy heights of the classics from the era, it is still littered with copious amounts of infectious humour and ghostly goings on that all allow it to rise above mediocrity. The story is typically foreign to Western audiences due to its concentration on many of the more spiritual aspects of the culture but this is exactly what sets it apart and allows it to cram in everything from a love story to tales of the walking dead.  Cast-wise it calls upon a plethora of well known faces to play even the smallest parts, although it&amp;#039;s Yuen Biao that is given the opportunity to lead the pack.  Whilst not a role that exactly stretches Biao&amp;#039;s physical abilities, he is given more than ample opportunity to demonstrate his comedic timing and proves himself more than capable.  His partner in crime comes in the form of the consistently enjoyable Eric Tsang who is, as per usual, unable to control his womanising urges and has now turned the role of &quot;naive dunce&quot; into an art form. As an added bonus, there are also a couple of fight scenes thrown in for good measure (how could it be a Hong Kong comedy without them?) and these allow Biao to show off his infamous skills although its worth pointing out that they are nowhere near his finest.\n\n&amp;#039;Those Merry Souls&amp;#039; is certainly not the pinnacle of Hong Kong filmmaking as it lacks a couple of ingredients that would push it in amongst the elite but it is still a lot of fun to watch.  The cast list is nothing short of superb and there&amp;#039;s certainly a little bit of everything thrown in to please fans of all genres, it&amp;#039;s just a shame it is yet to appear on DVD.\n\nCast: Yuen Biao, Eric Tsang, Lam Ching Ying, Stanley Fong, Lily Li Li, Rowena Lam\n &lt;a href=&quot;\nhttp://us.yesasia.com/en/PrdDept.aspx/aid-10569/section-videos/code-c/version-all/pid-1002524060/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://us.yesasia.com/en/PrdDept.aspx/aid-10569/section-videos/code-c/version-all/pid-1002524060/&lt;/a&gt;\n\n_________________\nTo Share is to Care! So it seems. Do not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7218131f170119171701321a1d061f131b1e5c1617&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) for a re-seed!\n","torrent":{"xt":"urn:btih:7cfa85794d9e3bfcfade40c1e13e9cb2ae163cbb","amp;dn":"%5BKung+Fu%5D+From+The+Great+Beyond+aka+Those+Merry+Souls+%28Yuen+Biao","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cfa85794d9e3bfcfade40c1e13e9cb2ae163cbb","infoHashBuffer":{"type":"Buffer","data":[124,250,133,121,77,158,59,252,250,222,64,193,225,62,156,178,174,22,60,187]},"announce":[],"urlList":[]}}