{"title":"The Color of Money DVDR MULTI","uid":3366594,"size":4682412032,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7d0ec2fd2b86a3157c87b0f2efa2a3031aa4d4e5&amp;dn=The+Color+of+Money+DVDR+MULTI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rezio","files":1,"time":1123375158,"description":"Martin Scorsese handles directing duties in this 1986 sequel to the classic 1961 film The Hustler, which marks the return of Paul Newman to the role of pool shark Fast Eddie Felson. Anxious to break into the big time again, Eddie finds a talented prot&amp;eacute;g&amp;eacute; (Tom Cruise) to groom; but with the addition of the latter's manipulative girlfriend (Mary Elizabeth Mastrantonio) and the wild streak in Cruise's character, the trio make for a fascinating portrait in group psychology. The cast is brilliant, the script by Richard Price (Clockers) is a paragon of tightly controlled character study and drama (at least in the film's first half), and Scorsese and cinematographer Michael Ballhaus make an ornate show of the collision and flight of pool balls through space--something of a metaphor for the dynamics among the three principals. The film is generally regarded as weaker in its second half, and rightly so, as everything that was interesting in the first place disappears. Still, Newman won a deserved Oscar for his performance. --Tom Keogh  --This text refers to the  VHS Tape edition.","torrent":{"xt":"urn:btih:7d0ec2fd2b86a3157c87b0f2efa2a3031aa4d4e5","amp;dn":"The+Color+of+Money+DVDR+MULTI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d0ec2fd2b86a3157c87b0f2efa2a3031aa4d4e5","infoHashBuffer":{"type":"Buffer","data":[125,14,194,253,43,134,163,21,124,135,176,242,239,162,163,3,26,164,212,229]},"announce":[],"urlList":[]}}