{"title":"RealmCrafter v1.083","uid":4005715,"size":265369533,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d60fe34f5fa2c6424f9d5b64765416491467648&amp;dn=RealmCrafter+v1.083&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Magistr12345","files":1,"time":1201814768,"description":"The Realm Crafter game engine is the heart of the MMORPG development system. The engine creates the virtual game world and the behavior of everything in it. It generates 3D images and handles the network communications. The Realm Crafter engine is designed to be modular, meaning it is broken down into smaller units thus making it easier for you to customize its operations.\n\n\n\nEngine Features:\n\n* No programming language skills required when using the Standard Edition.\n* Scripting language for you to customize your game further still.\n* Source code available for advanced users and coders (requires using BlitzPlus programming language) for the ultimate in game customization.\n* Easy to use editors to create and edit your game world.\n* Low server system requirements.\n* Server-side saving of player accounts.\n* Modular engine construction.\n* A MySQL Player Character Database: Allows you to read and process all character data with a multitude of languages (e.g. PHP, etc).\n* Automatic update system keeps your players up to date with changes to your world.\n* DM accounts allow players to become moderators without buying the engine.\n* Integrated particle system with editor, for a variety of special effects.\n* Comes with a large selection of animated models, textures, sounds and music to get started.\n* Many standard MMORPG features built in, such as animal riding, item crafting, and more.\n* Player vs. Player support: PvP can be turned on/off on a per-area basis.\n* Support for secure trading between players.\n* Up to 4,500 visual combinations per character with different genders, beards, hair, faces, clothes and add-on equipment.\n* Sixteen player character models each with 50 animations such as Karate fighting, magic, swimming, and more.\n* Players can have pets or henchmen.\n* Merchants buy and sell items.\n* Characters can walk, fly or swim around in your game world\n* A variety of built-in screen effects to use as you wish.\n* Players can buy houses to live in, and to store their items.\n* Players can buy a house with a salesman NPC, and set up a shop selling their items, even while they are offline.\n* Define your own attributes, skills, and damage types.\n* Create up to 65,535 items for players to find, trade and use.\n* Create virtual worlds with unlimited areas, allowing your world to be as large and detailed as you like.\n* Allow players to create their own guilds, and send their guild members on quests.\n* Completely change the look of your game GUI with the Interface Editor.\n* Import your own models and animations with the Media Manager.\n* MMORPG Chat system with typical chat commands and functions\n* Create classes and races, or use a skill based system instead\n* A robust monster and Non Player Character (NPC) Artificial Intelligence.\n\nRealm Crafter Requirements\nSystem requirements\n\nMinimum Server: P2-600MHz, 128 MB RAM, internet connection with a static IP\nMinimum Client: P4-1.3ghz, 512 MB RAM, sound card, GeForce 5500 / Radeon 9800 or higher (128MB video RAM), internet or Lan connection.\nWindows 2000 / XP and DirectX 9.0c or above.\nSupported file formats: B3D, 3DS, X, JPG, BMP, PNG, TGA, DDS, WAV, OGG. ","torrent":{"xt":"urn:btih:7d60fe34f5fa2c6424f9d5b64765416491467648","amp;dn":"RealmCrafter+v1.083","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d60fe34f5fa2c6424f9d5b64765416491467648","infoHashBuffer":{"type":"Buffer","data":[125,96,254,52,245,250,44,100,36,249,213,182,71,101,65,100,145,70,118,72]},"announce":[],"urlList":[]}}