{"title":"MS Office Proofing Tools 2007 (The Joker)","uid":3999985,"size":364737935,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7e89a82f906229273a5d852bb483d0316805cec3&amp;dn=MS+Office+Proofing+Tools+2007+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":31,"time":1201512333,"description":"MS Office Proofing Tools 2007 incl. SP1 Croatian\nMS Office Proofing Tools 2007 incl. SP1 Czech\nMS Office Proofing Tools 2007 incl. SP1 Danish\nMS Office Proofing Tools 2007 incl. SP1 Dutch\nMS Office Proofing Tools 2007 incl. SP1 English (US)\nMS Office Proofing Tools 2007 incl. SP1 Finnish\nMS Office Proofing Tools 2007 incl. SP1 French\nMS Office Proofing Tools 2007 incl. SP1 German\nMS Office Proofing Tools 2007 incl. SP1 Greek\nMS Office Proofing Tools 2007 incl. SP1 Hebrew\nMS Office Proofing Tools 2007 incl. SP1 Hindi\nMS Office Proofing Tools 2007 incl. SP1 Hungarian\nMS Office Proofing Tools 2007 incl. SP1 Italian\nMS Office Proofing Tools 2007 incl. SP1 Japanese\nMS Office Proofing Tools 2007 incl. SP1 Korean\nMS Office Proofing Tools 2007 incl. SP1 Latvian\nMS Office Proofing Tools 2007 incl. SP1 Lithuanian\nMS Office Proofing Tools 2007 incl. SP1 Norwegian\nMS Office Proofing Tools 2007 incl. SP1 Polish\nMS Office Proofing Tools 2007 incl. SP1 Portuguese\nMS Office Proofing Tools 2007 incl. SP1 Romanian\nMS Office Proofing Tools 2007 incl. SP1 Russian\nMS Office Proofing Tools 2007 incl. SP1 Slovak\nMS Office Proofing Tools 2007 incl. SP1 Slovenian\nMS Office Proofing Tools 2007 incl. SP1 Spanish\nMS Office Proofing Tools 2007 incl. SP1 Swedish\nMS Office Proofing Tools 2007 incl. SP1 Thai\nMS Office Proofing Tools 2007 incl. SP1 Turkish\nMS Office Proofing Tools 2007 incl. SP1 Ukrainian\nMS Office Proofing Tools 2007 incl. SP1 Arabic\nMS Office Proofing Tools 2007 incl. SP1 Brazilian\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:7e89a82f906229273a5d852bb483d0316805cec3","amp;dn":"MS+Office+Proofing+Tools+2007+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e89a82f906229273a5d852bb483d0316805cec3","infoHashBuffer":{"type":"Buffer","data":[126,137,168,47,144,98,41,39,58,93,133,43,180,131,208,49,104,5,206,195]},"announce":[],"urlList":[]}}