{"title":"Delta Force 2[ENG][Retail][PC][ISO][Nexcess]","uid":3984888,"size":867843428,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8132bce2e78add409b6dfba4f9ab17de3c868ee1&amp;dn=Delta+Force+2%5BENG%5D%5BRetail%5D%5BPC%5D%5BISO%5D%5BNexcess%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nexykat","files":2,"time":1200760414,"description":"In the original Delta Force, you played as a soldier in the US Army&amp;#039;s elite\ncommando and counterterrorist military force. The game overcame its graphical\nshortcomings by delivering top-notch action in both single- and multiplayer\nmodes. Apparently NovaLogic was willing to bet on the same horse again, as Delta\nForce 2 uses yet another voxel-based graphics engine, but like its predecessor,\nits gameplay is good enough to buoy its less-than-stellar visuals.\n\n\nDelta Force 2 offers around 45 single-player missions, including 25 sorties\nsplit between two campaigns and 20 stand-alone scenarios, in which you must\nprove yourself against large and heavily armed terrorist armies. In most cases,\nyou&amp;#039;ll work alone or with a handful of computer-controlled support teams. Most\nscenarios involve a clandestine attack-and-destroy mission against enemy bases,\nthough many also include hostage rescue, recovery of stolen assets, and other\ncommando-style objectives. The game also contains a powerful mission editor that\nlets you craft complex scenarios with relative ease and even provides thorough\ndocumentation for it.\n\n\nThe mission design in Delta Force 2 is generally excellent. Not only are most\nscenarios more difficult than the missions in the original, but they also seem\nrealistic and believable. Although some are definitely influenced by Hollywood\n(one stand-alone mission conjured memories of the train attack scene in Lawrence\nof Arabia, for example), even these are a lot of fun from beginning to end.\n\n\nGameplay is very similar to the original Delta Force; once again, it emphasizes\nlots of long-range sniping punctuated by the occasional close-quarters ballet of\nfull-auto panic fire. In many missions, you can work your way slowly towards\nthe objective by moving and sniping until only a handful of indoor defenders\nremains. In other missions, time is more of a factor. Direct assaults are almost\nalways a sure recipe for disaster, despite the game&amp;#039;s ludicrously dangerous\ndefault mission waypoints. For this reason, most missions tend to last awhile -\n30 to 45 minutes on the average. Also, you cannot save during a mission, so a\nlucky shot fired by the final bad guy requires you to start over from the\nbeginning. Another potential problem is a glitch that lets some enemies see and\nshoot you through wooden or even stone walls. Fortunately, this bug only reared\nits head on a handful of missions, and always in the same place, but it will\nundoubtedly irk some players.\n\n\nYet another possible problem is the graphics engine. By using the enhanced Voxel\nSpace 32 3D engine, NovaLogic made a design decision that adversely affected\nboth Delta Force 2&amp;#039;s gameplay and its viability on store shelves. Because the\ngame uses grainy voxels instead of crisp polygons, much of the long-range combat\nin the game boils down to hunting for moving pixels. Also, because of the\nexclusively 32-bit graphics engine, Voodoo3 owners are left out in the cold: The\ngame will only take advantage of hardware acceleration (which really only\naffects objects like trees, buildings, and vehicles anyway) on 3D cards based\nupon 32-bit graphics chips.\n\n\nFortunately, Delta Force 2 looks pretty good on a fast system. Even with the\ninherent blockiness of the voxel engine, the settings and characters look fairly\nlifelike. In fact, the gently rolling hills and impressive water effects make\nmany of the maps quite beautiful, especially with 32-bit color enabled. Still,\nthe frame rate was very choppy at 800x600 resolution on a 450-MHz Pentium II\nwith a TNT2 card, though it looked fairly good and ran smoothly at 640x480. It\ntook switching to a GeForce 256 card to make the game playable at 800x600.Unlike its graphics, Delta Force 2&amp;#039;s sound effects deserve special\npraise, since they are some of the most convincing weapons effects you&amp;#039;re likely\nto hear in a computer game. The M249 SAW in particular has to be one of the\ncoolest-sounding weapons ever. Other effects, such as the zing of near misses\nand the bloodcurdling screams of your victims, help to create a highly\nbelievable environment that will keep you on the edge of your seat and tuned to\nthe action at all times.\n\n\nIn addition to the sound, the gameworld itself is immersive and dynamic; enemy\nunits respond in various ways to gunfire - some come running, some drop prone,\nand some seem to ignore the offending noise completely. These varied reactions\nought to keep you on your toes, since you&amp;#039;ll never know in advance. Also,\nbecause many of the missions are chock-full of enemies - dozens in some cases -\nyou are forced to hide in tall grass as often as possible, which is a new\naddition to Delta Force 2. Though the grass looks like little more than big\npixelated blobs on the ground, it does add a welcome element of stealth. It also\nworks for the terrorists in some cases, as bad guys who drop prone in tall\ngrass become nearly invisible.\n\n\nOther new features include airborne insertions for particular missions. This is\nsimply an automated parachute drop at the beginning of some of the scenarios,\nbut it does add a little element of excitement - especially when you find\nyourself dropping right on top of an enemy patrol. Also, the game&amp;#039;s interface\nhas been cleaned up and improved; you now have access to a minimap at all times\nwithout sacrificing room on the screen.\n\n\nHowever, much like in the original Delta Force, your computer-controlled allies\nare virtually useless if you deviate from your preplanned mission waypoints,\nwhich nearly always take you on a suicide run directly through the heart of\nenemy defenses. That&amp;#039;s because they move based on triggered events, most of\nwhich require you to walk over a waypoint. Thankfully, you can modify the\nwaypoints using the new commander&amp;#039;s screen. You can also use this screen to\ncoordinate the movements of your teammates during multiplayer games, which are\none of Delta Force 2&amp;#039;s greatest strengths.\n\n\nOnline sessions on NovaWorld are lively, frenetic firefights that are almost\ncertain to turn the game&amp;#039;s harshest critics into fans. Delta Force 2 is one of\nthe most exciting and enjoyable online gaming experiences out there, despite\nthe fact that some of the promised features haven&amp;#039;t yet been implemented. The\ngame supports as many as 50 players at once and features a wider array of\nweaponry than before and a new armory building that lets you change your weapon\nloadout without logging out. However, the new game modes, including attack and\ndefend, search and destroy, and team flagball, are not yet available on\nNovaWorld. Fixed gun emplacements, which are by far the most intriguing of the\nnew features, are not yet available either. But NovaLogic plans to roll these\nfeatures out over the coming weeks. Performance on NovaWorld is good over 56K\nconnections and even better over a fast pipe like ISDN, cable, or DSL.\n\n\nDelta Force 2 is a great single-player game with an impressive multiplayer\ncomponent. Owners of incompatible video cards should make sure the game is\nplayable and palatable before buying it, but otherwise the game should have a\nwidespread appeal among fans of tactical action games. While it doesn&amp;#039;t deserve\nas high a rating as the first Delta Force since the two are so similar, Delta\nForce 2 can&amp;#039;t be beat for free-ranging commando combat.\n\n\n &lt;a href=&quot;\nhttp://www.gamespot.com/pc/action/deltaforce2/review.html?om_act=convert&amp;om_clk=tabs&amp;tag=tabs;reviews&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gamespot.com/pc/action/deltaforce2/review.html?om_act=convert&amp;om_clk=tabs&amp;tag=tabs;reviews&lt;/a&gt;\nBy Michael E. Ryan, GameSpot\nPosted Nov 9, 1999 12:00 am PT\n\nIf you need a crack(I assume you will) hop over to gamecopyworld and grab one this is a alcohol 120% image of the retail cd.","torrent":{"xt":"urn:btih:8132bce2e78add409b6dfba4f9ab17de3c868ee1","amp;dn":"Delta+Force+2%5BENG%5D%5BRetail%5D%5BPC%5D%5BISO%5D%5BNexcess%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8132bce2e78add409b6dfba4f9ab17de3c868ee1","infoHashBuffer":{"type":"Buffer","data":[129,50,188,226,231,138,221,64,155,109,251,164,249,171,23,222,60,134,142,225]},"announce":[],"urlList":[]}}