{"title":"AruaROSE_772.exe","uid":3760091,"size":709304329,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8142c23175ee85d38d6ed85ca1da0154c1e2541a&amp;dn=AruaROSE_772.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoddessAura","files":1,"time":1186012078,"description":"Gameplay is a free roaming typical level-up based MMORPG. You fight monsters, level up, obtain new skills and equipment to better yourself for upcoming battles. You can travel to different planets and explore new environments as well as battle other players and declare wars against other clans [guilds]. The game features its own in-game economy which is directly controlled by players. Supply and demand can change each day so it is up to you to seize the opportunity. You can obtain one of 4 branches of jobs at level 10, and 2nd Advanced jobs at level 70. the max level currently is 210. At level 210 you do not get experience but you are able to refine [upgrade] your weapons and armor to increase your power for Player vs Player.\n\nIn addition to leveling through the method of acquiring experience points leading to a level after the defeat of a monster, a character may also aid their leveling experience with the use of Quests. Quests are initiated after being spoken to a NPC. Some quests are given a time limit so the character must complete the quest to be eligible for a reward. A reward may be constituted of material items and is usually accompanied with an experience point reward. Rewards from quests are affected by the amount of charm a character has.\n\nThere are three types of items, to which the Inventory is divided: Equipment, items characters may wear on their bodies; Consumable which consists of consumable items that may recover HP, MP or Stamina, or perform an effect (i.e. dance, learn a skill, shoot fireworks, socket items), and Etc which covers general miscellany, such as materials for crafting, gems, and ammunition for weapons that need them.\n   &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Rose_Online&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Rose_Online&lt;/a&gt;\n\nAruaROSE is the fastest growing ROSE Online Private Server with over 1000 new registers a day. AruaROSE has the highest rates (Experience, Zullie and Drops) available on the iROSE system giving them a high advantage and greater prospects for their players.\n\nSite: http://www.AruaROSE.com\nForum: http://forum.AruaROSE.com\nDownload: http://www.AruaROSE.com/downloads.php or this torrent ;)\nDownload-Mirror1: http://patch.aruarose.com/client/AruaROSE_772.exe\nDownload-Mirror2: http://files.filefront.com/AruaROSE+772exe/;8194566;;/fileinfo.html\nDownload-Mirror3: http://arua.remichael.de/download.html\n\nThis is the newest installer (1.8.2007 - 8/1/2007) Version: 772\n","torrent":{"xt":"urn:btih:8142c23175ee85d38d6ed85ca1da0154c1e2541a","amp;dn":"AruaROSE_772.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8142c23175ee85d38d6ed85ca1da0154c1e2541a","infoHashBuffer":{"type":"Buffer","data":[129,66,194,49,117,238,133,211,141,110,216,92,161,218,1,84,193,226,84,26]},"announce":[],"urlList":[]}}