{"title":"Derailed - Movie 01.avi","uid":3991787,"size":777106536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:81451728e76a6d09405b6e2ed827adf833cfd1a0&amp;dn=Derailed+-+Movie+01.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pcconsultant2007","files":1,"time":1201083192,"description":"A clandestine love affair may claim a terrible price from two desperate people in this intelligent thriller. Charles Schine (Clive Owen) is an advertising executive who is happily married to Deana (Melissa George) and has a young daughter. However, that begins to change when Charles meets Lucinda Harris (Jennifer Aniston) on a commuter train. Lucinda, who is also married with a daughter, keep bumping into Charles on the train, and they strike up a friendship that soon grows into something deeper. Eventually Charles and Lucinda fall into infidelity, but the consequences turn out to be greater than they imagined; Philippe Laroche (Vincent Cassel) is a dangerous criminal with a taste for violence who has learned about the affair. Laroche demands a substantial payment if he is to keep the word of Charles and Lucinda&amp;#039;s relationship from their spouses, but they become convinced that Laroche is not to be trusted and that he may mean to do greater harm to their loved ones that simply telling them they&amp;#039;ve been unfaithful. Derailed was the first American project for Swedish filmmaker Mikael Hafstrom.\n","torrent":{"xt":"urn:btih:81451728e76a6d09405b6e2ed827adf833cfd1a0","amp;dn":"Derailed+-+Movie+01.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81451728e76a6d09405b6e2ed827adf833cfd1a0","infoHashBuffer":{"type":"Buffer","data":[129,69,23,40,231,106,109,9,64,91,110,46,216,39,173,248,51,207,209,160]},"announce":[],"urlList":[]}}