{"title":"FlashBoot v1.3.0.124","uid":3370054,"size":3107960,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:81ac6d95002d09ed77a399c083f06f388dbdd6c5&amp;dn=FlashBoot+v1.3.0.124&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"corodam","files":1,"time":1124091718,"description":"FlashBoot is a tool to create bootable USB disks, USB               &amp;Ucirc;&amp;Ucirc; \n &amp;sup2;&amp;sup2;     Flash Memory keys and cards mainly. What are the                    &amp;sup2;&amp;sup2; \n &amp;deg;&amp;deg;     benefits of such devices for you? Let's see: unlike the             &amp;deg;&amp;deg; \n        most bootable medias, bootable USB Flash keys are                      \n        very handy: compared to floppies, they have much                       \n        bigger size, speed and reliability, compared to                        \n        CD-ROMs, they are random write access devices, so                      \n        you can backup your data to the same media where you                   \n        booted from, without need to reformat (reburn) the entire              \n        media. Again, the cost per megabyte for them continues                 \n        to cut down, which is not the case for CD-ROMs and                     \n        floppies.                                                              \n                                                                               \n        And the most important thing is that you can use                       \n        bootable USB Flash Disk almost everywhere, on any                      \n        PC that has USB port. Are you going to repair your PC                  \n        at your work without CD-ROMs, floppies or other                        \n        media? No problems anymore. Or you have a laptop but                   \n        without a CD-ROM drive? Even if with a CD-ROM                          \n        drive, you can't work with it for a long time: boot device             \n        is accessed quite often, and battery power is obviously                \n        not enough to supply laser for a long time. Perhaps you                \n        are home user with a desktop PC. And you are ready to                  \n        repair it with your favorite bootable CD-ROM, OK. But                  \n        what if CD-ROM drive fails? Will you be able to boot or                \n        to get your backup data back?                                          \n                                                                               \n        With bootable USB Flash Memory key, you may boot                       \n        every PC with USB ports, regardless of non-present or                  \n        broken devices, because there's no need for any extra                  \n        devices. You don't have a media size limit of 700 or 800               \n        MB anymore, and buy a big or a small disk depending                    \n        on your needs. Just after boot, on every PC, you may                   \n        save your files to the same device from which you                      \n        booted, or restore them back. There's no need to                       \n        reformat (reburn) the boot disk, you just copy files and               \n        folders, and there's no need for extra hardware for such               \n        operations. Of course you may do some things you can't                 \n        do under your OS: copy/modify system files (they are                   \n        busy when OS is running), reinstall OS, repartition your               \n        main hard disk etc.                                                    \n                                                                               \n        FlashBoot is a tool that makes USB disks bootable. It                  \n        was specially designed to work with USB Flash devices.                 \n        It is used to reformat flash disk (that's optional) and                \n        transfer system files to it. You have many options for                 \n        your choice:                                                           \n                                                                               \n        convert BartPE bootable CD-ROM to bootable USB disk                    \n        transfer DOS kernel only (you may get the files from                   \n        installed Windows 9x, from Windows 9x setup folder, or                 \n        use built-in FreeDOS)                                                  \n        convert floppy disk to USB Flash disk (a diskette or an                \n        image file may be used)                                                \n        convert a bootable CD-ROM to USB Flash disk (again                     \n        images are supported). There are some technical                        \n        difficulties with supporting any type of CD-ROM here,                  \n        see details below. But there should be no troubles with                \n        the most real cases. You may convert Knoppix and                       \n        EBCD, for instance.                                                    \n        create Windows NT/2000/XP password recovery disk                       \n        create disk with NT/2000/XP bootloader. It would be                    \n        useful when you have mistakenly configured it, and                     \n        boot.ini file was left on unreachable disk (NTFS).                     \n        duplicate USB flash disk. Just creates a copy of existing              \n        disk USB flash disk, different sizes of source and                     \n        destination medias are OK.                                             \n        Types of convertible CD-ROMs include so-called                         \n        1.44-floppy emulation bootable CD-ROMs and                             \n        no-emulation CD-ROMs based on ISOLinux.                                \n                                                                               \n        FlashBoot is designed to be compatible with all types of               \n        bootable USB Flash disks, i.e. it is not binded to                     \n        Transend, Kingston, HP, or to any other particular                     \n        manufacturer of USB Flash disks.                                       \n                                                                               \n        FlashBoot is designed to be compatible with most of the                \n        BIOSes. Some of them require USB disk to be                            \n        partitioned (USB-HDD mode), some of them require                       \n        superfloppy format (USB-ZIP mode). You may choose                      \n        disk format type between partitioned disk and                          \n        superfloppy, when formatting your USB Flash disk with                  \n        FlashBoot (if you choose to reformat). You may write                   \n        the output to image file, transfer it to another PC and                \n        write it to physical device there (either with FlashBoot or            \n        with any other suitable tool, for example, with Linux dd               \n        command).                                                              \n                                                             http://www.prime-expert.com/flashboot","torrent":{"xt":"urn:btih:81ac6d95002d09ed77a399c083f06f388dbdd6c5","amp;dn":"FlashBoot+v1.3.0.124","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81ac6d95002d09ed77a399c083f06f388dbdd6c5","infoHashBuffer":{"type":"Buffer","data":[129,172,109,149,0,45,9,237,119,163,153,192,131,240,111,56,141,189,214,197]},"announce":[],"urlList":[]}}