{"title":"Pilot Guides - Arctic Canada [RQ]","uid":3752571,"size":1086671604,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:820daab10cf4b5f82566678234dd26e162027ab4&amp;dn=Pilot+Guides+-+Arctic+Canada+%5BRQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rundaqvisten","files":1,"time":1185387658,"description":"Ian Wright travels as far north as he&amp;#039;s ever likely to get - to Arctic Canada, the Land Of The Midnight Sun.\n\nHe begins his trip in Montreal, the heart of the Quebec and the world&amp;#039;s largest French speaking city after Paris. After sampling gourmet delights in town he heads out to a &amp;#039;sugar shack&amp;#039; where, when the sap rises in March, Canada&amp;#039;s renowned maple syrup is made. He learns all about the process of tapping the sap from the trees and boiling it down, and at the end of the day tastes the fruit of his labours.\n\nFrom Montreal Ian takes a trip to the Madeline Islands. The region used to be a hunting ground for the seal pups which are born on the ice fields each March but these days the only trade the pups are mixed up in is tourism. Ian is accompanied by an expert on seals and it&amp;#039;s an incredible experience.\n\nIan is warned about the wintry weather in Yellowknife, nevertheless he&amp;#039;s intent on journeying to the Northwest territories, known as the Great White North. The capital, on the Great Slave Lake, was built just 50 years ago by pioneers looking for gold. He&amp;#039;s there at the time of the Caribou Carnival, an annual festival originally held to welcome the spring. It&amp;#039;s a whacky event where anything goes, from computer-bashing to ugly dog &amp; truck competitions. In the evening Ian joins a Japanese group heading out of town to see the spectacular aurora borealis, the northern lights. This unbelievable sight which occurs when the earth&amp;#039;s magnetic field generates electric energy by inter-reacting with solar winds.\n\nEven further north is Baffin Island in the territory of Nunavut. It&amp;#039;s the only territory in history that has been peacefully handed over to its native people. In Iqaluit, the capital of the province, he hears the ancient Inuit tradition of throat singing and shares tales of abating frostbite in temperatures that can reach as low as -89Â°F.\n\nIt&amp;#039;s a four day dogsled trek from Iqaluit to Kimmirut across a plateau called Meta Incognita, &amp;#039;the dreaded unknown&amp;#039;. Luckily for Ian he&amp;#039;s accompanied by Denise Martin, the first Canadian woman to reach the North Pole on foot. She teaches him the basic skill of driving dogs but its no easy ride! They reach Kimmirut in one piece and in time for the annual seal-cutting contest. Here seal hunting is still a necessity for the 350 strong community because, as Ian is forced to accept, it&amp;#039;s part of their staple diet.\n\nOn the last leg of Ian&amp;#039;s journey he has to accompany the dogs on a flight back to Iqualit. From there he heads to Broughton Island, or Qikitarjuaq in Inuit. He takes a trip with Palooshi Kanaloosi and his grandson Jason, hoping to see a polar bear, but today the ice is too rough and the group catches a glimpse of bears in the distance.\n\nCrazy though it may seem, Ian is invigorated by the harsh climate of Arctic Canada, enthralled by the vast open spaces and freshness in the air. Nevertheless he&amp;#039;s glad of the shelter of a nice warm igloo at the end of the day.\n","torrent":{"xt":"urn:btih:820daab10cf4b5f82566678234dd26e162027ab4","amp;dn":"Pilot+Guides+-+Arctic+Canada+%5BRQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"820daab10cf4b5f82566678234dd26e162027ab4","infoHashBuffer":{"type":"Buffer","data":[130,13,170,177,12,244,181,248,37,102,103,130,52,221,38,225,98,2,122,180]},"announce":[],"urlList":[]}}