{"title":"Sex crimes and the Vatican  (Panorama)  2006 10 01 Ita sub.  (Di","uid":4002818,"size":289129378,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:827056e8e09bdf4d63f4f0bb792dd687d0e2eb23&amp;dn=Sex+crimes+and+the+Vatican++%28Panorama%29++2006+10+01+Ita+sub.++%28Di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shunster07","files":1,"time":1201654974,"description":"Sex crimes and the Vatican  (Panorama)  2006 10 01 Ita sub.  (DivX)]. \n\nA secret document which sets out a procedure for dealing with child sex abuse scandals within the Catholic Church is examined by Panorama.\n\nCrimen Sollicitationis was enforced for 20 years by Cardinal Joseph Ratzinger before he became the Pope.\n\nIt instructs bishops on how to deal with allegations of child abuse against priests and has been seen by few outsiders.\n\nCritics say the document has been used to evade prosecution for sex crimes.\n\nCrimen Sollicitationis was written in 1962 in Latin and given to Catholic bishops worldwide who are ordered to keep it locked away in the church safe.\n\nIt instructs them how to deal with priests who solicit sex from the confessional. It also deals with &quot;any obscene external act ... with youths of either sex.&quot;\n\nIt imposes an oath of secrecy on the child victim, the priest dealing with the allegation and any witnesses.\n\nBreaking that oath means excommunication from the Catholic Church.\n\nReporting for Panorama, Colm O&amp;#039;Gorman finds seven priests with child abuse allegations made against them living in and around the Vatican City.\n\nOne of the priests, Father Joseph Henn, has been indicted on 13 molestation charges brought by a grand jury in the United States.\n\nDuring filming for Sex Crimes and the Vatican, Colm finds Father Henn is fighting extradition orders from inside the headquarters of this religious order in the Vatican.\n\nThe Vatican has not compelled him to return to America to face the charges against him.\n\nAfter filming, Father Henn lost his fight against extradition but fled the headquarters and is believed to be hiding in Italy while there is an international warrant for his arrest.\n\nColm O&amp;#039;Gorman was raped by a Catholic priest in the diocese of Ferns in County Wexford in Ireland when he was 14 years old.\n\nFather Fortune was charged with 66 counts of sexual, indecent assault and another serious sexual offence relating to eight boys but he committed suicide on the eve of his trial.\n\nColm started an investigation with the BBC in March 2002 which led to the resignation of Dr Brendan Comiskey, the bishop leading the Ferns Diocese.\n\nColm then pushed for a government inquiry which led to the Ferns Report.\n\nIt was published in October 2005 and found: &quot;A culture of secrecy and fear of scandal that led bishops to place the interests of the Catholic Church ahead of the safety of children.&quot;\n\nThe Catholic Church has 50 million children in its worldwide congregation and no universal child protection policy although in the UK there is the Catholic Office for the Protection of Children &amp; Vulnerable Adults.\n\nIn some countries this means that the Crimen Sollicitationis is the only policy followed.\n\nThe Vatican has refused repeated requests from Panorama to respond to any of the cases shown in the film.\n\nItalian subtitles\n\n00:38.58\nDivX MPEG-4 \n\n\nshunster\n","torrent":{"xt":"urn:btih:827056e8e09bdf4d63f4f0bb792dd687d0e2eb23","amp;dn":"Sex+crimes+and+the+Vatican++%28Panorama%29++2006+10+01+Ita+sub.++%28Di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"827056e8e09bdf4d63f4f0bb792dd687d0e2eb23","infoHashBuffer":{"type":"Buffer","data":[130,112,86,232,224,155,223,77,99,244,240,187,121,45,214,135,208,226,235,35]},"announce":[],"urlList":[]}}