{"title":"Good Luck Chuck [2007].AVI","uid":3977932,"size":688628722,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8296d5fbc3c5252080f88c349f0a0db43de5da45&amp;dn=Good+Luck+Chuck+%5B2007%5D.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"benmelendrez","files":1,"time":1200392612,"description":"*** Plot Synopsis by Jason Buchanan \nA serial dater afflicted with a lifelong curse of loneliness attempts to win the love of a clumsy-but-beautiful penguin expert in the one romantic comedy that proves true love never comes easy. As a ten year-old boy, Charlie (Dane Cook) broke the cardinal rule of spin-the-bottle by refusing to kiss a demented Goth girl. Crushed by the disheartening snub and determined to ensure that Charlie never finds true love, the vengeful brooder places a hex on the cowardly rule breaker that follows him well into his adult life. Flash forward twenty years and Charlie is a successful dentist who just can&amp;#039;t seem to maintain a stable relationship. Sure he&amp;#039;s had his fair share of one-night stands, but these days Charlie is just looking to find a nice girl he can settle down with. One day, while attending an ex-girlfriend&amp;#039;s wedding, Charlie realizes that every girl he has ever dated has proceeded to find true love with the very next man they met. When word gets out that Charlie is something of a lucky charm for women looking to tie the knot, every women within a 100 mile radius comes calling for a one night stand; and while taking a bevy of beauties to bed is fun for the time being, it doesn&amp;#039;t take long for Charlie to realize just how empty sex can be without true love. Upon meeting hard-to-get aquatic bird specialist Cam (Jessica Alba), Charlie begins to suspect that he has found the woman of his dreams. Cam is the kind of woman whom Charlie would be happy to grow old with, but what will come of their relationship if Charlie and Cam sleep together? Now, in order to ensure that Cam doesn&amp;#039;t end up with the next guy she meets, Charlie will finally attempt to break the curse that has plagued him since childhood. Perhaps with a little help from smooth talking ladies&amp;#039; man and sympathetic best friend Stu (Dan Fogler), Charlie will finally be able to experience true happiness.\n","torrent":{"xt":"urn:btih:8296d5fbc3c5252080f88c349f0a0db43de5da45","amp;dn":"Good+Luck+Chuck+%5B2007%5D.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8296d5fbc3c5252080f88c349f0a0db43de5da45","infoHashBuffer":{"type":"Buffer","data":[130,150,213,251,195,197,37,32,128,248,140,52,159,10,13,180,61,229,218,69]},"announce":[],"urlList":[]}}