{"title":"Pilot Guides - New Zealand [RQ]","uid":3750699,"size":702507128,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:830af515dccbdf84e697f36bae1fea1cf01c1561&amp;dn=Pilot+Guides+-+New+Zealand+%5BRQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rundaqvisten","files":1,"time":1185224632,"description":"Pilot Guide traveller Ian Wright discovers that New Zealand, far from merely being home to a larger population of sheep than of humans, is a land of wonderful landscapes, ancient Maori culture and the most extreme sports under the sun.\n\nAfter a long flight he arrives in Auckland. Next day he gets to know the city in true kiwi style &amp;#039;rap jumping&amp;#039; down 13 stories of a city skyscraper.\n\nIan has been invited to a Maori community in Rawhiti, so he catches the ferry across to the Bay of Islands. About 15% of the country&amp;#039;s population claim descent from the Marae tribes who first came to New Zealand a thousand years ago from Polynesia. Outsiders can only visit a Marai (the church and hall at the centre of every Maori community) by invitation. On arrival Ian has to undergo the powhirl ceremony to find out if he&amp;#039;s friend or foe.\n   \nCatching a ride back down south Ian arrives in Rotorua, the Sulphur City. Because it&amp;#039;s on a fault line the underground activity bubbles up and comes up here as sulphur springs. It&amp;#039;s a thermal wonderland but it don&amp;#039;t half stink!\n\nBefore leaving town Ian experiences Zorb, another weird kiwi pastime which involves rolling through the countryside in a giant transparent sphere.\n\nThe Kiwi Experience bus is a great way to see the country. It&amp;#039;s cheap and easy and Ian is dropped off in the Akatarawa Valley near Wellington. He&amp;#039;s arranged to work on an emu farm for a couple of days, as part of a scheme called Willing Workers on Organic Farms. For 2 or 3 hours work a day you can get free board and lodging.\n\nThe Cook Strait is named after Captain Cook, and Ian takes the ferry to the South Island, and on to Christchurch by train. There&amp;#039;s an amazing view from the train and Christchurch itself is a twee, leafy city built to a plan by members of Christchurch College, Oxford, 150 years ago.\n\nQueenstown is the extreme sports capital of the world. Overlooked by the Remarkables mountain range on the shores of Lake Wakatipu it&amp;#039;s popular with tourists, many of whom, like Ian, just can&amp;#039;t resist the lure of the bungee jump. Nuttier still is the Fly by Wire, a bizarre contraption literally dreamed up by some inventor, in which Ian swings, high above a valley, suspended on a piece of wire.\n\nIan spends his last night in New Zealand ten thousand feet above sea level in the small, unheated Chancellor Hut, half way up the Fox Glacier. He flies to the glacier by helicopter and meets up with his guide Kathy, whose trained eyes ensure they avoid dangerous holes and crevasses. Ian gets up early the next morning to end his stay in New Zealand with a 4 hour walk in stunning scenery to the top of the Fox Glacier.","torrent":{"xt":"urn:btih:830af515dccbdf84e697f36bae1fea1cf01c1561","amp;dn":"Pilot+Guides+-+New+Zealand+%5BRQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"830af515dccbdf84e697f36bae1fea1cf01c1561","infoHashBuffer":{"type":"Buffer","data":[131,10,245,21,220,203,223,132,230,151,243,107,174,31,234,28,240,28,21,97]},"announce":[],"urlList":[]}}