{"title":"Robert P. Murphy-The Politically Incorrect Guide To Capitalism (","uid":3924063,"size":515851281,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:83cd98731d235b0fa9993c4b8e6eb6717378a038&amp;dn=Robert+P.+Murphy-The+Politically+Incorrect+Guide+To+Capitalism+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"perpetual_traveller","files":1,"time":1196976759,"description":"Ipod audiobook format with chapter separations (m4b).\n\nParticipating in the economy is a part of everyday life, yet much of what is commonly accepted as economic fact is wrong. Keynesian schoolteachers and the liberal media have filled the world with politically correct errors that myth-busting professor Robert Murphy sets straight. Murphy explains hot topics like outsourcing (why it&amp;#039;s good for Americans) and zoning restrictions (why they&amp;#039;re not). Just like the other books in the P.I.G. series, The Politically Incorrect GuideT to Capitalism pulls no punches.\n\nFrom the Inside Flap\nMost commonly accepted economic &quot;facts&quot; are wrong Here&amp;#039;s the unvarnished, politically incorrect truth. The liberal media and propagandists masquerading as educators have filled the world--and deformed public policy--with politically correct errors about capitalism and economics in general. In The Politically Incorrect Guide(tm) to Capitalism, myth-busting professor Robert P. Murphy, a scholar and frequent speaker at the Ludwig von Mises Institute, cuts through all their nonsense, shattering liberal myths and fashionable socialist cliches to set the record straight. Murphy starts with a basic explanation of what capitalism really is, and then dives fearlessly into hot topics like:\n\n* Outsourcing (why it&amp;#039;s good for Americans) and zoning restrictions (why they&amp;#039;re not)\n\n* Why central planning has never worked and never will\n\n* How prices operate in a free market (and why socialist schemes like rent control always backfire)\n\n* How labor unions actually hurt workers more than they help them\n\n* Why increasing the minimum wage is always a bad idea\n\n* Why the free market is the best guard against racism\n\n* How capitalism will save the environment--and why Communist countries were the most polluted on earth\n\n* Raising taxes: why it is never &quot;responsible&quot;\n\n* Why no genuine advocate for the downtrodden could endorse the dehumanizing Welfare State\n\n* The single biggest myth underlying the public&amp;#039;s support for government regulation of business\n\n* Antitrust suits: usually filed by firms that lose in free competition\n\n* How tariffs and other restrictions &quot;protect&quot; privileged workers but make other Americans poorer\n\n* The IMF and World Bank: why they don&amp;#039;t help poor countries\n\n* Plus: Are you a capitalist pig? Take the quiz and find out! Breezy, witty, but always clear, precise, and elegantly reasoned, The Politically Incorrect Guide(tm) to Capitalism is a solid and entertaining guide to free market economics. With his twelve-step plan for understanding the free market, Murphy shows why conservatives should resist attempts to socialize America and fight spiritedly for the free market. \n\nNarrated by Perry Richards. Run time is 5h and 57 mins.","torrent":{"xt":"urn:btih:83cd98731d235b0fa9993c4b8e6eb6717378a038","amp;dn":"Robert+P.+Murphy-The+Politically+Incorrect+Guide+To+Capitalism+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83cd98731d235b0fa9993c4b8e6eb6717378a038","infoHashBuffer":{"type":"Buffer","data":[131,205,152,115,29,35,91,15,169,153,60,75,142,110,182,113,115,120,160,56]},"announce":[],"urlList":[]}}