{"title":"Blaze 2 - Kyle &amp; Jeremy (Gay Porn)","uid":3770067,"size":149969920,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8434d02b138fb02d227873065b37059f8ba4225d&amp;dn=Blaze+2+-+Kyle+%26+Jeremy+%28Gay+Porn%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tpenguin","files":1,"time":1186859906,"description":"In this scene, Dane Brando drives up a house in a fancy new convertible. Entering the house he hears only a disembodied voice telling Dane that he will make him a deal--he will not have to pay for the car if he wears what his mysterious benefactor wants him to wear. ?I don?t like the way this is going,? Dane replies, ?It is all too weird.? He seemed at this point to be voicing my own thoughts.\n\nWhat Dane finds to wear is a pair of black tights and a white t-shirt. In another room, Damon West?who has apparently made a similar deal?appears in white tights and a t-shirt. These white tights do nothing to hide Damon?s exceptional endowment or his religion. (We see now why ballet dancers wear dance belts?and realize that ballet would outdraw all other entertainments if they did not.) Dane and Damon meet in the living room before a bright red sofa and have absolutely scorching sex. Dane has a stiffy that curves upward. Damon has a straight one with a head that turns downward. There is still cross-fading and oblique angles, but they are nicely controlled here and don?t keep us from this sexsational activity. Both guys are super cocksuckers and when Dane sits on Damon?s biggie it slides in with ease. After Damon maneuvers Dane into the missionary position he really throws it to him. Soon he is able to pull it all the way out and reinsert it with no hands. Close-ups show Dane?s gaping hole and give credence to those porn writers who use the term ?boy pussy?. As was done after the first scene, we see photos of Dane and Damon being committed to the flame. It is really worth getting the DVD for this scene alone!","torrent":{"xt":"urn:btih:8434d02b138fb02d227873065b37059f8ba4225d","amp;dn":"Blaze+2+-+Kyle+%26+Jeremy+%28Gay+Porn%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8434d02b138fb02d227873065b37059f8ba4225d","infoHashBuffer":{"type":"Buffer","data":[132,52,208,43,19,143,176,45,34,120,115,6,91,55,5,159,139,164,34,93]},"announce":[],"urlList":[]}}