{"title":"Michele Zarrillo-L'alfabeto Degli Amanti [2006]","uid":4015042,"size":51010509,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:843d06bc82ff3d375ae5b7de86a3116e596f3c61&amp;dn=Michele+Zarrillo-L%5C%27alfabeto+Degli+Amanti+%5B2006%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dirtdevil01","files":12,"time":1202314014,"description":"talian vocalist Michele Zarrillo was born in Rome on June 13, 1957. Though short-lived, his first musical exploits did not go unnoticed. Zarrillo made his recording industry debut at the age of 15 with the art rock band Semiramis, playing keyboards. The band released Dedicato a Frazz in 1972 and was met with great success, along with much scrutiny. After the band split, Zarrillo joined up with symphonic rock group Rovescio della Medaglia for a time. His work with the group offered him opportunities to perform in large and important venues, including the famous Sanremo Festival in 1987. Zarrillo soon began to be noticed for his vocal abilities, and in 1990 an opportunity arose to collaborate with famed producer Alessandro Colombini. Two years later the album Now was released, and Zarrillo took the stage at Sanremo yet again, this time as a solo artist.\n\nZarrillo would continue over the next few years to produce new material, and he was met with a positive response, but it wasn&amp;#039;t until 1998&amp;#039;s Una Rosa Blu that he would become a force on the European pop scene. Selling better than 600,000 copies, the record was soon rewritten and recorded for Spanish audiences, generating the enormous hit &quot;Cinco Dias.&quot; Over the course of the next few years, Zarrillo would enjoy the freedom that comes with international success, including the production of a live record and numerous international touring opportunities, presenting new and original material to enthusiastic audiences. In 2006 Zarrillo released L&amp;#039;Alfabeto Degli Amanti, and presented the material at Sanremo, his tenth invitation to date.\n\t","torrent":{"xt":"urn:btih:843d06bc82ff3d375ae5b7de86a3116e596f3c61","amp;dn":"Michele+Zarrillo-L%5C%27alfabeto+Degli+Amanti+%5B2006%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"843d06bc82ff3d375ae5b7de86a3116e596f3c61","infoHashBuffer":{"type":"Buffer","data":[132,61,6,188,130,255,61,55,90,229,183,222,134,163,17,110,89,111,60,97]},"announce":[],"urlList":[]}}