{"title":"April Barrows ~ My Dream is You","uid":3970006,"size":95745543,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:84cf8597cef7d39b7c3994569da58b9825fde0ed&amp;dn=April+Barrows+%7E+My+Dream+is+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":15,"time":1199950191,"description":"A super sexy jazz-torch singer: check out the AMG bio, plus the 5star reviews\nI&amp;#039;ve included original cover art...but if you like this try to buy the original\nApril is surely worth it. Chet Atkins loved this lady!!!\n\nAMG Biography`by Scott Yanow\nApril Barrows is a bit unusual because, in addition to being an excellent jazz singer, she writes original material that sounds like the songs could be vintage swing standards from decades past. She does not copy her musical heroes in either her singing or her writing although she is quick to acknowledge the inspiration of Ella Fitzgerald, the Boswell Sisters, Mildred Bailey, Louis Armstrong, Ivie Anderson, Bing Crosby, Ruth Etting, Annette Hanshaw, and Cliff Edwards. Barrows first heard music by listening to her mother&amp;#039;s collection of boogie-woogie 78s by such pianists as Meade &quot;Lux&quot; Lewis, Albert Ammons and Pinetop Smith. She sang along with the records, imitating the sounds and learning the formats. She became a record collector herself as a teenager and was always interested in older styles.\n\nBarrows grew up in the San Francisco Bay area where she moved with her family when she was five. In addition to jazz, she listened to Bob Dylan, country music and rock of the &amp;#039;60s. She played violin for a few years and in high school sang and played rhythm guitar. She also performed duets with a country singer, frequently performing roots music, and learned both steel guitar and electric bass. For a time she had a regular day job as a chemist but her main dream was to become a professional musician. \n\nOne day in the late &amp;#039;70s she spontaneously quit her job and headed for Nashville. Her talents were quickly recognized and she played electric bass in a variety of bands for the next six years including working with the Judds&amp;#039; first band, the Memphis Horns, Vassar Clements, and even Woody Herman. In 1985 Barrows switched her focus and became a songwriter. While she had success writing country, bluegrass, and blues songs, her true love was writing and performing her own new swing tunes. While continuing in the commercial field, Barrows has as of this writing recorded two CDs of her own lively swing originals, My Dream Is You and All You Need Is the Girl, and she is working on a third set which features clarinetist Evan Christopher and cornetist Duke Heitger. \n\n\n\nFor her debut album, April Barrows has created a wonderful disc that one would normally associate with an established recording star far along the path of fame and fortune. She possesses a surprising maturity not only in writing and vocalizing, but in song selection as well.\nThere are so many good numbers on here that it is tricky to pick out which are the best. I have several instant favorites, among them the two Moon songs, &quot;Mr. Moon&quot; and &quot;I Wanna Turn Out My Light&quot;. Others that jump out are &quot;An Old Stuffed Sofa&quot;, &quot;Someone Else&amp;#039;s Arms&quot;, &quot;Lost in a Blue Note&quot;, and &quot;Jumping into Spring&quot;. But I think if I were forced to choose only one favorite here, it would have to be the fun little number, &quot;Burning the Toast&quot;.\nAll of the songs (most written by April), have a classic jazz style, calling to mind the best of female jazz vocalists from both the classic period (1930s - early 1950s), and the &quot;new school&quot; period with today&amp;#039;s artists such as Karin Allyson, Rebecca Kilgore, Tierney Sutton, and others. Many of her songs have a wonderful sense of whimsy, and you know that April is giving each offering to us with a wink and a smile. Both &quot;Burning the Toast&quot; and &quot;An Old Stuffed Sofa&quot;, along with the two Moon songs, deliver this whimsical sense in spades.\nThe artists backing April&amp;#039;s songs fit nicely with her style, and both the band and the singer are not afraid to get out of each other&amp;#039;s way when they need to. There&amp;#039;s a good clarinet player, too, which is always nice to hear.\nRefreshing, nostalgic, soulful, dreamy and light are but a few of the words that I can write describing this wonderful album. The collection is marvelously done with April&amp;#039;s beautiful voice and singing style and with the band&amp;#039;s great sound that adds richness and depth to each and every song. Some albums have only have one or two songs that are worth listening to. On this album, every song is a winner, so I would recommend this CD to anyone who enjoys relaxing and easy listening music and wants to feel that they got their money&amp;#039;s worth. I give it five stars! * * * * *\n\nAfter realizing the thrill of Ms. Barrows&amp;#039;s first record &quot;My Dream Is You,&quot; I&amp;#039;ve waited eagerly for more. And this release is just as joyful as her first. I play the two back-to-back when I commute two hours to visit family in Boston, and by the time I&amp;#039;ve arrived, I&amp;#039;m hoarse from singing along, trying to match April&amp;#039;s magical vocals and the rich, expressive instrumentals at once. The lyrics are fresh; the musical conversation brilliant and enormously engaging--Long holiday lines at the Portsmouth tollbooth are now a welcome opportunity to play and sing all over again! Thank you April, Andy Reiss, David Hungate, Chris Brown, Denis Solee, Roy Huskey, and George Tidwell for bringing the world such happiness!\n\nagain thanks for seeding\ncheers GazzJazz\n","torrent":{"xt":"urn:btih:84cf8597cef7d39b7c3994569da58b9825fde0ed","amp;dn":"April+Barrows+%7E+My+Dream+is+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84cf8597cef7d39b7c3994569da58b9825fde0ed","infoHashBuffer":{"type":"Buffer","data":[132,207,133,151,206,247,211,155,124,57,148,86,157,165,139,152,37,253,224,237]},"announce":[],"urlList":[]}}