{"title":"Folder Lock 5.7.5 FULL","uid":3936878,"size":4261466,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:84e8c0edb2ceecd2fb934af2401b1cefe7517697&amp;dn=Folder+Lock+5.7.5+FULL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cach15","files":2,"time":1197858770,"description":"Folder Lock is fast file-security software that can password-protect, lock, hide, and encrypt any number of files, folders, drives, pictures, and documents in seconds. Locked files are undeletable, unrenamable, unmovable, hidden, and inaccessible. You can lock, scramble, or encrypt depending on speed and security.\nFolder Lock is fully portable, so you can protect your files on USB flash drives, disks, CD-RWs, notebooks, and hard disks, and it doesn&amp;#039;t require installation on another PC. Folder Lock protects files in Windows, DOS, and Safe modes, even when you change your OS or boot from a disk.\nFolder Lock doesn&amp;#039;t let you delete its own program folder, and it can&amp;#039;t be uninstalled without the correct password. Additional options include Stealth Mode, Hacker Attempt Monitoring, Shred files, AutoLock, Auto Shutdown PC, Lock your PC, Erase PC tracks, 256-bit Blowfish Encryption and Context Menu in Explorer.\nIt is Windows Vista/2003/XP/2000/NT/Me/98/98S compatible and works on all kinds of disk types like FAT16, FAT32, NTFS. Folder Lock is the most downloaded file-security program in the market today.\nVersion 5.7.5, Released on May 17th, 2007\nNow Folder Lock automatically locks and hides your files and folders kept inside the &amp;#039;Locker&amp;#039; folder in case you forget to lock when shutting down or restarting your computer. You no longer need to remember each time before shutting down your PC to lock any folder. Tooltips added to the browse list so that you can easily see the complete folder paths in &amp;#039;Unlock folders&amp;#039; list when you move your mouse pointer to the list. Many other fixes and enhancements","torrent":{"xt":"urn:btih:84e8c0edb2ceecd2fb934af2401b1cefe7517697","amp;dn":"Folder+Lock+5.7.5+FULL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84e8c0edb2ceecd2fb934af2401b1cefe7517697","infoHashBuffer":{"type":"Buffer","data":[132,232,192,237,178,206,236,210,251,147,74,242,64,27,28,239,231,81,118,151]},"announce":[],"urlList":[]}}