{"title":"The Greatest American Heroine","uid":3779624,"size":225280367,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:857a87b05c7b860c6a6ecf23c9ceddf97a40a736&amp;dn=The+Greatest+American+Heroine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rascelon","files":2,"time":1187654639,"description":"The Greatest American Heroine\n  \n(1986) TV movie pilot unaired\n  \nDirected by: \nTony Mordente\nGenre: \nAction + Family + Comedy\n\nSynopsis: \nThe media and the government are both wise to Ralph having the suit. So, they stage a fake accident that they know our hero will respond to, and they wait with cameras. When he does (and of course saves the staged victim), a crowd emerges to thank Ralph for his years of service. This popularity immediately goes to his head, and he even hires an agent to handle all of the publicity that he is LOVING! This goes over bad with the green guys, and they lock Pam and Ralph in the VW bug and it&amp;#039;s off to Palmdale. \nAfter the aliens &quot;beam&quot; the two up, Ralph is ordered to find someone to give the suit to. He is fired, but has the choice of who will recieve the &quot;unearthly powers&quot;. Unfortunately for Bill, Ralph picks a woman with huge &quot;save the world&quot; issues. Now Bill has to train her on how to use the suit (to the best of the knowledge he and Ralph were able to figure out without the instruction book, because the &quot;green guys&quot; already gave Ralph two of them; and won&amp;#039;t give another!). \nThis girl has her own earth saving scenarios, and drives Maxwell CRAZY. She wants to save the whales first, so it&amp;#039;s off to the docks. She almost gets Bill killed, and ends up challenging a goon to an arm wrestle for information. Obviously, with the suit on underneath her clothes, she tosses the guy through the table.\n\n \n","torrent":{"xt":"urn:btih:857a87b05c7b860c6a6ecf23c9ceddf97a40a736","amp;dn":"The+Greatest+American+Heroine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857a87b05c7b860c6a6ecf23c9ceddf97a40a736","infoHashBuffer":{"type":"Buffer","data":[133,122,135,176,92,123,134,12,106,110,207,35,201,206,221,249,122,64,167,54]},"announce":[],"urlList":[]}}