{"title":"[Kung Fu] Invisible Target (2007) CN - DVD/Rmvb","uid":3762112,"size":567609096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:858dd561880fd65448290a1161595f4cd58007bb&amp;dn=%5BKung+Fu%5D+Invisible+Target+%282007%29+CN+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":7,"time":1186189711,"description":"Invisible Target (2007)\n\nThe Skinny:  \tBenny Chan knows action, though the ability to handle story and character continues to escape him. Invisible Target is overlong and overcooked, and not always convincing. Still, for HK action seekers, it&amp;#039;s thus far 2007&amp;#039;s best bet.\n\nReview by Kozo:\t\tIf ass-kicking is your thing, then Invisible Target is your movie. Directed by Benny Chan, Invisible Target promises energetic action and dangerous-looking stuntwork on a scale not seen since the heyday of Jackie Chan. The film delivers on that promise, though not without a few debits, most especially the use of CG, which erases wires and safety cables, and sometimes replaces people with digital dummies that can easily take a fifteen-story fall without croaking. The other debits are standard Benny Chan problems: canned melodrama, key reveals marred by overdone histrionics, and an inability to make the film&amp;#039;s story and characters equal to the ass-kicking and pyrotechnics. Ultimately, Invisible Target isn&amp;#039;t a very good film, but it delivers enough action and even humor to satisfy the masses. What it doesn&amp;#039;t deliver is an interesting story, truly developed characters, or a conclusion that feels like anything other than obligatory. In other words, Invisible Target is a summer action movie fit for the multiplexes! Just check your brain at the door.\n\nDirector:  \tBenny Chan Muk-Sing  \t \t\n\nProducer: \tBenny Chan Muk-Sing \t\t\n\nAction: \tLi Chung-Chi \t\t\n\nCast: \tNicholas Tse Ting-Fung, Shawn Yu Man-Lok, Jaycee Fong Cho-Ming, Wu Jing, Andy On Chi-Kit, Elanne Kong Yeuk-Lam, Lam Ka-Wah, Mark Cheng Ho-Nam, Sam Lee Chan-Sam, Kenny Wong Tak-Bun, Lam Suet, Ken Lo Wai-Kwong, Philip Ng Won-Lung, Anson Leung Chun-Yat, Samuel Pang King-Chi, Tommy Yuen Man-On, Deep Ng Ho-Hong, Lisa Lu Yan\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:858dd561880fd65448290a1161595f4cd58007bb","amp;dn":"%5BKung+Fu%5D+Invisible+Target+%282007%29+CN+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858dd561880fd65448290a1161595f4cd58007bb","infoHashBuffer":{"type":"Buffer","data":[133,141,213,97,136,15,214,84,72,41,10,17,97,89,95,76,213,128,7,187]},"announce":[],"urlList":[]}}