{"title":"PBS - Prince Among Slaves","uid":4017460,"size":551449666,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:85b053937aa606507a4379fe4a207b8008d5037e&amp;dn=PBS+-+Prince+Among+Slaves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jose3030","files":1,"time":1202448524,"description":"PBS - Prince Among Slaves\n &lt;a href=&quot;\nhttp://www.pbs.org/princeamongslaves/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/princeamongslaves/&lt;/a&gt;\n\nIn 1788 a slave-ship set sail from West Africa, its berth laden with a profitable but fragile cargo: hundreds of men, women and children bound in chains and headed for American shores. Eight months later the survivors were sold in Natchez, Mississippi. Among them was the 26-year-old Abdul Rahman Sori, heir to the throne of one of the largest kingdoms in Africa. \n\nCaptured in an ambush, he was sold to English slavers for a few muskets and some rum. After enduring the brutal Middle Passage to America, packed below decks and in filthy conditions, he was purchased by a struggling Mississippi farmer named Thomas Foster. Foster hoped that the strong African would help establish his farm. \n\nAbdul Rahman promptly escaped, but after several weeks alone in the Mississippi swamps he voluntary returned. Sustained by his deep faith and drawing from his well-honed intellect, Abdul Rahman applied his leadership abilities and knowledge about crops such as cotton to help Foster eventually become one of the wealthiest men in Mississippi. In the meantime, Abdul Rahman married an American-born enslaved woman, and together they had nine children.\n\n\nMarcus Mitchell as Abdul-Rahman, the prince among slaves. \nAbdul Rahman never wavered in his belief that his rightful destiny was freedom. So it seemed a gift of fate when at a crossroads market twenty years into his enslavement he had a chance meeting with an Irish ship?s surgeon whose life had been saved by Abdul Rahman&amp;#039;s father many years before when he was marooned in Africa. This was the one white man in America who owed Abdul Rahman an enormous debt, but the bonds of slavery proved too strong. There were numerous attempts to purchase Abdul Rahman&amp;#039;s freedom, but Foster stayed firm, refusing to sell the man he called Prince at any price. \n\nAfter two more decades and 40 years of enslavement another chance encounter finally led to a breakthrough. A meeting with a local printer who had a friend in the U.S. Embassy in Morocco resulted in an exchange of letters between the Sultan of Morocco and President John Quincy Adams. In a diplomatic exchange, President Adams agreed to do what he could to gain Abdul Rahman free passage to Morocco. The President appealed directly to Foster to let Abdul Rahman go. Reluctantly, Foster agreed, and manumitted him under one condition: that Abdul Rahman was not to enjoy the rights of a free man in the United States ? he was to travel directly to Africa. \n\nDefying the edict that he return immediately to Africa, Abdul Rahman set out on a quest to raise enough money to purchase his family?s freedom. He succeeded early with his wife, but the price for his children and grandchildren seemed nearly out of reach. Nevertheless, he persevered giving lectures and soliciting donations. When he finally met personally with President Adams and corrected the error that he was not Moroccan, Adams declined to pay any money to help free his family. \n\n\nThe brutal Middle Passage carrying Abdul Rahman to be sold as a slave in America. \nSickness and the growing threat that he might be returned to Foster forced Abdul Rahman to leave the U.S. without his children. In Africa he continued to press for their freedom, but died only four months after his return, unable to see his quest realized. Some of his children were ultimately purchased free and returned to Africa, while the others remained enslaved in Mississippi and throughout the South.\n\nTo this day the legacy of Abdul Rahman, the prince among slaves, lives on in his descendants. Seven generations later, one has survived the horrors of civil war in his native Liberia. Now he finds healing and purpose in a quest to uncover the story of his remarkable ancestor and unite the family torn apart nearly 200 years ago. By reestablishing bonds with his American relatives, he finally realizes Abdul Rahman?s dream. ","torrent":{"xt":"urn:btih:85b053937aa606507a4379fe4a207b8008d5037e","amp;dn":"PBS+-+Prince+Among+Slaves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85b053937aa606507a4379fe4a207b8008d5037e","infoHashBuffer":{"type":"Buffer","data":[133,176,83,147,122,166,6,80,122,67,121,254,74,32,123,128,8,213,3,126]},"announce":[],"urlList":[]}}