{"title":"Ghost Ship [2002] DVD-Rip [NOR]","uid":4005863,"size":859917494,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85cbdd6a1c02fd824511486eedd19e9c637c861a&amp;dn=Ghost+Ship+%5B2002%5D+DVD-Rip+%5BNOR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BloodDesciple","files":1,"time":1201820061,"description":"Blood Deciple proudly presents: Ghost Ship\n\nTime: 91min\nGenre: Adventure/Horror/Thriller\n\nAfter discovering a passenger ship missing since 1962 floating adrift on the Bering Sea, salvagers claim the vessel as their own. Once they begin towing the ghost ship towards harbor, a series of bizarre ocurrences happen and the group becomes trapped inside the ship, which they soon learn is inhabited by a demonic creature.\nSalvagers discover the Antonia Graza, an Italian luxury liner with a dark secret. Missing since 1962 and floating adrift, the Antonia Graza is not uninhabited. Before they can begin repairing and towing the ghost ship towards harbor, the crew encounters a series of bizarre ocurrences, and the group becomes trapped inside the ship.\nWhen Canadian Air Force pilot Jack Ferriman recruits the team to investigate a mysterious vessel he has spotted floating adrift off the coast of Alaska in a remote region of the Bering Sea, they discover the remains of the fabled Antonia Graza, thought lost at sea for more than 40 years. It&amp;#039;s a hell of a find # the salvage rights alone could be worth a fortune. And by the law of the sea, any vessel discovered on international waters can be claimed by whomever is fortunate enough to find her and skilled enough to haul her back to port. But once onboard the eerie, cavernous ship, the crew of the Arctic Warrior discovers that the decaying vessel is anything but deserted. It&amp;#039;s home to something more deadly and horrific than anything they&amp;#039;ve encountered in all their years at sea.","torrent":{"xt":"urn:btih:85cbdd6a1c02fd824511486eedd19e9c637c861a","amp;dn":"Ghost+Ship+%5B2002%5D+DVD-Rip+%5BNOR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85cbdd6a1c02fd824511486eedd19e9c637c861a","infoHashBuffer":{"type":"Buffer","data":[133,203,221,106,28,2,253,130,69,17,72,110,237,209,158,156,99,124,134,26]},"announce":[],"urlList":[]}}