{"title":"English Translator 3 *NRG* *1CD* *PL*","uid":3350115,"size":499120284,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8611be39f8f0e2ab88bab7636b5f98833cbadd24&amp;dn=English+Translator+3+%2ANRG%2A+%2A1CD%2A+%2APL%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ralphii","files":1,"time":1120053991,"description":"DESCRIPTION : ENG: http://www.techland.pl/plProd.php?PID=PR061\n              PL:  https://techland.pl/enProd.php?PID=PR016\n\n\n ENGLISH TRANSLATOR 3 is the most technologically advanced program translating contextually between Polish and English. Together with an extensive dictionary built on the basis of English corpus of the University of Pennsylvania it becomes a perfect tool for the automatic* translation of a text.\n\nThe survey showed that using English Translator 3 you need up to 80% less time to understand a text than while using traditional dictionaries.\n\nThe tests of the translation speed revealed that English Translator 3 is a very efficient tool. The translation of 25 pages of a text took only 2 minutes 45 seconds.**\n\nEnglish Translator 3 provides you with:\n\n    * An innovative, technologically advanced engine translating a text into both directions, thoroughly analyzing the syntax of a sentence and using the latest achievements in the fields of comparative grammar and computer linguistics\n    * Optimal choice of dictionary entries based on the English corpus of the University of Pennsylvania\n    * A mechanism of a three-gradual automatic selection of the profile of a translating text\n    * A universal set of thematic profiles with various possibilities of mixing them\n    * A translator's dictionary - offering alternative translations\n    * An intuitive, manual mode of translation offering different possibilities for forming a perfect final text\n    * A speech synthesizer - enabling you to get familiar with the correct pronunciation of sentences in a foreign language\n    * The possibility of working with any text format\n    * An intuitive module of checking spelling\n    * An ergonomic and friendly for a user interface\n    * Extended help that includes also the rules of English grammar in the form of lessons \n\n\n\n* The final text of the automatic translation is a perfect basis for further working over ideal translation, assuring full understanding of a source text at the same time.\n** The test was conducted on the computer equipped with the Athlon processor 1400 and 512MB RAM. One page of the translating text includes 2000 characters.\n\n(DESCRIPTION FROM TECHLAND.COM)","torrent":{"xt":"urn:btih:8611be39f8f0e2ab88bab7636b5f98833cbadd24","amp;dn":"English+Translator+3+%2ANRG%2A+%2A1CD%2A+%2APL%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8611be39f8f0e2ab88bab7636b5f98833cbadd24","infoHashBuffer":{"type":"Buffer","data":[134,17,190,57,248,240,226,171,136,186,183,99,107,95,152,131,60,186,221,36]},"announce":[],"urlList":[]}}