{"title":"Coast to Coast Radio Program! Commercial Free! Nov 16th thru Nov","uid":3907035,"size":386734366,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8629c75f09f2ce3a13cf82fd0a19cb501c1a3038&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Nov+16th+thru+Nov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":35,"time":1195903514,"description":"Yet another seven broadcasts for all the C2C FREAKS out there! I hope you all definitely enjoy and please, please seed. Thank you all in advance! Stokeman Out! Later All!\n\nFriday November 16th, 2007\nMeet the Robinsons\nIn the first hour, George was joined live in the studio by actors Bill Mumy and Angela Cartwright. Known for their roles as Will and Penny Robinson (pictured) on the &amp;#039;60s television show Lost in Space, the two shared some of their experiences working... \nHost: George Noory\nGuest(s): Open Lines, Angela Cartwright, Bill Mumy\n\nSaturday November 17th, 2007\nEvidence for Bigfoot\nScientist, author and expert in human locomotor adaptations Jeffrey Meldrum reported on the work of a team of experts from a wide variety of fields who were assembled to examine the evidence for Bigfoot...\nHost: Ian Punnett\nGuest(s): Dr. Jeffrey Meldrum\n\nSunday November 18th, 2007\nRebroadcast: Matt Savinar from 11/1/07\nSunday&amp;#039;s show was a rebroadcast from 11/1/07, featuring researcher Matt Savinar, who spoke about the peak oil crisis during the first three hours. In the last hour, Jerome Corsi discussed the abiotic oil theory, which suggests that oil is not formed by... \nHost: George Noory\nGuest(s): Matt Savinar, Jerome Corsi\n\nMonday November 19th, 2007\nStar Wars Science\nWriter Jeanne Cavelos discussed how after 30 years, Star Wars still remains an amazing vision for the future, and that a number of George Lucas&amp;#039; concepts are being theorized or demonstrated in science. For instance, &amp;#039;hyperspace&amp;#039; travel-- going from one... \nHost: George Noory\nGuest(s): Jeanne Cavelos, General Parviz Jafari, Dr. Roger Leir\n\nTuesday November 20th, 2007\nGlobal Conspiracy\nAuthor and speaker David Icke returned for a discussion on his new work on the &amp;#039;Global Conspiracy.&amp;#039; This conspiracy goes back thousands of years, he said: At one time there was a global society of great advancement, but after a cataclysm ended their...\nHost: George Noory\nGuest(s): David Icke, Christian Wilde\n\nWednesday November 21st, 2007\nMagic Feats\nJoining George for a live in-studio appearance, during the middle two hours, were &amp;#039;Psychic Madman&amp;#039; Jim Karol and fellow Phenomenon contestants Mike Super (the winner) and Angela Funovitz (runner-up). Karol demonstrated his memory feats, identifying the... \nHost: George Noory\nGuest(s): Jim Karol, Hans King, Angela Funovits, Mike Super\n\nThursday November 22nd, 2007\nJFK Assassination Special V\nIn our 5th JFK Assassination Special a variety of guests presented theories and evidence that generally ran counter to the single gunman theory of the Warren Commission. An exception to that was second hour guest, radio host John Ziegler, who recently... \nHost: George Noory\nGuest(s): Dr. Cyril Wecht, Walt Brown, William E. Kelly, Robert Groden, Dr. Gary Aguilar, John Judge, Robert Kiviat, John Ziegler","torrent":{"xt":"urn:btih:8629c75f09f2ce3a13cf82fd0a19cb501c1a3038","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Nov+16th+thru+Nov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8629c75f09f2ce3a13cf82fd0a19cb501c1a3038","infoHashBuffer":{"type":"Buffer","data":[134,41,199,95,9,242,206,58,19,207,130,253,10,25,203,80,28,26,48,56]},"announce":[],"urlList":[]}}