{"title":"Del Close and John Brent - How To Speak Hip - 1959","uid":3944725,"size":52000026,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:86768e892aa11fba1652b57432a06b22c5c0ef7f&amp;dn=Del+Close+and+John+Brent+-+How+To+Speak+Hip+-+1959&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"st2580smile","files":1,"time":1198389192,"description":"Del Close and John Brent recorded the successful comedy album How to Speak Hip (Mercury 1961). On How to Speak Hip, Brent plays Geets Romo, a hipster who consents to guide the square interviwer, Close, through the basic lexicon of hip. How to Speak Hip came with a &quot;Hip Manual&quot; to use for further self study. \n\nTrack notes for the Beach Boys&amp;#039; Pet Sounds album\n\n6. Let&amp;#039;s Go Away For Awhile \n(Brian Wilson)\nRecorded Jan. 18, 1966 at Western Recorders, Hollywood, CA.\nString and flute overdubs recorded Jan. 19, 1966 at Western Recorders, Hollywood, CA.\nReleased Oct. 10, 1966 as the B-side of Capitol single 5676 (Good Vibrations).\n\nOriginally recorded with the designation Untitled Ballad, this song apparently had several tentative titles before Brian settled on Let&amp;#039;s Go Away For Awhile. A Feb. 23, 1966 Capitol memo lists the song by the title The Old Man And The Baby. And Tony Asher recalled Brian having an acetate disc of the track bearing another title.\n\n&quot;There was an album out called How to Speak Hip ... a lampooning of the language instruction albums,&quot; Asher explained. &quot;I played it for Brian, and it destroyed him, killed him. Brian picked up a couple of references on the album. One of them was this hip character that said if everyone were &amp;#039;laid back and cool, then we&amp;#039;d have world peace.&amp;#039; So Brian started going around saying, &amp;#039;Hey, would somebody get me a candy bar, and then we&amp;#039;ll have world peace.&amp;#039;&quot; Asher said Brian &quot;even made an acetate disc with a label on it with the title. He talked about calling Let&amp;#039;s Go Away For Awhile &amp;#039;And Then We&amp;#039;ll Have World Peace.&amp;#039;&quot;\n\n(to) arc out (verb): To overcome a bothersome obstacle, to clear a barrier with ease. &quot;The math exam was a bear, but I arc&amp;#039;ed out.&quot;\n\nbeard (noun): Cover or disguise, in the form of an object or person. Dean and Ehrlichman were Tricky Dick&amp;#039;s beards at Watergate.\n\nBetty&amp;#039;s world (noun): Referring to any geopolitical event occurring during the reign of Elizabeth 1 (1558-1603). &quot;That Shakespeare was the swingin&amp;#039; prose king in Betty&amp;#039;s world.&quot;\n\n(the) Big Deuce (proper noun): World War II.\n\nbogue (adj.): Bogus, uncool. Strictly fakes-ville.\n\nbourbon (adj.): Lost in space, a general state of fuzzy-mindedness. &quot;I just can&amp;#039;t think straight. It&amp;#039;s straight bourbon.&quot;\n\ncheese (adj.): Top of the line in its class. The 1958 Eldorado is unquestionably &quot;the cheese Caddy.&quot; (From Nagle-Mathews)\n\n(to) cop and blow (verb): To make a purchase and split the scene. &quot;Let&amp;#039;s make it to McDonalds, cop and blow.&quot;\n\n(to) dig (verb): to understand implicitly. Also: to appreciate or like.\n\n(to) do it like Mommy (verb): To come on domestic in a big way. &quot;This morning I cleaned house, vacuumed, ironed. I did it like Mommy.&quot; (From the record of the same name by Simtec &amp; Wylie.)\n\nDoll City (adj): Physically attractive in a standard-issue way. &quot;Those Hemingway chicks with the Brezhnev brows are Doll City. I&amp;#039;ll freeze.&quot;\n\n(to) douse the Edisons (verb): To turn out the lights.\n\ndrug (adj.): (From the past tense of drag). Worn out, tired. &quot;I&amp;#039;m too drug to climb those twenty flights just now,&quot; said Eddie.\n\nin Fat City (descriptive phrase): Rich, well-off financially, satisfied. &quot;Since the inheritance came in, she&amp;#039;s in Fat City.&quot;\n\nfull tour (noun): Same as three-hour tour.\n\ngeepie (noun): (Pronounced with hard &quot;g&quot;). An underage hipster, a funkbopper of either sex. (From Bootsy Collins)\n\ngettin&amp;#039; the mohawk (verb form): Building up irritation to a major level, causing one&amp;#039;s hackles to rise. &quot;There was nothing on at seven except for Family Feud. I was gettin&amp;#039; the mohawk.&quot; (Nagle-Mathews)\n\ngig (noun): Job, vocation, temporary assignment.\n\ngrove (verb): Past tense of groove (itself a corruption of grok--to orb enthusiastically). &quot;The rebirth sequence in 2001 was too much. I grove the colors.&quot;\n\n(to) have eyes for (verb): To want badly. &quot;Eddie Cochran had eyes for that &amp;#039;49 Ford in &amp;#039;Somethin&amp;#039; Else.&quot;&amp;#039;\n\nhip (adj): Aware, having acute perception.\n\nhit me and cut the rap (directive): Hand over whatever you came here to give me, with no backtalk. (From the P-funk)\n\nhung (adj.): Needy. &quot;He&amp;#039;s really hung for bread.&quot;\n\nI&amp;#039;ll freeze, Bill (phrase): A polite turndown. &quot;Thanks for inviting me to that Pia Zadora flick, but I&amp;#039;ll freeze, Bill.&quot; (From The Price Is Right TV game show, per Tom Vickers)\n\njacked up (adj.): Upset, anxious, held in suspension while the sundial ticks. &quot;I got jacked up over my rent. I&amp;#039;m hung for the dough and can&amp;#039;t make it.&quot;\n\n(to) kiss (verb): To skip, pass, shine on. &quot;She told me she&amp;#039;d rather just go to the mountains and kiss the city altogether this weekend.&quot;\n\n(to) Kojak (verb): To find a usually unavailable parking space. &quot;I can&amp;#039;t believe it: a spot right in front of the hotel. I Kojaked!&quot;\n\n(to) Kreskin (verb): To intuit or foresee. &quot;I Kreskined that you&amp;#039;d call before noon.&quot;\n\nlamb-time (noun): Spring.\n\nlean green (noun): Loot, dough, scratch. Money.\n\nLeo-time (noun): August.\n\nluggage (noun): Bags under the eyes.\n\n(to) make the legal move (verb): Get married. Einstein, says Lord Buckley, found his woman, &quot;made the legal move, rang the bells and out of this union were born two swingin&amp;#039; Marsheads.&quot;\n\nMister Ed (noun): 1. An unimpeachable inside source. &quot;Woodward and Bernstein had a Mister Ed.&quot;\n\n2. A reliable sidekick or confidant, as in McMahon.\n\nMotel Hell (adj.): Characteristic of a bad place to stay, as in a souring love affair or dead-end job. &quot;Man, I&amp;#039;m quitting; the gig is Motel Hell.&quot;\n\n(to) Orb (verb): to eyeball or look at. &quot;They orbed the window, then walked into the store and copped.&quot;\n\nto pile up the z&amp;#039;s (verb): To sleep.\n\npuppethead (noun): Square person, esp. one who lets others pull his or her taste strings. (A typical puppethead remark: &quot;Wow, I just paid forty bucks for tickets to see Devo. I&amp;#039;ve never heard them, but they&amp;#039;re supposed to be rilly neat.&quot;) Synonyms (Tim White, 1978): cementhead, chowder-head.\n\nqueeb (noun): A small hassle or unavoidable screw-up, often mechanical. &quot;Sorry I&amp;#039;m late. I had a minor queeb with the starter on my car.&quot;\n\nrooster time (noun): Early morning.\n\nrumor (noun): Something kaput, over with, ancient history. &quot;Man, after Waterloo, Napoleon was a rumor. Finished.&quot;\n\nscramble (noun): According to Nagle-Mathews, the peculiar effect achieved when a balding male combs what hair he&amp;#039;s got left on the sides up onto his top. Hence, any attempt to stretch a thinning resource. Full scrambles: deficit budgets, the careers of Muhammed Ali and the Rolling Stones.\n\n(to) senior out (verb): To tire, become too weak to function. To do it like an oldster. &quot;I couldn&amp;#039;t make the late movie. I seniored out, went to bed at ten.&quot;\n\nShovel City (adj.): Deeply dug, much appreciated. &quot;You enjoying the music?&quot; &quot;It&amp;#039;s too much: Shovel City.&quot;\n\n(to) sit down (verb): To make an impression, to suggest lasting impact. According to Klaflan (1982), a good idea or great music &quot;will definitely sit down, kids.&quot;\n\nSue City (descriptive phrase): Involved in a court action or otherwise engage in legal matters.\n\n(to) swing (verb): To achieve the highest state of well-being. To soar free and clear. Bobby Rydell attended a &quot;Swingin&amp;#039; School.&quot; Bruce and Sinatra graduated.\n\n(to) swing like sixty (verb): To perform at peak, to freak freely or wail radi cally. &quot;That girl&amp;#039;s the cleanest when it comes to threads. The dress she wore last night swung like sixty.&quot;\n\nSwiss (adj.): Neutral. Having no opinion or preference. From Vickers (1980-82): &quot;1 don&amp;#039;t care where we go tonight. Dinner? Flicks? I&amp;#039;m totally Swiss.&quot;\n\n(to) take the bus (verb): To do something in a low-cost, no-frills fashion. &quot;When it comes to shoes, I take the bus--I shop at K-Mart.&quot;\n\n(to) take the scenic route (verb): To perform a task with an eye toward enjoyment rather than efficiency. &quot;Fun will take the longer way around,&quot; sayeth P-Funk. &quot;Clinton takes the scenic route often.&quot;\n\nthree-hour tour (noun): A drag, especially any experience that takes longer than expected. From the Gilligan. &quot;Waiting in line at the bank was a three-hour tour.&quot;\n\nT-zone (adj.): Blissed out, unaware, spaced. &quot;I&amp;#039;ll never go out with him again. He&amp;#039;s strictly T-zone.&quot;\n\nunder house (adj.): (From under house arrest) State of being uncontrollable, out of hand. Wildy frustrated. &quot;Once Batman got hip to his scene, Penguin flipped. He was under house.&quot;\n\nvines (noun): Clothes, threads. \n\nWall Street didn&amp;#039;t jump (descriptive phrase): Indicating an action which fails to draw the anticipated reaction; creating no ripples on the pond. &quot;He told the finance company he&amp;#039;d be inheriting a million bucks in six months. Wall Street didn&amp;#039;t jump.&quot;\n\nin Wig City (descriptive phrase): Caught in the township of the flipped, just outside sanity and peopled by mad daddies and moms.\n\nwrapping (noun): Threads, vines, esp. women&amp;#039;s.\n\nZ-bird (noun): A loser. Last in line, hence the squarest. Prominent Z-birds: the Schmenge Brothers.\n","torrent":{"xt":"urn:btih:86768e892aa11fba1652b57432a06b22c5c0ef7f","amp;dn":"Del+Close+and+John+Brent+-+How+To+Speak+Hip+-+1959","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86768e892aa11fba1652b57432a06b22c5c0ef7f","infoHashBuffer":{"type":"Buffer","data":[134,118,142,137,42,161,31,186,22,82,181,116,50,160,107,34,197,192,239,127]},"announce":[],"urlList":[]}}