{"title":"Life Without Buildings - Live at the Annandale Hotel [2007] MP3 ","uid":4003356,"size":71402230,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87b5fa3c65ac93bc843a7dd4f6702380323db28f&amp;dn=Life+Without+Buildings+-+Live+at+the+Annandale+Hotel+%5B2007%5D+MP3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dkords","files":12,"time":1201689554,"description":"\n\nUpon hearing about Life Without Buildings&amp;#039; posthumous live album (which, given its total lack of press, probably happened just seconds ago), you either said &quot;who?&quot; or fell sideways out of your chair. The Glasgow-based band, which released a handful of singles and the cult-classic LP Any Other City around the turn of the millennium, is legendary among critics, DJs, and post-punk completists, but far from an indie household name. Of course, if you&amp;#039;re someone who collects songs like Pokemons, part of LWB&amp;#039;s appeal lies in that obscurity, as well as in their meager catalog-- they&amp;#039;re the archetypal band who broke up too soon to tarnish their legacy. But mostly, Life Without Buildings are beloved because they were freaking incredible, inhabiting a personality-driven idiom with more charisma and originality than most anyone else.\n\nLWB&amp;#039;s spiky rock instrumentation and talky vocals place them in a lineage that begins with classic Rough Trade post-punk bands such as the Fall (aptly, Rough Trade affiliate Tugboat originally released Any Other City in 2001) and continues today with bands like Love Is All, Kiss Me Deadly, and Art Brut. As such, the band&amp;#039;s one-of-a-kind aura isn&amp;#039;t the product of inventing a new style. It stems largely from the vocal prowess and boundless personal magnetism of singer Sue Tompkins. Tompkins emerged suddenly from the visual art world-- LWB formed while studying at the Glasgow School of Art-- and vanished just as suddenly back into it (she warned us on &quot;Love Trinity&quot;: &quot;I&amp;#039;m not willing to leave the visual world&quot;). But in reality, she never left it-- her singing is painterly, mirroring the typographical emphasis of her collage-based visual art.\n\nTompkins&amp;#039; style seems descended from the look, if not the political content, of Filippo Tommaso Marinetti&amp;#039;s seminal Futurist text Zang Tumb Tumb, with its onomatopoeias, contrasting font sizes, anarchic typography, and jumbled cases. She translates this page-bound aesthetic into seductively coded lyrics where meaning is sometimes ambiguous, but feeling never is, and internal logic is always apparent. Tompkins stretches words like taffy or bites them off like fingernails (often in tight contrast: &quot;Liberty Feeeeeeeeel-up!&quot;), shuffles letters and syllables like a card sharp (as on &quot;The Leanover&quot;: &quot;b-b-b-b-baby, g g g, so g g g, you you,&quot; later repeating &quot;MBV&quot; in a rollercoaster cadence that probably refers to everyone&amp;#039;s favorite shoegazers), breathes into the beats, abruptly shouts out numbers, jukes, hiccups and chirps. She circles her limber tongue-twisters, feints, and attacks from unexpected angles, dicing and rearranging them with the superhuman brio of an anime ninja and a telegraphic sense of lexical rhythm.\n\nAttributing LWB&amp;#039;s appeal solely to Tompkins does a disservice to the rest of the band, particularly to guitarist Robert Johnson, whose style is just as strikingly colorful: Cool green and ice blue, spangled with quicksilver curlicues, the elegant lattices of his fretwork are never taken for granted by Tompkins&amp;#039; verbal espaliers. But Life Without Buildings were always a band who overshadowed themselves. Just as Tompkins&amp;#039; sui generis vocals made it easy to take their musical surroundings for granted, one song, &quot;The Leanover&quot;, seemed so miraculous as to make the rest of their consistently fantastic music pale by comparison. As Johnson&amp;#039;s guitar spews clouds of billowing glitter, Tompkins, with a tonal mixture of wonder, belligerence, sentimentality, and petulance, achieves the single most inspired rendition of her inimitable style. Dense with fractured refrains, seamless glides between melodious notes and spoken syllables, supple nursery rhyme cadences, peremptory vernacular, and mutating imagery (&quot;Kiss me, break my mind, close the door/ Black steel, break my mind, close the door/ Black steel, the sight of you, falling out&quot;), it sounded at once spontaneous and intricately composed, flirting with poetic structures (the aforementioned example resembles a corrupted pantoum). The melting elegy &quot;Sorrow&quot; shows that Tompkins could stunningly adapt this style for more pensive effects, but the wide-eyed effervescence of &quot;The Leanover&quot; remains the band&amp;#039;s signature sound.\n\nWhat&amp;#039;s truly remarkable is that &quot;The Leanover&quot;, as well as all the other LWB songs, appear fully intact on Live at the Annandale Hotel, with every vocal strobe and chirrup, if not carbon-copied, faithful to the complex spirit of the studio version. Recorded at the venerable Sydney venue in December 2002, near the end of LWB&amp;#039;s career, the album finds the band experienced enough to recreate their music with confidence, yet green enough to be ecstatic about doing so. The driving &quot;PS Exclusive&quot; cycles through its asymmetrical refrains (&quot;the right stuff,&quot; &quot;the red villa,&quot; &quot;tonio, tonio&quot;) without faltering; the fluidly hitching &quot;Juno&quot; keeps its dizzy flocks of pronouns in order; the plangent anthem &quot;New Town&quot; enlivens its chant of &quot;I forgot&quot; with studio-caliber tonal nuance. Unreleased track &quot;Liberty Feelup&quot;, one of the last LWB wrote before disbanding, features an inspired performance by Johnson: a bright and rolling jangle that remains melodious even when corkscrewing into dissonance or bottoming out into feedback glides.\n\nTompkins&amp;#039; is breathlessly giddy for the duration. Glib but earnest, she&amp;#039;s hard-pressed to make it through a sentence without breaking down into giggles. Even more than the excellent musicianship, her enthusiasm and genuine quirkiness carry the set. Typical banter goes something like this: &quot;That was a funny ending. [Laughs nervously] Well that was our first song. [Sort of wheezes] Whoo! I&amp;#039;m sorry, I shouldn&amp;#039;t say that.&quot; While Tompkins is charming and clearly having a blast, it&amp;#039;s possible to read a burgeoning dissatisfaction with the predetermination of band life in her ongoing meta-narration. &quot;If I look over, it&amp;#039;s because of the set list thing,&quot; she tells someone in the audience after &quot;Let&amp;#039;s Get Out&quot;. And later: &quot;We&amp;#039;re here tomorrow, so we&amp;#039;re gonna do the same songs in a different order,&quot; adding, &quot;that&amp;#039;s cheeky.&quot;\n\nIt&amp;#039;s as if the platitudes of touring (&quot;[insert town name] is our favorite place to play!&quot;) are too much artifice for the ingenuous singer to muster-- &quot;We haven&amp;#039;t seen anything of Sydney yet, so we can&amp;#039;t even say what we think of it,&quot; she says, acknowledging the tacit contract she&amp;#039;s too honest to honor-- compelling her back to the more remote artistic sphere of visual representation. We, the fans, are left with one irreplaceable album, one equally amazing live document, and the lingering hope that, in this day of unexpected reunions, we might yet get to see Life Without Buildings for ourselves. C&amp;#039;mon guys, if Slint and Dinosaur Jr can do it...\n\n-Brian Howe, August 15, 2007\n","torrent":{"xt":"urn:btih:87b5fa3c65ac93bc843a7dd4f6702380323db28f","amp;dn":"Life+Without+Buildings+-+Live+at+the+Annandale+Hotel+%5B2007%5D+MP3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87b5fa3c65ac93bc843a7dd4f6702380323db28f","infoHashBuffer":{"type":"Buffer","data":[135,181,250,60,101,172,147,188,132,58,125,212,246,112,35,128,50,61,178,143]},"announce":[],"urlList":[]}}