{"title":"The Pax Romana - Force Majeure","uid":3874469,"size":33377046,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8861b8c8e0170eb39a5a0715a4f2dd15b82e0ef2&amp;dn=The+Pax+Romana+-+Force+Majeure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SacredSilenceCalms","files":7,"time":1194300941,"description":"This is The Pax Romana&amp;#039;s cd Force Majeure.\n\n\nFor more info on them, this is off their myspace:\nThe Pax Romana is from all parts of the East Coast of the United States of America. They ended up in a small town in the armpit of said country, but now have high-tailed it big time to the Windy City. Jay hails from a small town called Deltona that everyone passes by hungover on their way out of Daytona Beach. Mike used to live with retired New Yorkers in Ft. Lauderdale that whine and complain. \n\nOne hundred percent of The Pax Romana contribute to the work force.\n\nThe Pax Romana like playing heavy melodies over classic rock riffs that made people like Eric Clapton famous for songs about cocaine and interior decorating. They made an album and are still looking to find a place to have it pressed, hopefully a Detroit Steel Mill. Nobody sounds like us, but we like to lie all the time too.\n\nThe Pax Romana is huge in Belgium.\n\nIn 2005, The Pax Romana laid their seeds in several major cities including Orlando, Jacksonville, Ft. Lauderdale/Miami, St. Augustine, Panama City and Gainesville in 2004 and 2005. Now it&amp;#039;s time to up the ante and lay more seeds within the Midwest and the galaxies beyond.\n\nIn 2006, The Pax Romana followed up their EP and wrote their work on digital media with the album, &quot;Force Majeure&quot; available at their shows and through the web. There are still plenty of copies available. In May, they played the 5th Annual Florida Music Festival with Crease at Cafe Annie&amp;#039;s. The band has been dormant since then, until now.\n\nIt all started in 2004 and will continue in 2008. This time, in Chicago.\n\n\n\nFor more info visit their myspace!\n\n\nEnjoy guys!","torrent":{"xt":"urn:btih:8861b8c8e0170eb39a5a0715a4f2dd15b82e0ef2","amp;dn":"The+Pax+Romana+-+Force+Majeure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8861b8c8e0170eb39a5a0715a4f2dd15b82e0ef2","infoHashBuffer":{"type":"Buffer","data":[136,97,184,200,224,23,14,179,154,90,7,21,164,242,221,21,184,46,14,242]},"announce":[],"urlList":[]}}