{"title":"T H E Do0rs V Runescape PK Video","uid":4002653,"size":232054863,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:887316c9b182533bb324175f30fae1dd0c62d7f8&amp;dn=T+H+E+Do0rs+V+Runescape+PK+Video&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Doodlepieguy","files":1,"time":1201648501,"description":"PKer: T H E Do0rs\nPK Category: Maxed Runepure\nLocation: Edgebased\nVideo: V\nReleased: Mid \\&amp;#039;07 (Not sure)\nEditor: Apple Jacks\nLength: 26:09\n\nSummary: T H E Do0rs returns in his final video. It starts off with perhaps the strongest opening four minutes ever put to video -- you just have to watch it for yourself. It\\&amp;#039;s a collection so impressive and stunning that unfortunately the rest of the 22 minutes of the video just can\\&amp;#039;t keep up with the set pace.\n\nWith this said, this was an unexpected release from T H E Do0rs, who was rumored to have quit solo pking after his monumental 4th video. This video would be the weakest of the his final three as a complete work, but would have some of the strongest elements. The key reason this video doesn\\&amp;#039;t stack up is because Do0rs videos had always taken advantage of new updates -- defender/barrows gloves for III, allowing some of the first ever two hits -- vengeance in IV, allowing for unprecedented combos.. but the update this time would be a path that Do0rs could not follow while remaining Rune Pure. That update was Piety, which severely stacked the odds against the maxed strength rune pure. It barred runepures from the spell, and crippled them by allowing non-pures their level to essentially be able to hit the same hits with strength in the high 80s instead of high 90s. There was also the added element of higher defense for these players. The maxed rune pure category, the category which the Do0rs essentially defined with his progressive videos, was now essentially an obsolete class. The update made the only effective rune pure a rune pure without attack -- and thus a severely lower combat level, which allowed them to fight opponents without piety. Check out Elvian\\&amp;#039;s 5th if you are interested in the last great runepure video. The Do0rs fifth is the last great video for a runepure with over 80 attack because despite the obstacle of piety, Do0rs managed to finish this video.\n\n--\n\nSeeded by Doodlepieguy. Doodle can be contacted on the forums of Runevillage.com, under the user name \\&amp;#039;Doodle\\&amp;#039;.\t\t","torrent":{"xt":"urn:btih:887316c9b182533bb324175f30fae1dd0c62d7f8","amp;dn":"T+H+E+Do0rs+V+Runescape+PK+Video","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"887316c9b182533bb324175f30fae1dd0c62d7f8","infoHashBuffer":{"type":"Buffer","data":[136,115,22,201,177,130,83,59,179,36,23,95,48,250,225,221,12,98,215,248]},"announce":[],"urlList":[]}}