{"title":"Panorado 33 + key","uid":3870986,"size":2105922,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:88e1133004c504b2c6682bbe666ee48af33996ac&amp;dn=Panorado+33+%2B+key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brandit1949","files":5,"time":1194096084,"description":"Panorado 3.3\nPublisher&amp;#039;s Description:\nPanorado - The Panorado 3.3 image viewer/browser offers a comfortable, innovative mouse-oriented interface for panning and zooming. This makes it particularly suitable for viewing panoramic pictures and pictures exceeding the screen size. As a Windows application, it supports 360-degree viewing in flat and spherical projection mode, an Explorer-style navigation bar, thumbnail viewing, full screen mode, slide shows, printing, an image finder tool, and tools for creating special projection effects and burning picture disks. Full Drag-and-Drop support for file management. File formats: JPEG, GIF, BMP, WMF, EMF, ICO, CUR, TGA, PCX, PNG, TIFF, JPEG 2000, PNM, RAS - plus Quicktime panoramas (cylindrical or cubic, with JPEG or CVID compression). Panorado makes extensive use of camera data and text information (in EXIF &amp; IPTC format) for viewing, editing, and retrieving images. Access to the Google Earth client software by GPS coordinates. No HTML, Java, or Quicktime required. * See your panoramic pictures immediately. No HTML framework required - just ordinary image files (like JPEG)! * Move back and forth, up and down, turn around and look at details! * Get your digital photos organized! * Click a button and let Google Earth fly you to the image location! * Create a picture CD/DVD with a self-running slide show!\nLatest Changes:\nPanorado 3.3 makes extensive use of camera data and textual information (in EXIF and IPTC format) for viewing, finding and editing photo and for batch operations. --- Fast Thumbnails - Image Finder - Image Properties - GPS Support - Google Earth Access ---\n\n\npanorado.karl-maloszek-simple-software.qarchive.org\nlink &lt;a href=&quot;\nhttp://fyad.org/qh6v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fyad.org/qh6v&lt;/a&gt;\n","torrent":{"xt":"urn:btih:88e1133004c504b2c6682bbe666ee48af33996ac","amp;dn":"Panorado+33+%2B+key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88e1133004c504b2c6682bbe666ee48af33996ac","infoHashBuffer":{"type":"Buffer","data":[136,225,19,48,4,197,4,178,198,104,43,190,102,110,228,138,243,57,150,172]},"announce":[],"urlList":[]}}