{"title":"AS 7 PROFECIAS MAYAS-LAS 7 PROFECIAS MAYAS-DUBLADO","uid":4016926,"size":4614373776,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:88fc4f596b5b2ee2078c196efca650cc67d29416&amp;dn=AS+7+PROFECIAS+MAYAS-LAS+7+PROFECIAS+MAYAS-DUBLADO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fjtheo","files":10,"time":1202419458,"description":"AS 7 PROFECIAS MAYAS : LAS 7 PROFECIAS MAYAS\nEM 7 CAPITULOS : DIVX\nAUDIO: PORTUGUES BR\nLANCAMENTO: 1999  &lt;a href=&quot;\nhttp://www.fernandomalkun.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fernandomalkun.com/&lt;/a&gt;\n\nOs Maias deixaram para nos, os habitantes do planeta terra de hoje, uma mensagem escrita em pedra que contem 7 profecias. Uma parte de alerta e outra de esperanca.\nA mensagem de alerta profetiza o que vai acontecer nesses tempos em que vivemos. A de esperanca fala sobre as mudancas que devemos efetuar para impulsionarmos a humanidade para uma nova era, a era da mulher, a era das maes, da sensibilidade.\nTodos nos de uma maneira ou de outra sentimos que estamos comecando a viver os tempos do apocalipse. Todos sentimos a guerra, guerra pelo petroleo, guerra pela paz.\nA cada dia ha mais erupcoes vulcanicas, a poluicao gerada por nossa tecnologia chegou a indices alarmantes, estamos enfraquecendo a camada de ozonio que nos protege das radiacoes do sol. Estamos contaminando o planeta com nossos dejetos industriais e nosso lixo. A devastacao dos recursos naturais esta acabando com nossas fontes de agua e com o oxigenio que respiramos.\nO clima mudou e as temperaturas aumentaram de maneira impressionante, geleiras e campos nevados estao derretendo, grandes inundacoes se sucedem em todo o mundo, enormes tornados puseram em perigo a Florida e gigantescos furacoes devastaram toda a America central.\nO caos informatico nos ameaca, a pobreza generalizada pelos efeitos do caos economico e sentido por quase todos os paises do mudo. Todos nos procuramos respostas e um caminho seguro para os tempos em que vivemos. E reconhecemos apartir dos problemas que enfrentamos diariamente que nao vivemos em harmonia.\nMuitas religioes elaboraram profecias a respeito do que esta acontecendo. A biblia anunciou que quando todos esses fatos acontecessem ao mesmo tempo estariam chegando os tempos do apocalipice.\nOs Maias sabiam que isso ia acontecer exatamente nesses tempos, por isso, deixaram orientacoes para que nos, de maneira individuais, contribuamos para levar a humanidade para o amanhecer da galaxia, para uma nova era, onde nao havera mais caos nem destruicao.\nEles nos deixaram 7 profecias em que falam de sua visoes do futuro e do nosso presente. Estao baseadas nas conclusoes de seus estudos cientificos e religiosos sobre o funcionamento do universo.\n\nFernando Malkun\n1970 Bachiller, Colegio San Jose Barranquilla, Colombia \n1976 Arquitecto, Universidad de Los Andes, Bogota, Colombia \n2003 Discipulo, Universidad del Amor, Gerardo Schmedling, Bogota, Colombia\n\n","torrent":{"xt":"urn:btih:88fc4f596b5b2ee2078c196efca650cc67d29416","amp;dn":"AS+7+PROFECIAS+MAYAS-LAS+7+PROFECIAS+MAYAS-DUBLADO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88fc4f596b5b2ee2078c196efca650cc67d29416","infoHashBuffer":{"type":"Buffer","data":[136,252,79,89,107,91,46,226,7,140,25,110,252,166,80,204,103,210,148,22]},"announce":[],"urlList":[]}}