{"title":"Clive Cussler - Treasure of Khan","uid":3923405,"size":880356630,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:896e19c30cc7857ccc52b5028c82ff7e87bd6c79&amp;dn=Clive+Cussler+-+Treasure+of+Khan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Greger_stormare","files":170,"time":1196902113,"description":"Clive Cussler - Treasure of Khan\n\n\n\nGenghis Khan-the greatest conqueror of all time, who, at his peak, ruled an empire that stretched from the Pacific Ocean to the Caspian Sea. His conquests are the stuff of legend, his tomb a forgotten mystery. Until now.\n\nWhen Dirk Pitt is nearly killed rescuing an oil survey team from a freak wave on Russia&amp;#039;s Lake Baikal, it appears a simple act of nature. When the survey team is abducted and Pitt&amp;#039;s research vessel nearly sunk, however, it&amp;#039;s obvious there&amp;#039;s something more sinister involved. All trails lead to Mongolia, and a mysterious mogul who is conducting covert deals for supplying oil to the Chinese while wreaking havoc on global oil markets utilizing a secret technology. The Mongolian harbors a dream of restoring the conquests of his ancestors, and holds a dark secret about Genghis Khan that just might give him the wealth and power to make that dream come true.\n\nFrom the frigid lakes of Siberia to the hot sands of the Gobi Desert, Dirk Pitt and Al Giordino find intrigue, adventure, and peril while collecting clues to the mysterious treasure of Xanadu. But first, they must keep the tycoon from murder-and the unleashing of a natural disaster of calamitous proportions. Filled with breathtaking suspense and brilliant imagination, his new novel is yet further proof that when it comes to adventure writing, nobody beats Clive Cussler.","torrent":{"xt":"urn:btih:896e19c30cc7857ccc52b5028c82ff7e87bd6c79","amp;dn":"Clive+Cussler+-+Treasure+of+Khan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"896e19c30cc7857ccc52b5028c82ff7e87bd6c79","infoHashBuffer":{"type":"Buffer","data":[137,110,25,195,12,199,133,124,204,82,181,2,140,130,255,126,135,189,108,121]},"announce":[],"urlList":[]}}