{"title":"The_Pogues-Pogue_Mahone-Remastered-2004-JAFFA","uid":3357657,"size":73604556,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:89c936a09cf90f5615d27e4f9a1dc3e8e5aa71e5&amp;dn=The_Pogues-Pogue_Mahone-Remastered-2004-JAFFA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fnatte1","files":18,"time":1121683341,"description":"(&quot;''/&quot;).__..--''&quot; -._\n    `o_ o )  `-.  (     ).`-.__.`)\n    (_Y_.)' ._   )  `._ `. ``-..-'\n  _..`--'_.-_/  /--'_.' .'\n (il).-''  ((i).'  ((!.-'\n          JAFFA\n\n\nArtist: The Pogues\nAlbum: Pogue Mahone - Remastered &amp; Expanded\nLabel: Wm Uk\nGenre: Folk-Rock\nGrabber: EAC\nEncoder: LAME V3.96.1\nBitrate: VBR\nMode: Joint Stereo\nTracks: 15\nTime: 50:38\nSize: 73.6 MB\nRip Date: Dec-29-2004\nStreet Date: Dec-13-2004\n\n\nTrack List:\n\n01. How Come                                                     [2:50]\n02. Living In A World Without Her                                [3:20]\n03. When The Ship Comes In                                       [3:14]\n04. Anniversary                                                  [4:06]\n05. Amadie                                                       [1:53]\n06. Love You 'Till The End                                       [4:32]\n07. Bright Lights                                                [2:37]\n08. Oretown                                                      [3:50]\n09. Pont Mirabeau                                                [3:31]\n10. Tosspint                                                     [3:32]\n11. 4 O'clock In The Morning                                     [3:12]\n12. Where That Love's Been Gone                                  [3:50]\n13. Sun &amp; The Moon                                               [3:22]\n14. Eyes Of An Angel (Bonus Track)                               [2:54]\n15. Love You Till The End (Stephen Hague Mix) (Bonus Track)      [3:54]\n\n\nJaffa notes:\n\nWith the original Pogues lineup recently reunited, their entire back catalogue of studio albums has been digitally\nremastered and reissued - with extra bonus tracks included on each album. JAFFA is quite pleased to be able to\nbring you everything (of note) that this great band put down on record. Pogue Mahone was originally issued in 1996.\n\n\n&quot;Pogue Mahone (Gaelic for &quot;kiss my arse&quot;) is the seventh and final studio album from lauded progressive Irish folk\npioneers the Pogues. After the departure of Shane MacGowan, co-founder Spider Stacy found himself at the helm, singing\nand sharing songwriting duties with the rest of the group. If their post-MacGowan debut, Waiting for Herb, was a\nrespectable attempt at recapturing the shape-shifting, genre-splitting days of classic tracks like &quot;Fiesta,&quot; &quot;Lorelei,&quot;\nand &quot;Night Train to Lorca,&quot; Pogue Mahone is a celebration of the band's inception. Panned by critics and fans who\nrefused to take a &quot;Shane-less&quot; Pogues seriously, both records are a testament to the band's enormous vault of talent.\nStacy, who spent most of his career in MacGowan's shadow, rose to the occasion on Herb, offering up what must have been\nyears of oppressed material, most of it remarkable. This time around it's the rest of the group that gets a shot at\nemptying their catalogs. In fact, Mahone is actually multi-instrumentalist Jem Finer and drummer Andrew Ranken's baby.\nFor the most part they succeed in re-installing the traditional spark that made the group so electrifying in the '80s.\nPub rockers like Finer's &quot;Bright Lights&quot; and Ranken's French rave-up &quot;Amadie,&quot; while suffering from murky production,\nare rousing, raucous, and delightful, making one wonder what the public's reaction would have been had Pogue Mahone been\na debut from a band nobody had ever heard of.&quot;  (AMG)\n\nhttp://www.pogues.com\n\n\n---\n\n\nGroup News: JAFFA is looking for: A few good men. Or women. You can probably guess what for.. You have\nto be a totally hard-core bad-ass individual who's on irc 24/7, but at the same time we don't want uber-\nserious, super-boring ones, nor opportunists, nor those who speak lies. Nor robinson-jerry. Also, you\nhave to be 18 years old minimum, and like Music a lot, and be familiar with, or at least have heard of,\nbands/artists such as Ramones, Dropkick Murphys, or Flogging Molly. That's it. If you think you fit the bill,\nall that's left to do is to somehow get in touch with the JAFFA Supreme Overmind. Someone you know may know\nsomeone else who has in turn once spoken to someone that..etc, etc, etc. \n","torrent":{"xt":"urn:btih:89c936a09cf90f5615d27e4f9a1dc3e8e5aa71e5","amp;dn":"The_Pogues-Pogue_Mahone-Remastered-2004-JAFFA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89c936a09cf90f5615d27e4f9a1dc3e8e5aa71e5","infoHashBuffer":{"type":"Buffer","data":[137,201,54,160,156,249,15,86,21,210,126,79,154,29,195,232,229,170,113,229]},"announce":[],"urlList":[]}}