{"title":"Folsom Street: The Documentary","uid":3937726,"size":1395363620,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:89d5c52b43efba407c35b16b2b287f64df922bb0&amp;dn=Folsom+Street%3A+The+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"bufffo","files":1,"time":1197932097,"description":"FOLSOM STREET: THE DOCUMENTARY reveals an amazing cultural phenomenon. The event known world wide takes place the last Sunday in September each year. Beginning in 1984 as a mostly gay leather/SM/fetish event representing the diverse elements of the area known as SoMa (San Francisco&amp;#039;s South of Market district) it has grown to be the largest event of it&amp;#039;s kind in the world and the third largest one day spectator event in the State of California. Each year all the proceeds are given to local charities and in turn it has transformed into a massive happening not only for the San Francisco Gay community but goths, house music fans, the BDSM community or anyone that simply wants to &quot;take a walk on the wild side.&quot; Where anything goes... \n\nIn his film making debut, Photo Tim (known for his edgy fetish/fashion photography) takes you to the action for a illuminating look at the goings on. Hosted by local celebrity performance artist Trixxie Carr, interviews with vendors, the promoters, and people attending the event transports you to FOLSOM STREET. The film captures the excitement, eroticism and spectacle of this truly unique once a year bash. With a background of music provided by Creamer &amp; K, Fatboy Slim and Dum Like You, the FOLSOM STREET: THE DOCUMENTARY brings you the sights and sounds of this fascinating street party. After watching the FOLSOM STREET DOCUMENTARY, and because of it&amp;#039;s authentic representation, you understand why this event becomes a vital part of those who attend. \n\n &lt;a href=&quot;\nhttp://myspace.com/folsomstreet&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://myspace.com/folsomstreet&lt;/a&gt;","torrent":{"xt":"urn:btih:89d5c52b43efba407c35b16b2b287f64df922bb0","amp;dn":"Folsom+Street%3A+The+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d5c52b43efba407c35b16b2b287f64df922bb0","infoHashBuffer":{"type":"Buffer","data":[137,213,197,43,67,239,186,64,124,53,177,107,43,40,127,100,223,146,43,176]},"announce":[],"urlList":[]}}