{"title":"Unstoppable Global Warming-Singer:Avery (2007) ","uid":4001261,"size":80517270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8aad205c82d88c365d8f535e1eabb8b2fb20835e&amp;dn=Unstoppable+Global+Warming-Singer%3AAvery+%282007%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xofokim","files":140,"time":1201574366,"description":"Double Page JPG Scans. (For Mac users select all JPGs in Folder, right click and open with Preview)\n\nBook Description\nIn this New York Times bestseller, authors Singer and Avery present the compelling concept that global temperatures have been rising mostly or entirely because of a natural cycle. Using historic data from two millennia of recorded history combined with natural physical records, the authors argue that the 1,500 year solar-driven cycle that has always controlled the earth&amp;#039;s climate remains the driving force in the current warming trend.\n\nAmazon Reader Review\n\nSinger and Avery have put together an amazing summary of research from an extremely wide variety of sources that bear on the question of the Earth&amp;#039;s temperature variations. They pay particular attention to the 1,500 year (+/- 500) cycle discovered by Willi Dansgaard, Hans Oeschger, (in Greenland ice cores) and the Claude Lorius team (in Antarctic ice cores). \n\nSince the 1,500 year cycle was discovered in the early 1980&amp;#039;s it&amp;#039;s general characteristics have been confirmed by measurements in: tree rings (living, preserved and fossilized), pollen, coral, glaciers, boreholes, stalagmites, tree lines, and sea sediments. The most recent cycles have been recorded in human history with forced migrations, starvation, and disease during the cold portion of the cycle and greater population, expanded farm land, greater crop variety, and extra building during the warm portion. \n\nThe causes of the 1,500 year cycle are not well understood although 600 of them have been identified in the last million years. This permits us to be relatively confident that we have been moving into the warm phase of the cycle for the last 150 years. It also suggests that we may have one or two degrees more warming if we are to get to the typical high of the warm phase. \n\nAlthough the warm phase of the cycle has been typically more regular than the cold phase, it does not move steadily to a peak and then fall off, but rather moves abruptly higher at the start of the warm phase followed by highly irregular (but modestly higher) temperatures for hundreds of years. \n\nThe range of evidence the authors bring in to characterizes the 1,500 year cycle is stunning and their end-of-chapter notes (over 500) make this book the obvious starting point to study the whole issue of global warming / cooling. They have also included a well written 11 page glossary. \n\nThe chapter on &quot;The Sun-Climate Connection&quot; was probably written before the publication of Hendrik Svensmark and team&amp;#039;s experimental paper on low level cloud formation &quot;Experimental evidence for the role of ions in particle nucleation under atmospheric conditions&quot; (17 August 2006). Although they cite his previous work this latest paper adds experimental verification under controlled laboratory conditions for the solar winds participation in the formation of low level (high albedo) clouds. Once again carbon dioxide was conspicuous as a non-participant. \n\nThe authors include a chapter on the Kyoto Protocol and to no ones surprise predict it&amp;#039;s unlamented expiration in 2012. They also offer a scenario for why the Russians adopted the Protocol in spite of knowing that it is environmentally worthless. \n\nThose who have adopted the religion of anthropogenic global warming will not like the material presented in this summary, however science does march on and experimental evidence overrules hypotheses even if embodied in expensive computer simulations. \n\nEveryone interested in global temperature trends will be well rewarded by reading this book.","torrent":{"xt":"urn:btih:8aad205c82d88c365d8f535e1eabb8b2fb20835e","amp;dn":"Unstoppable+Global+Warming-Singer%3AAvery+%282007%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aad205c82d88c365d8f535e1eabb8b2fb20835e","infoHashBuffer":{"type":"Buffer","data":[138,173,32,92,130,216,140,54,93,143,83,94,30,171,184,178,251,32,131,94]},"announce":[],"urlList":[]}}