{"title":"FrameShots Video Frame Capture","uid":3997962,"size":1343648,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8abd19df4cf198823838fa59419f06561070aaf1&amp;dn=FrameShots+Video+Frame+Capture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"veTeran1986","files":3,"time":1201407660,"description":"\n---FrameShots Video Frame Capture---\n\n---Screenshot---\n &lt;a href=&quot;\nhttp://i105.photobucket.com/albums/m224/zackrin/2008-01-27_121328.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i105.photobucket.com/albums/m224/zackrin/2008-01-27_121328.jpg&lt;/a&gt;\n\n---Info---\n\nFrameShots Video Frame Capture was created as a very simple movie screen capture program. \nThe software takes a video screen capture from your MPEG, DivX, Xvid, WMV, AVI or any other movie file that Windows Media Player can play. \nYou can then skip frame by frame in the movie to capture a frame of video for your thumbnail.\n\nDownload and start taking your video snapshots of WMV video files and more and save those screen caps today. \nThis is the easy way to grab a video snapshot of wmv files and save your video thumbnails to disk. \nJust use it to capture a frame of video from your movie and save it to a JPEG file. \n\n    * Take a still video capture of your Xvid movies\n    * Use DRM (Digital Rights Management) capability\n    * Easily add text or image watermarks to frame captures\n    * Capture video frames automatically through the command line\n    * Automatically process multiple videos with Batch Mode\n    * Copy video snapshots to the clipboard for easy Photoshop access\n    * Automatically grab snapshots based on time intervals\n    * Automatically grab snapshots based on thumbnail amount\n    * Use keyboard shortcuts for popular options\n    * Use arrow keys to control seeking to find exactly the right video frame\n    * Crop images to the perfect thumbnail size\n    * Trim black borders around video snapshots\n    * Apply Resampling filters\n    * Meet easy, minimal system requirements\n    * Easily capture frames from almost any video ? it?s simple!\n\n5 Reasons why FrameShots Video Frame Capture is better than taking screenshots from Windows Media Player:\n\n   * With Windows Media Player you must turn off certain options and greatly slow down performance.\n\n   * With Windows Media player you can only take a full screenshot, you then have to crop the image.\n\n   * FrameShots will crop the image for you, including any black borders around images.\n\n   * FrameShots lets you seek by any frame amount you want, giving pinpoint video frame precision.\n\n   * FrameShots will automatically take as many video screenshots as you want from a video.\n\n\n\n\n","torrent":{"xt":"urn:btih:8abd19df4cf198823838fa59419f06561070aaf1","amp;dn":"FrameShots+Video+Frame+Capture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8abd19df4cf198823838fa59419f06561070aaf1","infoHashBuffer":{"type":"Buffer","data":[138,189,25,223,76,241,152,130,56,56,250,89,65,159,6,86,16,112,170,241]},"announce":[],"urlList":[]}}