{"title":"Pilot Guides - Scotland [RQ]","uid":3751693,"size":691035366,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8ade4327c4cd0d894afa3687e9455096aefbb20e&amp;dn=Pilot+Guides+-+Scotland+%5BRQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rundaqvisten","files":1,"time":1185310727,"description":"Megan McCormick explores Scotland, the land of untamed highlands, windswept islands, spectacular locks, glens and intriguing cities which has struggled for self-determination for more than a millennium. During the course of her journey she meets a cast of hardy inhabitants and experiences the vibrant culture of a land which is completely distinct from the rest of the British Isles. \n\nShe begins her journey in Glasgow, Scotland&amp;#039;s largest city, where she visits some of the city&amp;#039;s cultural attractions, including the Macintosh Museum which is dedicated to Scotland&amp;#039;s most celebrated architect and designer Charles Renny Macintosh. She also takes a lesson in playing the bagpipes, the traditional Scottish instrument which was invented by young shepherd boys in the highlands. \n   \nScotland had always had a stormy relationship with England, known as &amp;#039;The Old Enemy&amp;#039;. Scotland&amp;#039;s national hero is William Wallace, who led successful guerrilla campaigns against the English in the late 13th century. The story of his victories and eventual betrayal became famous the world over when the &amp;#039;Braveheart&amp;#039; movie starring Mel Gibson was made. Megan travels to Stirling, the sight of one of William Wallace?s most famous victories, where a re-enactment of the battle and a Braveheart Banquet is taking place. \n\nFrom Stirling Megan heads to the Hebrides to explore the island of Islay. Islay&amp;#039;s main industry is the distillation of whiskey and she takes a tour of the Ardberg distillery, one of the best in all of Scotland. Megan also meets musician Fiona Middleton who first came to Islay in 1976 and is known all over the island for playing her violin to the seal population.\n\nMegan continues her journey to the mountainous region of Oben on the west coast of the mainland. She sets out on a mission to climb Ben Truerton, the biggest hill in the Campbell area and one of the 284 mountains in Scotland over 3,000 feet. Known as &amp;#039;munroes&amp;#039;, the feat of conquering these admirable peaks is known as &amp;#039;munroe-bagging&amp;#039;, and her companion Charlie has bagged &amp;#039;em all - twice over!\n\nThe West Highland railway runs from Glasgow via Fort William to Mallaig and is one of the most scenic train journeys in the world. From Mallaig Megan takes a ferry to the Isle of Skye, a rugged island known for its castles, mountains and changeable weather. She takes a boat trip with a local fisherman who pulls mussels off the pillars of Skye bridge and cooks up a lunch time sea-food feast for tourists on his boat. \n\nAfter hitching a ride with the local postman to Loch Dunvegan, the oldest inhabited castle in Britain where the McCloud clan have lived for 700 years, it&amp;#039;s time for Megan to bid farewell to Skye. She teams up with a tour company that takes travellers all over the highlands in a converted bus - the very vehicle in which Ozzy Osbourne and Black Sabbath used to tour. First stop is the Battlefield of Culloden, where the last battle ever to be fought on British soil took place in 1746. In just 45 minutes 1,500 highlanders, led by Bonnie Prince Charlie, were slaughtered by the troops of the Duke of Cumberland. The English leader earned the nickname &amp;#039;Butcher Cumberland&amp;#039; for his brutal treatment of the defeated Scottish forces. \n\nBritain&amp;#039;s biggest lake and legendary home of &amp;#039;Nessie&amp;#039; lies just 6 miles west of Culloden. The first sightings of a gigantic monster living in Loch Ness occurred in the 6th century AD. Since then tourists have travelled here in the hope of sighting the beast. Megan meets some local characters who have given up comfortable jobs and home lives to pursue the myth of the Loch Ness Monster. \n\nMegan travels to Strathdon for the Clanloddoch Highland games. The games are an ancient tradition held all over the highlands, and were originally used as a test of skill and strength when recruiting clan warriors. She witnesses a range of events, from putting the stones, to throwing the hammers and tossing the caber, then tests her strength in the tug of war. \n\nNext port of call is the Orkneys, 70 or so islands off the north tip of mainland Scotland. The ancient landscape richly strewn with stone circles and burial chambers and Megan visits Skara Brae, Northern Europe&amp;#039;s best preserved prehistoric village. She also witnesses an Orkadian wedding tradition, where the bride and groom are pelted with a mixture of yoghurt, eggs, ironbrew, molasses and sand, known as blackening. Blackenings have been happening in Scotland for centuries, but the origins of the practise are steeped in mystery.\n\nSt. Andrews is the home of golf, one of the world&amp;#039;s most popular sports which was actually invented in Scotland over 500 years ago. The club has 6 courses, the most famous being the old course. To play on it you have to enter a ballot and just hope that your name is drawn - and fortunately for Megan, hers is! \n\nAfter a few rounds is time to embark on the last leg of her journey: to Edinburgh, the Capital of Scotland. She times her visit to co-incide with the Edinburgh Festival, an annual cultural extravaganza of dance, theatre, art and music. The population of the city doubles for the festival during the months of August to September and events take place all over the city. Megan spends her final evening in Scotland at the Edinburgh Military Tattoo, a display of military musical prowess from the finest bands of the British Commonwealth. \n \n","torrent":{"xt":"urn:btih:8ade4327c4cd0d894afa3687e9455096aefbb20e","amp;dn":"Pilot+Guides+-+Scotland+%5BRQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ade4327c4cd0d894afa3687e9455096aefbb20e","infoHashBuffer":{"type":"Buffer","data":[138,222,67,39,196,205,13,137,74,250,54,135,233,69,80,150,174,251,178,14]},"announce":[],"urlList":[]}}