{"title":"The Suicide Shrimp Fiasco - Self-Titled (2007)","uid":3882726,"size":78072603,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8bc8873affc192d2dd7a39e05a9471647753beb6&amp;dn=The+Suicide+Shrimp+Fiasco+-+Self-Titled+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"necromanson","files":13,"time":1194746876,"description":"This is the first album released by my band, The Suicide Shrimp Fiasco.  We&amp;#039;re a hybrid of Metal and Punk.  This album was completely produced and executed solely by the band and sounds quite good for an independant release.  All album artwork is included here as well as our band information.  See more of us at\n\nTrack List:\n1) Bitchnasticus\n2) He Ate the Mushroom\n3) Ha-Ha\n4) Meatllica\n5) Dance Like A Gangsta\n6) Snacks\n7) Incest Kitten\n8) Fuckup Track\n9) Devil Went Down to Georgia\n\nBand Bio:\n\nInspired by the pristine sand dunes of Lake Michigan, The Suicide Shrimp Fiasco offer up their own filthy concoction of Indonesian Shitcore. This Grand Haven/Spring Lake based band is a relative newcomer to the West Michigan music scene looking for any opportunity to have their music be heard. While this power quartet may be a relatively new ensemble they deliver up years of musical experience.\n\nAsshole McButtfuck (Unrelenting Vocal Harmonies) has been playing for 10 years and, even though he&amp;#039;s probably a better masturbator then a master guitar player, he has managed to strum for the Grand Haven based Katet as well as the Muskegon staple Miami Death Machine. After the addition of Dorkus McButtfuck, Asshole reluctantly laid down his guitar to focus solely on vocals and boy does he deliver!\n\nFaggot McButtfuck (Skins) and Buttfuck McButtfuck (Bass) had been playing for roughly 2 years together in the now defunct Grand Haven punk-rock outfit uniquely titled Fata Morgana. Unfortunately the band never took flight to superstar status; in fact it never left the basement. Few people may remember such memorable songs as &quot;Cradle Robber&quot; and &quot;Eager Beaver&quot;- both songs a testament to their neverending pursuit of self-humiliation. The band eventually fell apart and with the collaboration of Asshole, The Suicide Shrimp Fiasco was born.\n\nNot content on being a three-piece band The Suicide Shrimp Fiasco welcomed into the inner circle Dorkus McButtfuck, picking up the guitar where Asshole had left off. Before joining The SSF Dorkus could be found gently rocking in his uber-hip raggae band Mystic Dub. Dorkus has sworn that he has officially left his raggae roots behind and is ready to plant a new tree we like to call Indonesian Shitcore.The unorthodoxed approach to Indonesian Shitcore that The Suicide Shrimp Fiasco takes gives them a very unique style allowing them to stand out within the genre. They twist, turn, push, pull and punch the genre so far to it&amp;#039;s limits that sometimes it&amp;#039;s only faintly recognizable. In fact the only way you&amp;#039;d know it was of the Indonesian Shitcore persuasion is if someone told you. That however, as we like to call it in the biz, is talent.\n\nSo go ahead and give The Suicide Shrimp Fiasco a listen. Hell, just give them a chance. If you don&amp;#039;t like it then they don&amp;#039;t like you, but that&amp;#039;s the way they like it.\n","torrent":{"xt":"urn:btih:8bc8873affc192d2dd7a39e05a9471647753beb6","amp;dn":"The+Suicide+Shrimp+Fiasco+-+Self-Titled+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bc8873affc192d2dd7a39e05a9471647753beb6","infoHashBuffer":{"type":"Buffer","data":[139,200,135,58,255,193,146,210,221,122,57,224,90,148,113,100,119,83,190,182]},"announce":[],"urlList":[]}}