{"title":"Handel  Amadigi","uid":3973842,"size":382695915,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ccdd2cbfca6fffcd021929e65819abca17ecbd1&amp;dn=Handel++Amadigi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"citaltras","files":79,"time":1200153171,"description":"[b]G. F.   H A N D E L [/b]\n[b]Amadigi di Gaula [/b]\nOpera seria in three acts HWV 11 (1715)\nAl Ayre EspaÃƒÂ±ol\nEduardo Lopez Banzo\nnaive 2007\n\n-----\n2 CDs  \nmp3 \n320 Kbit/s\n-----------\n\n[IMG]http://i272.photobucket.com/albums/jj200/citaltras/amadigi0.jpg[/IMG]\n\nThis is Baroque Opera at its best.\nNo, this is nothing similar to Verdi or Pucini.\nIt is just another dimension in music.\n\nEnjoy and seed\n\n[b]From Wikipedia[/b]\n\nAmadigi di Gaula is an opera with music by George Frideric Handel. The identity of the librettist is ambiguous. Previous general understanding had been that John Jacob Heidegger was the librettist, but more recent comment has indicated that that the librettist was more likely to be Giacomo Rossi, with Nicola Francesco Haym as another candidate. In addition to Handel, AndrÃƒÂ© Destouches wrote an opera based on this story, and David Kimbell has compared in detail the treatments of the story by Handel and Destouches.\n\nThe opera received its first performance in London at the Haymarket Theatre on 25 May 1715. The original cast included the celebrated castrato Nicolo Grimaldi. The opera was a success and received a known minimum of 17 further performances in London through 1717, and a similar number in Hamburg from 1717-1720, with a different title, Oriana.[2] The opera then fell into neglect and was not revived in England until 1968, by the Unicorn Opera Group at the Abbey Hall, Abingdon.\n\nThe original manuscript of Amadigi has disappeared, as had sections of the music. Only one edition of the libretto is known, dating from 1715. Two published editions of the opera exist, the HÃƒÂ¤ndelgesellschaft edition of 1874, and the first critical edition, by J. Merrill Knapp, which BÃƒÂ¤renreiter published in 1971.[2] Winton Dean has examined the history of various manuscripts which contain alternative selections for the score.","torrent":{"xt":"urn:btih:8ccdd2cbfca6fffcd021929e65819abca17ecbd1","amp;dn":"Handel++Amadigi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ccdd2cbfca6fffcd021929e65819abca17ecbd1","infoHashBuffer":{"type":"Buffer","data":[140,205,210,203,252,166,255,252,208,33,146,158,101,129,154,188,161,126,203,209]},"announce":[],"urlList":[]}}