{"title":"ShamanicPrincess(Complete 1-6)Eng.DvD Ripped by ViRaLNeXxUs","uid":3940934,"size":8097765000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d7d4c4d90f05cca52d474244466c84e28f0f797&amp;dn=ShamanicPrincess%28Complete+1-6%29Eng.DvD+Ripped+by+ViRaLNeXxUs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"viralnexxus","files":2,"time":1198133728,"description":"This is the complete series and episodes of Shamanic Princess in a perfect 1:1 copy DvDRip. Enjoy...\n\n\n\nFormat &amp; Release\n\nShamanic Princess&amp;#039; initial Japanese release was on laserdisc and VHS, in 6 installments. The first episode was released in June 1996, and the last was released in June 1998. It was released on 2 region 2 DVDs starting in 2001.\n\nShamanic Princess has been released on DVD in North America by Central Park Media in 2000, and it has since been re-released in 2003. The show is known partially for its odd chronology: the first 4 episodes properly consist of what fans dub the &quot;Throne of Yord Saga&quot;, and the final two episodes cover the happenings that lead up to the Throne of Yord situation.\n\n[edit] Plot\n\nThe Guardian World lies in another dimension, and its inhabitants are charged with guarding and controlling magical forces. To this end, the inhabitants possess varying levels of magical power which allows them to change shape, destroy objects, suspend time, or call up elemental beings to do their bidding. The source of power in the Guardian World is the Throne of Yord, a mysterious painting watched over by the Elders, who train Neutralizers to tend the Throne and make sure it is kept safe. One of these Neutralizers (Kagetsu) has stolen the Throne and taken it to Earth for an unknown purpose, causing the Elders to send two different teams to Earth to reclaim the Throne -- for if the Throne is away for too long or is destroyed, the Guardian World will be undone.","torrent":{"xt":"urn:btih:8d7d4c4d90f05cca52d474244466c84e28f0f797","amp;dn":"ShamanicPrincess%28Complete+1-6%29Eng.DvD+Ripped+by+ViRaLNeXxUs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7d4c4d90f05cca52d474244466c84e28f0f797","infoHashBuffer":{"type":"Buffer","data":[141,125,76,77,144,240,92,202,82,212,116,36,68,102,200,78,40,240,247,151]},"announce":[],"urlList":[]}}