{"title":"Mackenna's Gold","uid":4017991,"size":6886099038,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8ebb64f9e0f3c2e13cd49a983fef528249bd11ca&amp;dn=Mackenna%5C%27s+Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Space48","files":28,"time":1202487532,"description":"Genre: Western\n\nYear: 1969\n\nDirector: J. Lee Thompson\n\nCast: Gregory Peck, Omar Sharif, Telly Savalas, Camilla Sparv, Keenan Wynn, Julie Newmar, Ted Cassidy, Lee J. Cobb, Raymond Massey, Burgess Meredith, Anthony Quayle, Edward G. Robinson, Eli Wallach, Eduardo Ciannelli, Dick Peabody.\n\nSynopsis: Gregory Peck and Omar Sharif battle to find a legendary cache of gold in this spectacular Wild West adventure. In the Arizona Territory of the 1870s, Marshal Sam Mackenna (Peck) is the only living person who knows the tortuous route to the fabulous &quot;Canon Del Oro&quot;. During his journey, Mackenna is captured by Colorado (Sharif), a brutal Mexican bandit who has long sought his death. But if Mackenna is to lead the cutthroat gang to the lost treasure, Colorado must keep him alive. En route, Mackenna and the outlaw band are joined by renegade soldiers, vengeful indians, cold-blooded killers and &quot;gentlemen from town&quot;. As they near the golden canyon, all but Mackenna are swept by a sudden fever ?the naked greed for gold. MACKENNAS GOLD is one of the most exciting Westerns ever made.\n\nRunTime: 123 min.\n\nVideo: Pal 2.35:1, 16:9\n\nLanguages: Dolby Digital 5.1: English . Mono: Spanish, French, German, Italian\n\nSubtitles: English, German, Spanish, Dutch, Swedish, Norwegian, Danish, Finnish, Portuguese, Hebrew, Polish, Greek, Czech, Turkish, Hungarian, Icelandic, French, Italian, Arabic, Hindu, Bulgarian.\n\nOther features: Interactive Menus, Original Poster, Trailers, Scene Access, Theatrical Trailer, Filmographies. \n\nDVD: DVD9 =&gt; DVD9 \n\nMore Info: http://www.imdb.com/title/tt0064615/\n","torrent":{"xt":"urn:btih:8ebb64f9e0f3c2e13cd49a983fef528249bd11ca","amp;dn":"Mackenna%5C%27s+Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ebb64f9e0f3c2e13cd49a983fef528249bd11ca","infoHashBuffer":{"type":"Buffer","data":[142,187,100,249,224,243,194,225,60,212,154,152,63,239,82,130,73,189,17,202]},"announce":[],"urlList":[]}}