{"title":"Team Fortress 2 Map pack","uid":4020874,"size":116530693,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8f00686e0a3697f980e163a116f3374d08644b6b&amp;dn=Team+Fortress+2+Map+pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"reverse_engineer","files":1,"time":1202661564,"description":"A compilation of ten users made maps for Team Fortress 2.\n\n- CTF_2fortified_v1\n2Forts on crack, this crazy map is huge but well designed. Including an additional level and more intricate design then the original we all play and love - this one is bound to have you thinking outside the box. \n\n- CTF_Convoy_v2\nA new take on a classic UT2k4 map. This is a very unique high speed Capture Point map that just needs to be seen. So get on that trucking convoy and rock through the night! \n\n- STB_Cowtown_Beta\nSTB.. Steal The Bacon! This map is a different twist on capture the intel, where one side has multiple intels and the other side has to steal each one sequentially to push forward and win! It&amp;#039;s a little bit intel capture, little bit capture point, and sounds like fun. \n\n- CP_ Castle3\nA castle? In TF2? Did we get warped into a game of Pirates, Vikings and Knights? If so where they? Oh well there is a pirate.. no wait, that&amp;#039;s just a Demo Man. Have a bit of anachronistic fun in this old world TF2 map. \n\n- CP_Switchback_b5\nA simple and unpretentious yet fun and high quality capture point map. Nothing much can or needs to be said about it other than the fact that it is a solid map that feels a whole lot more like a retail map than a fan made one!\n\n- CP_Vertigo_Beta3\nSeries&amp;#039; clash again in another throwback map, this one is based on the classic DE_Vertigo map from Counter-Strike. Whatever you do, don&amp;#039;t look down while playing this Capture Point map, Heavies are scared of heights. \n\n- CTF_Impact\nAnother fantastic map from Vilepickle, who has done several of the maps on this map pack. It is an intel map split between two very well designed bases that have multiple infiltration points each to sneak in and steal the intel.\n\n- CTF_mach4\nA great small yet very detailed intel map set between two bases. A lot of the detail really comes through in the area between the bases, it&amp;#039;s not just a straight shot but an area featuring tunnels, trenches, and even lifts to take you higher or lower.\n\n- DM_Mariokart\nYou got Mario Kart in my Team Fortress! You got Team Fortress in my Mario Kart! Well whatever the case may be it&amp;#039;s all good stupid fun. Hop into this mind bending map for some good old fashion deathmatch action in a net meme Mushroom Kingdom.\n\n- CP_Warehouse_b8\nThis is nothing more than a small, very intimate capture point map set within a warehouse. The action is fast and furious, and it&amp;#039;s a good thing the map is so intimate, because I hear that Pyros like to cuddle. \n\n\nTo install just run the EXE and point the installer to your Team Fortress 2 Maps directory.\n\n\n\n &lt;a href=&quot;\nhttp://www.fileplanet.com/promotions/maps/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fileplanet.com/promotions/maps/&lt;/a&gt;","torrent":{"xt":"urn:btih:8f00686e0a3697f980e163a116f3374d08644b6b","amp;dn":"Team+Fortress+2+Map+pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f00686e0a3697f980e163a116f3374d08644b6b","infoHashBuffer":{"type":"Buffer","data":[143,0,104,110,10,54,151,249,128,225,99,161,22,243,55,77,8,100,75,107]},"announce":[],"urlList":[]}}