{"title":"Casting for Porn","uid":3771876,"size":15598426081,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8f0515903b465176efabebb8dffc293957113de4&amp;dn=Casting+for+Porn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"frankkyboi","files":92,"time":1187031571,"description":"Casting for Porn\n\nTorrent Info   \nThere are In total of 41 wmv movies in this torrent a good 14,5 GB.\n40 Movies are straight sex and there is 1 lesbian movie, all in good video quality running at 2048 kbps.\nRunning scene time varies between 15 and 40 minutes.\n\nFor the description of all girls please check the [b][color=blue]Casting for Porn.doc[/color][/b] file, with pictures. This file is included in this torrent. Below a selection of 10 to give you an impression.[/size]\n\n\n[URL=http://picteufelchen.net/?img=cfp005felixbfb39.jpg] &gt;Felix&lt;[/URL]\nGirl Next Door Gets Fucked\nFelix looks like the girl next door but she certainly doesn&amp;#039;t act like it.  When she has the chance to get naked on camera she jumps all over it.  After a good sloppy blowjob she&amp;#039;s ready for some attention and spreads her legs to reveal her tight bald pussy.  She spreads wide and arches her back as her partner slides his cock in and out.\n\n[URL=http://picteufelchen.net/?img=cfp025tobi747a9.jpg] &gt;Tobi&lt;[/URL]\nTobi&amp;#039;s Big Audition\nTobi is a fresh faced amateur who wants to make it big in porn.  Her blonde pig tails and firm body give her a big advantage.  She&amp;#039;s like a rag doll as her partner puts her in any position he wants.  He moves from finger fucking her while she&amp;#039;s sucking his cock to forcing her head down on the bed while he takes her from behind.\n\n\n[URL=http://picteufelchen.net/?img=cfp019alexae458e.jpg] &gt;Alexa&lt; [/URL]\nAlexa Gets Covered in Cum\nAlexa is a sexy petite brunette who is ready for a good fucking.  Her partner works her hole good with his fingers to get it loosened up before he slides his cock deep in her.  She mounts his cock and rides it until he&amp;#039;s ready to cum.  That&amp;#039;s when she takes over with her mouth and sucks him until he blows his sticky wad all over her face.\n\n\n[URL=http://picteufelchen.net/?img=cfp015arizona727e8.jpg] &gt;Arizona&lt;[/URL]\nBusty Brunette Gets Fucked\nThis busty brunette is a dirty girl and you can see just how dirty as you watch her in action. She starts out playing with her own pussy but soon moves to sucking her partner&amp;#039;s cock so he can slide it in her pussy.  After several positions she ends up doggy style and he grabs her around the throat and gives her a good rough fucking before cumming all over her face.\n\n\n[URL=http://picteufelchen.net/?img=cfp023janessa04a87.jpg] &gt;Janessa&lt;[/URL]\nJanessa Needs More\nJanessa may feel the need to help out others but she also has needs of her own.  One of those needs is a good hard fucking and her partner is more than willing to give her that. He slides his fingers into her puffy slit before bending her over and putting his cock where his fingers were.  He finishes her off before blowing a load of hot cum on her tongue.\n\n \n[URL=http://picteufelchen.net/?img=cfp014pennylisa4a0dd.jpg] &gt;Penny and Lisa&lt;[/URL]\nBrunette Lesbian Loving\nPenny and Lisa are all about self pleasure and when they have the opportunity to please each other they don&amp;#039;t waste any time getting naked.  They experiment with their fingers before getting into some hardcore pussy licking and sucking.  Every girl needs some penetration and they start off with a few vibrators before working their way to a strap on and full force fucking.\n\n\n[URL=http://picteufelchen.net/?img=cfp036britneythehotdate89b1c.jpg] &gt;Britney&lt;[/URL]\nBad Girl Britney\nThis girl is no pop star but she is destined to be a cock star.  She knows how to lick and tease a cock just right to get it nice and hard. That&amp;#039;s not all she knows how to do as she bends over and wiggles her ass in the air to provide a place for her partner to slide his nice hard cock into.  She gets a good doggy style fucking before the filming is done.\n\n\n[URL=http://picteufelchen.net/?img=cfp001kaylaa7e30.jpg] &gt;Kayla&lt;[/URL]\nKayla&amp;#039;s On Screen Tryout\nKayla wants to be in a movie and will take any part that she&amp;#039;s offered but first she has to do a screen test.  the only part she&amp;#039;s good for is a porn movie and when she shows off her pierced clit it is sure to help her become a star.  Her oral skills are even more impressive as she swallows a fat cock before getting her pussy fucked hard.\n\n\n[URL=http://picteufelchen.net/?img=cfp026charismaplummergetslaid869b1.jpg] &gt;Charisma&lt;[/URL]\nCharming Charisma Gets Fucked\nCharisma is one sweet looking and charming chick but that&amp;#039;s not going to save her from getting a good hard fucking.  Her partner is a little more tender with her until he can&amp;#039;t take it anymore and forces his cock deep in her mouth while she&amp;#039;s giving him a blowjob.  Then he pushes his cock deep in her pussy until he&amp;#039;s ready to blow his load, which he does all over her mouth.\n\n\n[URL=http://picteufelchen.net/?img=cfp024nicole6661a.jpg] &gt;Nicole&lt;[/URL]\nNicole Has a Rough Time\nNicole looks sweet but her partner doesn&amp;#039;t treat her like a princess.  In fact, he&amp;#039;s rather fond of making her look like a little slut.  He gives her a good hard grudge fucking doggy style while he&amp;#039;s pulling her hair.  He tops off her experience by forcing his cock deep in his throat after he&amp;#039;s finished fucking her.\n\n\nIf you want to see an image of all girls[URL=http://picteufelchen.net/?img=CFPAllgirls80c74.jpg] [All Girls] [/URL]\n\n \nScreen shots   \n \nImages from Casting for Porn\n\n[URL=http://picteufelchen.net/?img=CFP1ba47d.jpg][IMG]http://picteufelchen.net/tn/CFP1ba47d.jpg[/IMG][/URL]    [URL=http://picteufelchen.net/?img=CFP2aa731.jpg][IMG]http://picteufelchen.net/tn/CFP2aa731.jpg[/IMG][/URL]      [URL=http://picteufelchen.net/?img=CFP3f4bf3.jpg][IMG]http://picteufelchen.net/tn/CFP3f4bf3.jpg[/IMG][/URL]     [URL=http://picteufelchen.net/?img=CFP46d831.jpg][IMG]http://picteufelchen.net/tn/CFP46d831.jpg[/IMG][/URL]     [URL=http://picteufelchen.net/?img=CFP56ebcd.jpg][IMG]http://picteufelchen.net/tn/CFP56ebcd.jpg[/IMG][/URL]      [URL=http://picteufelchen.net/?img=CFP6df875.jpg][IMG]http://picteufelchen.net/tn/CFP6df875.jpg[/IMG][/URL]\n\nMovie Info   \n\nAudio\nCodec: WMA2, 128kbps, 16 bits, 44kHz, stereo 1-pass CBR\nVideo\nCodec: WMV3, resolution 640x480, rate 2048 kbps, Good quality.\n\n[img]http://picteufelchen.net/pics/headerfe53a.jpg[/img]\n\nSince i am uploading another 23+ gb torrent this 1 will be uplaoded by the person who made this Siterip my mate hidden using his 24 Mb up/downlaod connection","torrent":{"xt":"urn:btih:8f0515903b465176efabebb8dffc293957113de4","amp;dn":"Casting+for+Porn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f0515903b465176efabebb8dffc293957113de4","infoHashBuffer":{"type":"Buffer","data":[143,5,21,144,59,70,81,118,239,171,235,184,223,252,41,57,87,17,61,228]},"announce":[],"urlList":[]}}