{"title":"300_2_Disc_Special_Edition_DvdRip","uid":3761406,"size":8938991667,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8faf6557890d26955f36a1fb0656604323b00d54&amp;dn=300_2_Disc_Special_Edition_DvdRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RacerDemon","files":2,"time":1186129375,"description":"[IMG]http://i44.photobucket.com/albums/f23/RacerDemon5/300_2disc.jpg[/IMG]\n\n\n\nBased on the graphic novel by Frank Miller and Lynn Varley, 300 takes over the screen like an invading horde. With all the gushing blood of a horror movie and the scope of a classic epic, the second film from Zack Snyder (who helmed the 2004 remake of DAWN OF THE DEAD) is an impressive visual spectacle. Gerard Butler (THE PHANTOM OF THE OPERA) plays Leonidas, the king of ancient Sparta. The city is famous for its warrior philosophy, and Leonidas won?t kneel to the demands of Persia\\&amp;#039;s King Xerxes (LOST\\&amp;#039;s Rodrigo Santoro). Instead, Leonidas leads his 300-strong army against Xerxes\\&amp;#039;s army of millions. Meanwhile, his wife (Lena Headley, THE BROTHERS GRIMM) campaigns in Sparta for the city to send reinforcements as she butts heads with the treacherous Theron (Dominic West, THE WIRE).\n\nWith its gore and scale, 300 marks director Snyder as a possible successor to Peter Jackson\\&amp;#039;s throne. Jackson also got his start in horror with BAD TASTE and DEAD ALIVE, and the two men share a penchant for ambitious battle scenes. The huge fights in 300 rival Jackson\\&amp;#039;s efforts in the LORD OF THE RINGS films. David Wenham, who starred in two of the Tolkien-based films, plays Dilios, one of the Spartan soldiers. Though the cast doesn\\&amp;#039;t boast any A-list stars, the actors ably fill their larger-than-life roles. In a film filled with men, Headley stands out as Queen Gorgo. She matches her warrior husband in strength, while showing love toward Leonidas and their son. Though there are scenes that demonstrate the humanity of the characters, 300 is undeniably about bravery and blood, and it succeeds because of the stylish depictions of both.\n\n\nFeatures\nAudio Commentary By Director Zack Snyder, Writer Kurt Johnstad &amp; Director Of Photography Larry Fong\nAudio: English Dolby Digital 5.1 Surround Sound, Dolby Digital Stereo\nAudio: French, Spanish Dolby Digital 5.1 Surround Sound\nDeleted Scenes With Introduction By Zack Snyder\nDubbed: French, Spanish\nFeaturettes: The 300 - Fact Or Fiction? - Historians, Authors &amp; Filmmakers Reveal How Much Of The Film Was Based On Fact, Who Were The Spartans - The Warriors Of 300 - Touches On The Customs &amp; Ways Of Life Of The Spartans That Weren\\&amp;#039;t Explicitly Shown In 300 But Were Used By The Actors &amp; Filmmakers To Help Build Their Characters.), &amp; Frank Miller Tapes - We\\&amp;#039;ll Show How The Outspoken Miller Continued To Push His Limits To Realize His Epic Graphic Novel In The World Of Film\nInteractive Menus\nPhoto Gallery: Rapid Fire Stills From The First Day Of Production To The Last\nScene Selection\nSubtitles: English, French, Spanish\nWebisodes: Behind The Scenes Peeks On The Set Of 300\n\nTechnical Info\n\nRelease Information\nStudio: Warner\nRelease Date: 7/31/2007\nRunning Time: 116 minutes\nOriginal Release Date: 2007\nCatalog ID: 116285\nUPC: 00085391162858\nNumber of Discs: 2\n\nAudio &amp; Video\nOriginal Language: English\nAvailable Audio Tracks: English\nVideo: Color\n\nAspect Ratio\nAnamorphic Widescreen 2.40:1","torrent":{"xt":"urn:btih:8faf6557890d26955f36a1fb0656604323b00d54","amp;dn":"300_2_Disc_Special_Edition_DvdRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8faf6557890d26955f36a1fb0656604323b00d54","infoHashBuffer":{"type":"Buffer","data":[143,175,101,87,137,13,38,149,95,54,161,251,6,86,96,67,35,176,13,84]},"announce":[],"urlList":[]}}