{"title":"Georgia Rule (Lo Dice Georgia)","uid":4006000,"size":4676250708,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8fc6d2a1a3dbcf355980aa46082122e08ca8017a&amp;dn=Georgia+Rule+%28Lo+Dice+Georgia%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"71chili","files":29,"time":1201825862,"description":"TÃƒ?TULO ORIGINAL: Georgia Rule\n\nAÃƒ?O: 2007\n\nDIRECTOR: Garry Marshall\n\nINTÃƒ?RPRETES: Jane Fonda (Georgia), Lindsay Lohan (Rachel), Felicity Huffman (Lilly), Dermot Mulroney (Simon), Cary Elwes (Arnold), Christine Lakin (Grace), Laurie Metcalf (Paula), Hector Elizondo (Izzy)\n\nDURACIÃƒ?N: 113 Minutos\n\nGÃƒ?NERO: Comedia\n\nSINOPSIS: La adolescente y rebelde Rachel grita, dice tacos y bebe. En otras palabras, es incontrolable. Destroza el coche colmando asÃƒÂ­ el vaso de la paciencia de su madre Lily, que decide echarla de su casa de San Francisco. Sin saber dÃƒÂ³nde llevar a la insoportable Rachel, la mete en el coche y decide ir a la granja de su madre en Idaho, el lugar que jurÃƒÂ³ no volver a pisar nunca.\n\nCRITICA: Una pelÃƒÂ­cula dirigida por mi adorado y amado Garry Marshall y con Lindsay Lohan de protagonista. Eso no me lo podÃƒÂ­a perder yo. Y aunque probablemente sea la pelÃƒÂ­cula que mÃƒÂ¡s me ha gustado del director, la pelÃƒÂ­cula sigue resultando una bazofia de mucho cuidado. Pero por lo menos no me ha parecido tan odiosa como algunas de sus anteriores pelÃƒÂ­culas.\n\nLo que comienza como una comedia en la que Lindsay Lohan va a pasar el verano a casa de su abuela (Jane Fonda) para enderezarse poco a poco, se va tornando en una pelÃƒÂ­cula dramÃƒÂ¡tica especialmente hacÃƒÂ­a la mitad de la pelÃƒÂ­cula pero sin olvidar algunos toques cÃƒÂ³micos que realmente son lo mÃƒÂ¡s desastroso de la pelÃƒÂ­cula. Desde el inicio cuando el Garrett Hedlund le toca la teta a la Lohan cuando estÃƒÂ¡ tumbada, o cuando estÃƒÂ¡ cree que Mulroney es homosexual en un principio ya sabes por donde va a ir el humor. Tiene muy poco y el que tiene es lamentable.\n\nLo cierto es que incluso los actores se esfuerzan por intentar sacar algo posÃƒÂ­tivo y evidentemente como pelÃƒÂ­cula de Marshall que es, intentan a la vez resultar lo mÃƒÂ¡s simpÃƒÂ¡ticos posibles. Digamos que la interpretaciÃƒÂ³n mÃƒÂ¡s lamentable es la de Garrett Hedlund, el pretendiente de la Lohan que ya tiene novia. Tampoco la contribuciÃƒÂ³n de Cary Elwes como el padrastro de Lohan es digna de elogiar precisamente. Pero las tres protagonistas pese a tener papeluchos basura intentan sacar algo posÃƒÂ­tivo. TambiÃƒÂ©n Dermot Mulroney aunque le toque ir con cara de pasmado toda la pelÃƒÂ­cula (cosa que no es culpa suya sino del personaje por otra parte). Por supuesto sale Hector Elizondo que para eso la peli es de Marshall aunque brevemente.\n\nRepleta de tÃƒÂ³picos del cine de Marshall, aunque algo mÃƒÂ¡s seria que sus anteriores pelÃƒÂ­culas (especialmente de mitad hacÃƒÂ­a el final, el comienzo es lo mismo de siempre de su cine). Y por lo menos no estÃƒÂ¡n Richard Gere ni Julia Roberts en la pelÃƒÂ­cula, que desde luego peor me podrÃƒÂ­a haber ido las cosas con la pelÃƒÂ­cula.\n\n\nSISTEMA: PAL\n\nAUDIO: EspaÃƒÂ±ol Dolby Digital 5.1, InglÃƒÂ©s Dolby Digital 5.1\n\nSUBTÃƒ?TULOS: EspaÃƒÂ±ol, InglÃƒÂ©s, AlemÃƒÂ¡n, Noruego, Sueco, BÃƒÂºlgaro, DanÃƒÂ©s, FinlandÃƒÂ©s\n\nRELACION DE ASPECTO: 1:1.85  16x9\n\nINFO EXTRA: Eliminado Audio Aleman, Trailers\n\nFORMATO: DVD9 =&gt; DVD5\n\nCOMPRESION: AnydvdRipper+DvdRemakePro+DvdRebuilderPro+HC 2 Pass    \n\nLOG REBUILDER: \n- Reduction Level for DVD-5: 58,8%\n- Overall Bitrate : 4.608Kbs\n- Space for Video : 3.646.342KB\n- HIGH/LOW/TYPICAL Bitrates: 4.818/1.229/4.608 Kbs","torrent":{"xt":"urn:btih:8fc6d2a1a3dbcf355980aa46082122e08ca8017a","amp;dn":"Georgia+Rule+%28Lo+Dice+Georgia%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fc6d2a1a3dbcf355980aa46082122e08ca8017a","infoHashBuffer":{"type":"Buffer","data":[143,198,210,161,163,219,207,53,89,128,170,70,8,33,34,224,140,168,1,122]},"announce":[],"urlList":[]}}