{"title":"Sigh - Discography","uid":3938130,"size":471792586,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:918ad1ffe320115b9fc82ad665b03446147b86bf&amp;dn=Sigh+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Regente01","files":59,"time":1197965937,"description":"Japan&amp;#039;s best-known black metal band Sigh has, over the years, also progressed into one of the genre&amp;#039;s most experimental and simply unusual bands regardless of whereabouts. Led by bassist/vocalist/keyboardist Mirai Kawashima, the trio formed in 1989, at which point the lineup was rounded out by Satoshi Fujinami on guitar and Kazuki on drums. They took their original inspirations from the raw &amp;#039;80&amp;#039;s thrash metal of bands such as Venom, Celtic Frost, and Kreator, meanwhile mixing in horror movie soundtrack atmospheres and keyboards/synthesizer arrangements (they were one of the first so-called black metal bands to heavily use keyboards). \n\nAfter a couple of demos, they recorded their first EP, Requiem for the Fools, in 1992 for the Wild Rags label, with Satoshi doubling on guitar and bass (Kazuki had left by this point). This effort drew the attention of infamous Mayhem (Nor) guitarist/Norwegian black metal scene figurehead Euronymous, who signed them to his Deathlike Silence Productions imprint for their debut full-length. Entitled Scorn Defeat, this album came out in 1993 after Euronymous&amp;#039; death and was the first Sigh recording to include guitarist Shinichi Ishikawa, with Satoshi moving strictly to drums and percussion.\n\nWith their lineup finally solidified, the trio signed to England&amp;#039;s Cacophonous Records, where they released their next three full-lengths: Infidel Art (1995), Hail Horror Hail (1997), and Scenario IV: Dread Dreams (1999); a mini-CD, Ghastly Funeral Theatre, also came out on Cacophonous in 1997. Over the course of these albums, Sigh steadily incorporated more diverse elements into their sound, including pianos, female choirs, classically inspired orchestrations (though not the bombastic, Wagner-ian sort favored by many European bands), non-horror movie soundtrack touches, and unexpected mood/style changes that reveal their acknowledged interest in composers John Zorn and Frank Zappa. (Hail Horror Hail even included a defiant warning, apparently meant for more traditionally minded metal listeners, stating that ``every sound on [the] album is deliberate, and if you find that some parts of the album are strange, it isn&amp;#039;t because the music in itself is strange, but because your conscious self is ill-equipped to comprehend the sounds produced on this recording.``) \n\n(Taken from MetalArchives)\n\nExcluding their debut Scorn Defeat - which has 128 of bitrate - all albums are in very good quality, ranging from 192 to 256 of bitrate.\n","torrent":{"xt":"urn:btih:918ad1ffe320115b9fc82ad665b03446147b86bf","amp;dn":"Sigh+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"918ad1ffe320115b9fc82ad665b03446147b86bf","infoHashBuffer":{"type":"Buffer","data":[145,138,209,255,227,32,17,91,159,200,42,214,101,176,52,70,20,123,134,191]},"announce":[],"urlList":[]}}