{"title":"Spirit Of John Morgan - Spirit Of J. M. (UK Bluesrock 1969)","uid":3366055,"size":59054013,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:929ede4e59bff695e224111111a7b88059705ba9&amp;dn=Spirit+Of+John+Morgan+-+Spirit+Of+J.+M.+%28UK+Bluesrock+1969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"test78","files":10,"time":1123311247,"description":"Search for test78 to find my other uploads.\n\nVery good UK blues from 1969. Not as much influenced by the psychedelia at the time as one would imagine, this is  raw, strong UK blues at its best. Those who dont htink the english can get the blues should give &quot;Yorkshire blues&quot; a listen - excellent stuff.\n\n\nJo-Ann Greene, All Music Guide:\nAlthough released in 1971, the debut self-titled album by Spirit of John Morgan was \nactually recorded two years earlier, before the spirit of the '60s dissipated into the excesses of the '70s. But even back in 1969, the British quartet were already fish out of water, gasping for R&amp;B in a Technicolor age of psychedelia. So they created their own, an entire album's worth of strong, shadowed, R&amp;B numbers underlit by magnificent musicianship and powerful rhythms. The set opener, a menacing cover of Graham Bond's &quot;I Want You,&quot; is a case in point, stalker-like in its intensity, with John Morgan's organ conjuring up a phantom of the opera from which there is no escape. However, Morgan's phenomenal finger skills are best showcased on a cover of Meade &quot;Lux&quot; Lewis' &quot;Honky Tonk Train Blues,&quot; a fabulously masterful piano boogie woogie, as is his equally extraordinary adaptation of \nAlbert Ammons' &quot;Shout for Joy.&quot; And Morgan is just as skilled on the organ, as is evidenced on the band's take on Big John Patton's &quot;The Yodel.&quot; As astounding as the covers are, the quartet offered up their own numbers that are of equal quality. &quot;Orpheus and None for Ye,&quot; is a particular standout, a dark, driving number that initially calls to mind the Spencer Davis Group before diving into the heart of the jungle, while Don Whitaker's guitar licks like flames around the piece. It is the set's final number, however, the ten-minute epic &quot;Yorkshire Blues&quot; that is the heart of the album. Delta blues brought to the English north, where the band convincingly make the case that life is just as tough up mill as it is down \nin the fields of the Deep South. In 43 minutes and with a mere eight songs, Spirit of John Morgan created an astonishing set.\n\n\n192kbs\nCover included\n\nTracklist:\n\n1. I Want You\t\n2. Honky Tonk Train Blues\t\n3. She's Gone\t\n4. Orpheus and None for Ye\t\n5. The Yodel\t\n6. Shout for Joy\t\n7. Ride On (A Train for All Reasons)\t\n8. Yorkshire Blues\t\n\nEnjoy!","torrent":{"xt":"urn:btih:929ede4e59bff695e224111111a7b88059705ba9","amp;dn":"Spirit+Of+John+Morgan+-+Spirit+Of+J.+M.+%28UK+Bluesrock+1969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"929ede4e59bff695e224111111a7b88059705ba9","infoHashBuffer":{"type":"Buffer","data":[146,158,222,78,89,191,246,149,226,36,17,17,17,167,184,128,89,112,91,169]},"announce":[],"urlList":[]}}