{"title":"TSOP Flash pack- Original Xbox","uid":3938976,"size":4344744,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:93a9041dbf32fa9c89ceb395314d5602dedfb946&amp;dn=TSOP+Flash+pack-+Original+Xbox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"unrar","files":1,"time":1198011277,"description":"highway 007mech flash pack\nFor the original xbox, not the 360\n\n\nA TSOP flash pack based on Evox and Linux. This pack loads evox dashboard and user can select to flash with evox or raincoat 0.5+ (using Linux). This exploit works for xbox version 1.0-1.5, even versions 1.4 &amp; 1.5 with winbond tsop. This package requires that your xbox&amp;#039;s hardware be modified for reflashing of the onboard tsop. For those who don&amp;#039;t know what a tsop is, go here:\n\n &lt;a href=&quot;\nhttp://www.xbox-scene.com/articles/tsop-images.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xbox-scene.com/articles/tsop-images.php&lt;/a&gt;\n\nYou need to solder the points in the red boxes in the top 2 pictures if you have a version 1.0-1.2. If you have a version 1.3 or above, you want to solder the points in the red circles in the bottom 2 photos. As for the 3rd picture down with the wire, i&amp;#039;ve never had to do that, so it&amp;#039;s not necessary. you should be able to tell them apart by carefully examining the pictures. Also look at the the tsop chip inside your xbox. If it says winbond you will need to flash with eurasia (yes, it is an option on the main menu of the exploit, so it&amp;#039;s easy.) Also if you try to flash bios from the main menu of the hack and it tries but hangs right at the beginning, then try to use flash with eurasia. This is the package I always use to do tsop flashes. Make sure to follow the included directions carefully as this is downloaded directly from xbins and is not pre-configured with a bios, meaning you will have find your own. I will upload some xbox bios files as soon as i can find a few to upload. \n\nSo, I bet you are wondering what the advantages of a tsop flash vs. softmod are. Tsop flash is way better in these ways:\n\n1. you can unlock the hard drive. not a big deal for everyday operation, but can prevent you from killing your xbox. doing this with a softmod means dead xbox.\n\n2. you can build new hard drives. this is great for someone who does mods, because i can make a hard drive for any xbox with one tsop flashed box, even softmods. just lock the hard drive using the softmodded xbox&amp;#039;s eeprom and it will work in the softmodded xbox.\n\n3. hard drive failure and lost eeprom doesn&amp;#039;t mean dead xbox. just build a new hard drive. yay!\n\n\nRemember, this is a VERY powerful tool, and you can destroy your xbox with this if you don&amp;#039;t know what you are doing, so be careful. i recommend an evox m8 bios for use with this exploit. Using the wrong bios can spell disaster.\n\ndownloaded from xbins\n\n@(X!_!X)@","torrent":{"xt":"urn:btih:93a9041dbf32fa9c89ceb395314d5602dedfb946","amp;dn":"TSOP+Flash+pack-+Original+Xbox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93a9041dbf32fa9c89ceb395314d5602dedfb946","infoHashBuffer":{"type":"Buffer","data":[147,169,4,29,191,50,250,156,137,206,179,149,49,77,86,2,222,223,185,70]},"announce":[],"urlList":[]}}