{"title":"Karlheinz Deschner - Kryminalna historia chrzescijanstwa. tom 5 ","uid":4011718,"size":4705538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93af9475b1d867b08280f4f5e35458a85c52c381&amp;dn=Karlheinz+Deschner+-+Kryminalna+historia+chrzescijanstwa.+tom+5+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pafcio1","files":4,"time":1202137363,"description":"Karlheinz Deschner - Kryminalna historia chrzescijanstwa. tom 5 (2002)\n\nIX i X stulecie. Od Ludwika Poboznego(814r.) do smierci Ottona III(1002r.)\n2002 Wyd. Uraeus. Tlum. z niemieckiego: Janusz Murczakiewicz\n----------------\nPliki w 4 wersjach: *.pdf, *.doc, *.html oraz *.prc. Spakowane rar-em\n\nPlik *.prc jest do MobiPocket Readera i dziala na prawie wszystkich nowych telefonach i palmach. Jest tez wersja na PC. Do pobrania ze strony: &lt;a href=&quot;\nhttp://www.mobipocket.com/en/DownloadSoft/ProductDetailsReader.asp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mobipocket.com/en/DownloadSoft/ProductDetailsReader.asp&lt;/a&gt;\n---------------- \n\nWydarzenia opisane w tym tomie zaczynaja sie w roku 814 wraz ze smiercia kanonizowanego pozniej agresora i ludobojcy Karola, zwanego Wielkim. Juz w czasach rzadow jego syna Ludwika, zwanego dla odmiany Poboznym, wybucha w kregu rodziny karolinskiej szarpanina o wladze. Imperium sie rozsypuje. Po zaledwie stu latach dynastia wschodniofrankijskich Karolingow wymiera z osoba osiemnastoletniego cesarza Ludwika, zwanego Dziecieciem.\nPelen swietnosci na polu kultury, ale politycznie skapany we krwi czas Ottonow trwal wedle owczesnej miary ledwie dwa ludzkie zycia, nieco ponad szescdziesiat lat i zakonczyl sia ze smiercia cesarza Ottona III w roku 1002, ktory zamyka rowniez niniejszy tom.\nW przedstawionych tu wiekach LX i X dokonuje sie scisle stopienie wladzy koscielnej i swieckiej. Cesarz stwarza sobie przeciwwage dla ustawicznie zawistnych ksiazat, obdarowujac biskupow i opatow cesarstwa ogromnymi nadzialami ziemi z dobr krolewskich i przenoszac na nich swe suwerenne prawa: zwierzchnia wladze sadownicza i lukratywne regalia handlowe, celne i mennicze. Powstaja ksiestwa koscielne. W zamian za to pomazancy Kosciola sa zobowiazani do stawania ze swa zbrojna swita przy dworze i na wojnie.\nBujniej niz dotad rozkwita zaangazowanie wojenne wyzszego duchowienstwa. Pod rzadami Ottonow Kosciol Rzeszy zostaje totalnie zmilitaryzowany; biskupstwa i opactwa rozporzadzaja znaczacym potencjalem wojskowym.\nRowniez papieze wyruszaja w pole: jak chocby Leon IV w roku 849, ktory jako pierwszy obiecuje katolickim wojownikom krolestwo niebieskie na wypadek smierci; w roku 877 Jan VIII, a w 915 Jan X.\nCzesto jeden papiez ekskomunikowal drugiego. Rozmaici Ojcowie swieci sa zamykani w klasztorach, a niejeden zostal wtracony do wiezienia, pocwiartowany, uduszony czy otruty. Papiez Sergiusz III (904-911) kazal pozbawic zycia kolejno dwu poprzednikow, papiezy Leona V i Krzysztofa. Szczegolna pewnosc chcial miec pierwszy w historii zabojca papieza: podczas rewolty palacowej pewien bogobojny krewny Jana VIII najpierw go otrul, a potem Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½dopoty walil go mlotem, az utkwil w jego mozgu\\\\\\&quot;.\n","torrent":{"xt":"urn:btih:93af9475b1d867b08280f4f5e35458a85c52c381","amp;dn":"Karlheinz+Deschner+-+Kryminalna+historia+chrzescijanstwa.+tom+5+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93af9475b1d867b08280f4f5e35458a85c52c381","infoHashBuffer":{"type":"Buffer","data":[147,175,148,117,177,216,103,176,130,128,244,245,227,84,88,168,92,82,195,129]},"announce":[],"urlList":[]}}