{"title":"Rush Hour 3 DVD Cover","uid":3775986,"size":399218,"categoryP":"other","categoryS":"covers","magnet":"?xt=urn:btih:94498078d9b359fedc815c0804ee6a16ef94026d&amp;dn=Rush+Hour+3+DVD+Cover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alvoi","files":1,"time":1187359342,"description":"Rush Hour 3 DVD Cover. Very good quality\n\nAbout the film:\n\nIn the heart of Paris lies a deadly secret. Half a world away in Los Angeles, Ambassador Han is about to disclose it. In his possession is explosive new evidence about the inner workings of the Triads--the most powerful and notorious crime syndicate in the world. The Ambassador has discovered the identity of Shy Shen, the very crux of the wide-ranging crime ring, and he&amp;#039;s about to reveal it to the World Criminal Court--until he is silenced by an assassin&amp;#039;s bullet. The Triads will go to any lengths to make sure their secrets stay buried, and there&amp;#039;s only one hope for stopping them. LAPD Detective Carter and Chinese Inspector Lee are back--back where they don&amp;#039;t belong. The unlikely duo is headed to the City of Lights to stop a global criminal conspiracy and save the life of an old friend, Ambassador Han&amp;#039;s now-grown daughter, Soo Yung. They don&amp;#039;t know the city, the language or even exactly what they&amp;#039;re looking for, but their race will take them across the city, from the depths of the Paris underground to the breathtaking heights of the Eiffel Tower, as they fight to outrun the world&amp;#039;s most deadly criminals and save the day.","torrent":{"xt":"urn:btih:94498078d9b359fedc815c0804ee6a16ef94026d","amp;dn":"Rush+Hour+3+DVD+Cover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94498078d9b359fedc815c0804ee6a16ef94026d","infoHashBuffer":{"type":"Buffer","data":[148,73,128,120,217,179,89,254,220,129,92,8,4,238,106,22,239,148,2,109]},"announce":[],"urlList":[]}}