{"title":"jaws 2(1978)[h33t][gasa001]","uid":3930061,"size":1588318883,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:945b1e801698e355ce2afdb7516be2b42a6aca8b&amp;dn=jaws+2%281978%29%5Bh33t%5D%5Bgasa001%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lukareli001","files":2,"time":1197400138,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0077766&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0077766&lt;/a&gt;\n\nThe small island resort town of Amity is trying to bounce back from the financial problems it had after becoming known as the site of shark attacks four years ago. Mayor Larry Vaughn is welcoming developer Len Peterson and his new resort to Amity. Two scuba divers are exploring the area where the Orca sank after police chief Martin Brody killed a huge shark four years ago. A shark shows up and kills the two divers, but not before one of the divers takes a close-up picture of the shark&amp;#039;s eye, and sometime later, while a mother is driving a boat that&amp;#039;s pulling her water-skiing teenage daughter, the shark kills the daughter and causes the mother to accidentally blow up the boat, then a killer whale is found on the shore with a huge bite on it. After Brody sees this, he knows there&amp;#039;s another huge great white shark in Amity&amp;#039;s waters, but Vaughn and Peterson explain these attacks away as non-shark accidents, because the thought of another shark in Amity&amp;#039;s waters would drive tourists away from the new resort and cause the new resort to lose money. It looks like Vaughn is still a mayor who puts money ahead of people&amp;#039;s lives. Brody tips his gun&amp;#039;s hollow point bullets with cyanide and melted candle wax and tells his sons Michael and Sean to stay away from the beaches and tells them to not go sailing with Mike&amp;#039;s friends, who include Vaughn&amp;#039;s son Larry Vaughn Jr. Everyone thinks Brody&amp;#039;s fears are shark trauma-induced paranoia. Brody even tries to call his friend Matt Hooper, who is doing research on a boat in the Antarctic Circle, and Matt will be in the Antarctic Circle for a few more months. While keeping an eye on the waters from the beach&amp;#039;s shark tower, Brody sees a huge dark spot in the water and rings the tower&amp;#039;s alarm bell, but it turns out to be a school of bluefish. Vaughn fires Brody for causing this panic at the beach and scaring tourists and their money away, and even though they were told not to, Michael and Sean go out sailing with Junior Vaughn and their friends, unaware that the shark is trailing them. Brody knows it&amp;#039;s up to him to find them before the shark kills too many of them.\n\nResolution.......: 720x480\nVideo Bitrate.......: 96 kb/s\nFPS.......: 25","torrent":{"xt":"urn:btih:945b1e801698e355ce2afdb7516be2b42a6aca8b","amp;dn":"jaws+2%281978%29%5Bh33t%5D%5Bgasa001%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"945b1e801698e355ce2afdb7516be2b42a6aca8b","infoHashBuffer":{"type":"Buffer","data":[148,91,30,128,22,152,227,85,206,42,253,183,81,107,226,180,42,106,202,139]},"announce":[],"urlList":[]}}