{"title":"AVPR: Aliens vs Predator - Requiem (2007) Release by: T34M !NV!5","uid":4016054,"size":725880299,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9609fd55fd680e5257d7541ab12ff6dd2c2b75ae&amp;dn=AVPR%3A+Aliens+vs+Predator+-+Requiem+%282007%29+Release+by%3A+T34M+%21NV%215&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"team.invisible","files":1,"time":1202365484,"description":"Two Predators load several live Alien facehuggers and his dead comrade onto a ship, intending to return to the Predator homeworld. Unbeknown to him, the dead comrade was impregnated with an Alien before dying. The alien bursts from the corpse\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s chest, then quickly grows into a Predator-Alien hybrid (Tom Woodruff, Jr). The hybrid attacks the crew, killing them and forcing the ship to crash land in Gunnison, Colorado. Before one of the Predators is killed, he sends a distress call to the homeworld. His message is received by a Predator warrior (Ian Whyte) who immediately embarks on the journey to earth to rectify the situation. Meanwhile, the facehuggers escape from the crashed ship and impregnate a father and son hunting team (Kurt Max Runte and Liam James) and, later, two homeless men living in the sewer system.\n\nDallas (Steven Pasquale) returns to Gunnison after a stint in the state penitentiary. He is picked up at the bus station by Morales (John Ortiz); Dallas and Morales used to be partners in crime, but Morales is now the county\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s sheriff. Also arriving home is Kelly (Reiko Aylesworth), after a tour of duty in Iraq. Her husband, Tim (Sam Trammel) is overjoyed to see her, but their daughter, Molly (Ariel Gade), is unsure of how to react to her mother\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s return. She does, however, enjoy the night-vision goggles Kelly brought home as a souvenir. Meanwhile, Dallas\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s younger brother Ricky (Johnny Lewis), is beaten up by Dale (David Paetkau) and his friends. Ricky has been flirting with Dale\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s girlfriend, Jesse (Kristin Hager). The fight is the last straw and Jesse breaks things off with Dale. She invites Ricky to go skinny-dipping with her at the high school\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s pool later that night.\n\nThe Predator arrives and scavenges weapons from the downed vessel then destroys it. He uses an acid to destroy the corpses of the alien\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s current victims as well as the facehuggers he finds. When Deputy Ray stumbles upon the scene, the Predator kills him and skins his corpse. When Morales and Dallas find Ray\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s body, they realize that something horrible is stalking the town.\n\nThe Predator tracks the aliens to the city\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s sewer system. He dispatches several but is caught off-guard by the Pred-Alien. The Pred-Alien and other aliens escape into the city and begin to attack the citizens. The Predator follows one to the city\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s nuclear power station. In the ensuing battle, the station is damaged and the city loses power. Morales realizes that the entire county is in danger and orders the town evacuated. He also requests National Guard assistance. The Pred-Alien realizes he can use fertile women to create hordes of aliens without needing facehuggers. At the local hospital, it injects alien larvae into all of the pregnant mothers in the maternity ward. Within hours, a small army of aliens has been created.\n\nAt the high school, Ricky\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s swim date with Jesse is interrupted when Dale and his friends arrive and attack Ricky. Before they can drown him in the pool, an alien arrives and kills Dale\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s friends. Jesse, Ricky and Dale escape and find Morales and Dallas at the power station. They tell them what has happened, which Morales and Dallas largely confirm by visiting the school. They don\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t find any corpses, however, as the Predator has already been there to kill the alien and destroy the evidence. Morales, Dallas, Ricky, Jesse and Dale realize they need weapons to protect themselves and break into a local sporting goods store. They are joined by Kelly and Molly, who have been attracted by the flashing lights on Morales\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s squad car. Earlier, an alien had attacked their home, killing Tim.\n\nMorales makes contact with the arriving National Guardsmen. All he hears, however, is the sound of them being slaughtered by the aliens. Then aliens appear in the sporting goods store. However, the Predator has followed them there and kills the aliens. Dale\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s face is melted off by alien acid blood but the others escape. They make their way to the scene of the Guardsmen slaughter. Kelly knows how to drive the tanks, so they all climb in. Morales contacts Col. Stevens (Robert Joy), who tells them to head to the center of town to be airlifted out of town. However, the plan is not to airlift anyone to safety but instead to use the townspeople as bait to draw the aliens to one area and then destroy everyone with a small nuclear bomb. Kelly realizes that they will all die if they do as Stevens tells them but Morales doesn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t believe her. When they encounter a number of other people headed towards the center of town, Morales joins them; Kelly, Molly, Dallas, Ricky and Jesse head for the hospital, where they will use the med-evac helicopter to fly to safety.\n\nThe hospital is overrun with aliens, and the Predator arrives to destroy them. Making their way up the stairs, the humans run into the middle of a Predator-Alien battle. Jesse is impaled by the Predator\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s flying daggers. Enraged, Ricky attacks the Predator with a machine gun but before the Predator can kill him, the aliens knock it down an elevator shaft. Ricky is wounded but will live. The Predator leaves behind a pulse rifle, which Dallas picks up. They make their way to the roof, but aliens block their path to the helicopter. As Dallas uses the pulse rifle to hold off the aliens, Kelly gets the helicopter started. Just as the aliens are about to surround and kill Dallas, the Predator arrives and kills off the remaining aliens. Dallas boards the helicopter and they fly away as the Predator and Pred-Alien duel to the death.\n\nAt the center of town, the humans are surrounded by aliens. Looking up to the skies in hopes of seeing rescue helicopters, Morales instead sees a jet fighter drop a bomb; he realizes Kelly was right as the town and all of the remaining aliens are incinerated, including the Predator and Pred-Alien who are locked in each other\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s death grip. Kelly manages to pilot the helicopter to a fairly safe crash landing. They are surrounded by other Guardsmen who disarm them and provide medical care to Ricky. They confiscate the Predator pulse rifle from Dallas.\n\nCol. Stevens takes the Predator pulse rifle to Ms. Yutani (Francoise Yip). She tells him that the earth is not ready for the technology it represents. Col. Stevens knows Yutani doesn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t want the technology to use on earth.","torrent":{"xt":"urn:btih:9609fd55fd680e5257d7541ab12ff6dd2c2b75ae","amp;dn":"AVPR%3A+Aliens+vs+Predator+-+Requiem+%282007%29+Release+by%3A+T34M+%21NV%215","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9609fd55fd680e5257d7541ab12ff6dd2c2b75ae","infoHashBuffer":{"type":"Buffer","data":[150,9,253,85,253,104,14,82,87,215,84,26,177,47,246,221,44,43,117,174]},"announce":[],"urlList":[]}}