{"title":"Eight Glorious Years of Nepalese People's War PROPER","uid":3348791,"size":1560846912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9665c6b7e8812a29469c00e0c29b040a8616ef20&amp;dn=Eight+Glorious+Years+of+Nepalese+People%5C%27s+War+PROPER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"infofallout","files":106,"time":1119776108,"description":"Eight Glorious Years of Nepalese People's War\n\nThis movie shows the heroic and inspiring struggle of the peasantry in Nepal against all odds, even in the face of US and Indian imperialism. In the face of all of this oppression and imperialism, the third poorest country in the world, with extraordinarily backward fuedal relations that oppress women and indigenous peoples, is standing up from the ground and ripping all oppression from the very root of culture, economic, and social relations. The People's War in Nepal is a shining beacon to all oppressed peoples around the world.\n\n\n----------------------------------------------------------------\nNote: We went through extraordinarily difficult lengths to obtain this movie from the Communist Party of Nepal, and had to go through several third party sources that attempted to subtitle it for the English speaking world. We've solved nearly all of the quality problems in this PROPER release! This PROPER release is also 1/3 smaller with no quality loss! Thanks to everyone who stuck with us through all of the problems!\n----------------------------------------------------------------\n\n\nAlthough the Revolutionary Communist Party does not endorse this movie, we would encourage people who are interested in standing in solidarity with our comrades in Nepal and their overall extraordinarily just struggle, to contact the Revolutionary Communist Party, USA (or any other Party that is a part of the Revolutionary Internationalist Movement in your home country).\n\n\n----------------------------------------------------------------\nwww.revcom.us -home page of the Revolutionary Communist Party, USA\n\nwww.threeqvideo.com -the website of ThreeQ Video, a company who puts out the official revolutionary DVD talk by Bob Avakian, Chairman of the Revolutionary Communist Party, USA\n\nwww.cpnm.org -home page of the Communist Party of Nepal (which needs to be revamped!)\n\nwww.insof.org -Internationalist Nepalese Solidarity Forum\n\nAlso, if you need to obtain this film in another format, or need an actual DVD mailed to you, please email ericcoguiliani (at) hushmail (dot) com (No spam please!)\n----------------------------------------------------------------\n\nThanks for reading, and we hope you enjoy this great film!","torrent":{"xt":"urn:btih:9665c6b7e8812a29469c00e0c29b040a8616ef20","amp;dn":"Eight+Glorious+Years+of+Nepalese+People%5C%27s+War+PROPER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9665c6b7e8812a29469c00e0c29b040a8616ef20","infoHashBuffer":{"type":"Buffer","data":[150,101,198,183,232,129,42,41,70,156,0,224,194,155,4,10,134,22,239,32]},"announce":[],"urlList":[]}}