{"title":"Psychic Detectives (CourtTV) 1","uid":3782363,"size":1466974687,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96b4462326c5a724efddbe4a370af96334de78d9&amp;dn=Psychic+Detectives+%28CourtTV%29+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"krackaboi","files":16,"time":1187905094,"description":"Check the filelist to see what episodes are included in this post.  I&amp;#039;ll post more when/if I get them.\n\n\n\n----------------------------\n\n                     Psychic Detectives - CourtTV\n\nAudio Format.........: MP3\nEncoder..............: Fraunhofer MP3Enc\nBitrate..............: 128 (CBR)\nHz...................: 48,000\nChannels.............: Stereo\nSource...............: Satellite\n\nVideo Format.........: xvid\nVideo Bitrate........: Approx. 1018\nResolution...........: 512 x 384\nFPS..................: 29.970\nSource...............: Satellite\nOriginal Format......: NTSC\nGenre................: Paranormal\nPoster on Usenet.....: Nan\n\n----------------------------\n                                 Release Notes\n\n\n&quot;Driven by Darkness&quot;\n\nOriginally aired 12/1/04\n\nPsychic Nancy Weber is brought in to help determine if a body \nfound in a New Jersey woods was a victim of foul play.\n\n-----\n\n&quot;The Beacon&quot;\n\nOriginally aired 8/9/06\n\nWhen a well-liked local mother is found dead in her Cape Cod home, \nan inability to determine time of death, a crime scene yielding no clues \nand a mysterious injury on the victim&amp;#039;s face leave police baffled. They \ncontact psychic Phil Jordan, who identifies the source of the victim&amp;#039;s \nwound. Impressed by his accuracy, police prod Phil for more information. \nCan a sketch of the killer drawn only from Phil&amp;#039;s visions actually lead to \nan arrest?\n\n-----\n\n&quot;While You Were Sleeping&quot;\n\nOriginally aired 8/8/07\n\nThe affluent suburb of Indian Hills in North Little Rock is one of the safest areas in \nArkansas. But not the day police find Ron Orsini dead in his bedroom, the victim of \na fatal gunshot wound. Orsini&amp;#039;s wife and daughter are unharmed in the other bedroom, \nand with no sign of burglary, no forced entry and no obvious suspects, it looks like \nsomeone may get away with murder; unless psychic Carol Pate&amp;#039;s visions of money \nand a map can unravel the mystery.\n\n-----\n\n&quot;Pushed Too Far&quot;\n\nOriginally aired 8/15/07\n\nNicole Arochas vanishes from a party without a trace. Leaving \nbehind no clues and no leads, the case quickly hits a dead end. \nWith nothing to lose, Nicole&amp;#039;s family and friends seek guidance \nfrom an unusual source &amp;#039; psychic Frank St. James. Police are \nskeptical, but when St. James starts actually naming names of \npeople that Nicole was with that evening, everyone is sold. Can \nSt. James&amp;#039; visions bring Arochas home?\n\n-----\n\n&quot;Web of Lies&quot;\n\nOriginally aired 7/11/07\n\nPolice respond to the report of a violent crime and find 45-year-old Thomas Bragg beaten to death in his bed. But for all the blood evidence left at the scene, nothing points to the identity of the killer. Everyone is a suspect, and someone is getting away with murder. At a dead end, police fly psychic Phil Jordan down to Georgia to see if he can shed some light on the case. As Jordan gets into the car with the detectives, he senses he&amp;#039;s being pulled and begins giving directions. Winding through the streets of an area he&amp;#039;s never been to before, Jordan directs them straight to a small brown house and proclaims that ?Â¬someone here knows what happened to Tom.&amp;#039; Detectives are blown away &amp;#039; they&amp;#039;re well aware of who lives there. TV-PGV\n\n-----\n\n&quot;Stumped&quot;\n\nOriginally aired 7/18/07\n\n\nPolice responding to a home on a quiet street in Mt. Pleasant, Iowa \nfind 60 year-old Max Beavers stumbling out of the house, covered \nin blood. Officers enter to a horrific scene; Max&amp;#039;s wife Clementine \nshot dead in the living room, and 17-year-old daughter Karol, lying \ndead in the garage. Max is quickly cleared of the crime, but police \nhave little to go on. With leads running dry, can psychic Phil Jordan&amp;#039;s \nvisions of a locket and a restaurant help get a killer off the streets \nbefore he strikes again?\n\n-----\n\n&quot;Hare Evidence&quot;\n\nOriginally aired 7/25/97\n\nAfter a blazing house fire in Albany, GA, tragically claims the \nlife of a young girl named Jessica Reinhardt, the autopsy report \nturns the terrible accident into a full-scale murder investigation. \nPolice start dig into the girl&amp;#039;s past, and quickly have a prime \nsuspect. But psychic Karen Prisant is convinced they&amp;#039;re looking \nat the wrong guy. Can the psychic&amp;#039;s visions of rabbits actually \nhelp find the killer?\n\n-----\n\n&quot;Close to Home&quot;\n\nOriginally aired 8/1/07\n\nThe Fresno Police Department receives a frantic call from a \nwoman saying her stepson, Steven Brown, has disappeared \nfrom a crowded store. Police quickly scour the immediate \narea but find no trace of the boy. Fearing the worst, a frightened \ncommunity joins in the search. Friends and neighbors plaster \nthe area with missing person posters and police officers comb \nsurrounding fields, ponds, rivers, and abandoned houses. \nRunning out of time and with no leads, police turn to psychic \nKay Rhea for help. Rhea hears a high pitched whistle, running \nwater and believes Steven is dead. If her disturbing visions are \ncorrect, police should actually be looking for a killer.","torrent":{"xt":"urn:btih:96b4462326c5a724efddbe4a370af96334de78d9","amp;dn":"Psychic+Detectives+%28CourtTV%29+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b4462326c5a724efddbe4a370af96334de78d9","infoHashBuffer":{"type":"Buffer","data":[150,180,70,35,38,197,167,36,239,221,190,74,55,10,249,99,52,222,120,217]},"announce":[],"urlList":[]}}