{"title":"[%Â³?P2].Insectia2 - Scorpions 720p DivX AC3.avi","uid":3755486,"size":736260096,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:96bf8f2bb94b9998b15e6c7425b3c90c5a58f350&amp;dn=%5B%25%C2%B3%3FP2%5D.Insectia2+-+Scorpions+720p+DivX+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moon2002","files":1,"time":1185610794,"description":"General Info\nLength: 25min:53.834sec\nDescription: With shaggy hair and a husky voice, the founder of Montreal&amp;#039;s Insectarium exclaims, to anyone who will listen: &quot;Let&amp;#039;s face it; insects are the most useful animals, both to nature and to mankind... I just want to reconcile humans with this class that has a lot of class - insects !\n\nWhoever meets Georges Brossard and listens to him plead the cause of insects leaves the encounter with a new vision of the world. Needless to say, Georges Brossard himself is &quot;quite a specimen&quot;. After fifteen years as a notary, at age 38, he left his old life behind to scour the world in search of insects. With great tenacity, he succeeded in putting together one of the world&amp;#039;s largest private collection of insects. Brossard wanted to donate his treasure to Quebecers, but on one condition: that a world-class temple be built and dedicated to the study of insects. Thus was born the Montreal Insectarium. Since then, Georges Brossard has become a world-famous authority on establishing insectariums and popularizing entomology, the study of insects, including a mandate from the Audubon Organization to develop a $55 million insectarium in New Orleans.\n\nGeorges Brossard is the creator and mastermind of the INSECTIA series. His enthusiasm is infectious, his anecdotes are fascinating, his explanations are captivating, and his parallels between the worlds of man and insects are daring. \nBrossard&amp;#039;s approach is straightforward, and his vision, wide-ranging. This great communicator tackles the subject of entomology with a passion nurtured by twenty years of research, on-site expeditions, and lobbying to overcome the \nseemingly insurmountable barrier which exists between people and the natural sciences. To Georges Brossard, the world of insects is not merely a reason for living but life itself. A celebration of life on this planet - that is the essence of \nINSECTIA.\n\n\n      Complete name : [????2].Insectia2 - Scorpions 720p DivX AC3.avi\n      Format : AVI\n      Format/Info : Audio Video Interleave\n      Format/Family : RIFF\n      File size : 702 MiB\n      PlayTime : 25mn 53s\n      Bit rate : 3783 Kbps\n      Width : 1280 pixels\n      Height : 720 pixels\n      Aspect ratio : 16/9\n      Frame rate : 29.970 fps\n\n      ** Audio **\n      Codec : AC3\n      PlayTime : 25mn 53s\n      Bit rate : 384 Kbps\n      Bit rate mode : CBR\n      Channel(s) : 2 channels\n      Sampling rate : 48 KHz\n      Video0 delay : 22ms\n      ChannelPositions : L R\n","torrent":{"xt":"urn:btih:96bf8f2bb94b9998b15e6c7425b3c90c5a58f350","amp;dn":"%5B%25%C2%B3%3FP2%5D.Insectia2+-+Scorpions+720p+DivX+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96bf8f2bb94b9998b15e6c7425b3c90c5a58f350","infoHashBuffer":{"type":"Buffer","data":[150,191,143,43,185,75,153,152,177,94,108,116,37,179,201,12,90,88,243,80]},"announce":[],"urlList":[]}}