{"title":"HOLOCAUST THEORY - Inception of Eradication  [1998] [INDUSTRIAL]","uid":3974898,"size":69512765,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:985ca4f09fe1dc0f59d6379eeffa86b1863a5682&amp;dn=HOLOCAUST+THEORY+-+Inception+of+Eradication++%5B1998%5D+%5BINDUSTRIAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wisnia242","files":13,"time":1200221290,"description":"Wykonawca: HOLOCAUST THEORY\nTyp: ALBUM\nGatunek: INDUSTRIAL \nJakoÃ…?Ã„?: mp3@128  \nData wydania: 1998\n\nTRACKLISTA  :\n\n1  \t   \tRain:Phase 5 (The Six Phases Of Holocaust) (4:59)\n2 \t  \tAs Death Approaches (4:55)\n3 \t  \tCig (Noisex Remix) (5:47)\n4 \t  \tBalanced Chaos (Revised) (3:42)\n5 \t  \tDredge (5:52)\n6 \t  \tMan Vs. Machine 1A (5:45)\n7 \t  \tCig (5:34)\n8 \t  \tMan Vs. Machine 2A (2:12)\n9 \t  \tCold Winters Of Holocaust (8:36)\n10 \t  \tMan Vs. Machine 3A (2:07)\n11 \t  \tAs Death Approaches (Vacuum Mix By Gridlock) (3:51)\n12 \t  \tSpit Of Life (5:34)\n13 \t  \tRain:Phase 6 (The Six Phases Of Holocaust) (13:23)\n\n\n\nHailing from San Francisco, Holocaust Theory is compised of James Curzon Vietzke and Scott William Beebe. The two have been collaborating since 1993 and have created an extremely dark entity of music. Vietzke and Beebe met up in 1993 at the famed SF goth/industrial club, House of Usher. Vietzke, coming from Portland, OR and having been a vocalist in many bands wanted to go into more of a dark and experimental style. Beebe, a CA native, has always been a guitarist in punk bands around the Sacramento, CA area and also wanted to move into more of dark edge. The two met through mutual friends and started working together with a bassist, keyboardist, and drummer. This lasted for about a year and went no were and finally Beebe and Vietzke decided to work on electronic music together to convey their beliefs of today&amp;#039;s society, hence, Holocaust Theory. The enigmatic sound of Holocaust Theory blends a unique array of mysterious synths, catastrophic percussion, disturbing samples, cold ominous soundscapes, and heavily treated vocals to take the listener into an apocalyptic nightmare. Beebe and Vietzke seem to combine every emotion felt into a genre that stands alone. Late 1996 brought the onslaught of Holocaust Theory&amp;#039;s live tyranny. After playing to an overwhelming response in Southern California, the duo began production of their CD, Proclaimed Visions, at the Eye Socket in Venice, CA with Chad Blinman of Ichor. After the great response to Proclaimed Visions, HT played some more CA shows in the spring of 1996 and then were asked to join the German NOISE bastard, Noisex, for the US Inferno Tour in summer 1996. This made Holocaust Theory a national act. The national response was tremendous and ties were made with the German label, Ant-Zen, and Noisex. After that tour, HT went back into the studio to work on their sophomore effort. In late summer of 1998, Inception of Eradication, was released. Again, an overall great media response was recieved and the band embarked on their first headlining national tour with LA locals, Jugend Staat and Imperative Reaction. That tour was a great success and then in winter of 1999 HT played their first show in Europe at the Noize Terror Festival in Waregem, Belgium with Noisex, Suicide Commando, Sonar, Stin Scatzor, and others. After returning home they returned to the US with Noisex and Sonar for the Noise Injection Tour in April 1999. The rest of 1999 shows Beebe and Vietzke taking a break from HT to work on their respective side-projects. Beebe&amp;#039;s being Savak and Vietzke&amp;#039;s being Zymosiz. A new HT release is anticipated for late spring of 2000. The music and the name Holocaust Theory, describes how Vietzke and Beebe feel about the plague known as humanity and the path that society has created for the generations to come. And with this is mind, Beebe and Vietzke feel there will be six phases of Holocaust known as Rain to cleanse the infection. And so, Proclaimed Visions has brought the first two phases of Rain. This is their theory of the Holocaust.\n","torrent":{"xt":"urn:btih:985ca4f09fe1dc0f59d6379eeffa86b1863a5682","amp;dn":"HOLOCAUST+THEORY+-+Inception+of+Eradication++%5B1998%5D+%5BINDUSTRIAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"985ca4f09fe1dc0f59d6379eeffa86b1863a5682","infoHashBuffer":{"type":"Buffer","data":[152,92,164,240,159,225,220,15,89,214,55,158,239,250,134,177,134,58,86,130]},"announce":[],"urlList":[]}}