{"title":"Poser Essentials","uid":4009022,"size":190702615,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:98fd6bff7ac2878e0da0748076f89f22587aa6af&amp;dn=Poser+Essentials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Kruell","files":9,"time":1201978334,"description":"This torrent holds a few files that I&amp;#039;ve found essential in creating great pieces.\n\n* Dendras Dungeon Construction Kit - Great for creepy halls and underground hallways.\n\n* Creature Creation Pack (with Bump Maps seperate) - This one has a lot of nifty things to make your normal figures turn into custom fantasy freaks.\n\n* Jepe&amp;#039;s &quot;Throwz, Steamz, and Flamez&quot; props - Honestly I&amp;#039;ve found these to be useful on multiple levels.  They are great for independent background effects and also great for adding a magical flair to your characters. \n\n* Castle Creator - A nice castle construction kit that has multiple towers, walls, buidlings, gates, ect that you can mix and match for your own castle complex.\n\n* Medieval City - This one is the base set of any medieval scene.  You can use the buildings individually or as groups but when building a town/city they certainly make a great resource.\n\n* Fantasy Creature Bundle - Not all of these creatures are great for all occasions but this bundle has enough versatility that its worth getting for the times when you need a creature.\n\nAs always, I urge you to purchase them from the vendor (http://www.daz3d.com for most) if you really find them useful.","torrent":{"xt":"urn:btih:98fd6bff7ac2878e0da0748076f89f22587aa6af","amp;dn":"Poser+Essentials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98fd6bff7ac2878e0da0748076f89f22587aa6af","infoHashBuffer":{"type":"Buffer","data":[152,253,107,255,122,194,135,142,13,160,116,128,118,248,159,34,88,122,166,175]},"announce":[],"urlList":[]}}