{"title":"Beau Brummels - The Best of The Beau Brummels 1964-1968","uid":3364990,"size":95263909,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:994a1faa76eab1882a3afe41464617dcd9859b05&amp;dn=Beau+Brummels+-+The+Best+of+The+Beau+Brummels+1964-1968&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"buzzard","files":21,"time":1123106070,"description":"The Best of the Beau Brummels: Golden Archive Series\n\nsize:       90.8 mb\nbitrate:    256\n\nThis 18-song collection has, amazingly, never been undercut for content or range in nearly two decades of release; it is probably due for an upgrade in sound quality as of 2005, and ought to serve as the guide to putting together a truly comprehensive double- or triple-CD set devoted to this San Francisco-based band, but it still holds up as either an introduction to, or survey of the band's history. Starting with the huge hits &quot;Laugh Laugh&quot; and &quot;Just a Little,&quot; it carries the listener up through the gorgeous yet unaccountably failed follow-ups &quot;Sad Little Girl&quot; and &quot;Don't Talk to Strangers&quot;; from there we go to a few of the highlights from the outtakes later issued by Vault Records, and into the group's studio years at Warner Bros. and some of the better tracks from Triangle and Bradley's Barn, as well as a handful of single sides and other rarities from the Warner Bros. vaults. Bill Inglot supervised the remixing from multi-track tapes of the songs for which usable masters couldn't be found, and he's kept the sound on those sides true to the originals. The annotation is very good as well, and is supported by great artwork. Casual listeners will probably love this CD, but after a few listens, they may join the serious fans in wishing that a more expansive survey of the Beau Brummels' work -- along the lines of Rhino's double-CD anthologies on the Association and the Turtles -- encompassing a deeper sampling of their two official Autumn Records albums and their outtakes, along with the hits and perhaps some of the better solo stuff from Ron Elliott and Sal Valentino, could be assembled.\n\nTrack Title\t\n1.Laugh Laugh\t \n2.Still In Love With You Baby\t \n3.They'll Make You Cry\t \n4.Just A Little\t \n5.You Tell Me Why\t \n6.Don't Talk To Strangers\t \n7.In Good Time\t \n8.When It Comes To Your Love\t \n9.Sad Little Girl\t \n10.Gentle Wandering Ways\t \n11.One Too Many Mornings\t \n12.Here We Are Again\t \n13.Fine With Me\t \n14.Don't Make Promises\t \n15.Two Days Till Tomorrow\t \n16.Magic Hollow\t \n17.Are You Happy\t \n18.Deep Water","torrent":{"xt":"urn:btih:994a1faa76eab1882a3afe41464617dcd9859b05","amp;dn":"Beau+Brummels+-+The+Best+of+The+Beau+Brummels+1964-1968","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"994a1faa76eab1882a3afe41464617dcd9859b05","infoHashBuffer":{"type":"Buffer","data":[153,74,31,170,118,234,177,136,42,58,254,65,70,70,23,220,217,133,155,5]},"announce":[],"urlList":[]}}