{"title":"Foreign Correspondent - 07.08.07 - Rendition, The Surge in Iraq,","uid":3769708,"size":288165888,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99690deacfb1a45204ea6273c96c170acbad8bd7&amp;dn=Foreign+Correspondent+-+07.08.07+-+Rendition%2C+The+Surge+in+Iraq%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"derrida","files":1,"time":1186791549,"description":"Italy - Rendition, CIA on Trial\n\nReporter: Josephine Cafagna\n\nIt was a normal Monday for radical Muslim cleric Hassan Mustafa Osama Nasr, better known as Abu Omar, as he walked to midday prayers at his local mosque in Milan. But as he passed the gardens in Via Guerzoni, Omar was suddenly grabbed by two men, bundled into a white van and transported to Egypt where he was imprisoned and allegedly tortured.\n\nAbu Omar had been under investigation by Milan?s Special prosecutor Amando Spataro and his team, who were about to lay terrorism charges against him. They had no idea that the CIA, in a practice known as &quot;extraordinary rendition&quot;, was planning to snatch him from under their noses.\n\n?If we use this instrument, this illegal instrument, this anti democratic instrument we give the terrorists other reasons to be terrorists&quot;, Prosecutor Spataro tells Cafagna.\n\nSpataro made his name successfully combating political corruption and the country?s home grown terrorists, the Red Brigades.\n\nNow, in a world-first, Spataro is putting the 26 CIA agents allegedly involved in the secret abduction, on trial.\n\nHis two year investigation has uncovered embarrassing details of the CIA operation.\n\nThe agents involved left behind a trail of evidence, maps and credit cards. They even used their frequent flyer numbers, and rented cars using their own licences.\n\nFor Claudio Fava, member of the European parliament and an expert on renditions this means one thing.\n\n?It means they know they have political protection.?\n\nJust how much protection they have is the talk of Milan. The trial is on hold while a higher court decides whether this case puts at risk secrets of state and the state of Italian/American relations.\n\n\nIraq - Inside the Surge\n\nReporter: Sean Smith\n\nFrom the covert battles of the so called war on terror ? to the overt battles being fought in Iraq.\n\nThe message from the US Generals in Iraq and the Bush White House is ?give the surge a chance?, but the anti war movement is growing, driven in a large part by the experiences of the troops serving there.\n\nApache Company?s tour of duty has been 14 months of daily combat. The ?surge? now means their stay is to be extended.\n\nStrung out, exhausted and scared they?re no longer willing to toe the line about the military planners and the politicians who are keeping them on the front line.\n\nAs one soldier states, ?I challenge the President to ride alongside me for another 15 months.?\n\n\nJapan - Hidden Christians\n\nReporter: Shane McLeod\n\nChristianity is not readily associated with Japan, a country where most follow the traditional beliefs of Shinto and Buddhism. It was introduced in the mid-1500s by Spanish missionaries, and flourished for fifty years until its popularity posed such a threat to Japan&amp;#039;s rulers it was outlawed.\n\nThose who continued to practise their faith became known as &quot;hidden Christians&quot;.\n\nDespite a long standing family tradition of secrecy, Ikitsuki islander Masaichi Kawasaki agreed to talk to reporter Shane McLeod about his faith.\n\nKawasaki tells McLeod ?I?ve been instructed by my parents to have the utmost respect because our God has been enshrined from generation to generation by my ancestors.?\n\nNow more a cult of ancestors than a religion, hidden Christians have survived on the Island of Ikitsuki through an alliance with Buddhists.\n\nBuddhist priests have turned a blind eye allowing islanders to ostensibly embrace Buddhism while remaining clandestine Christians. Buddhist priest Zuisho Matsuno says... ?they are serving as supporters of the Buddhist temple without discriminating against us. They co-operate with us. We don?t expel them or tell them to quit their faith.?\n\nShane McLeod also interviews Kazutoshi Kakimori a seventh generation hidden Christian who is on a personal crusade to win world heritage listing for various martyr sites. ?We have the responsibility to ensure the cultural heritage left from our ancestors is passed to the next generation. They risked their lives to leave their beliefs?, says Kakimori.\n\nWith the meaning of prayers and chants long lost Shane McLeod interviews Tokyo music detective Tatsuo Minagawa. After scouring libraries and museums in Europe Minagawa finally cracked the code. ?It was like a miracle my hands shivered. After seven years I found the sacred song called ?O?Gloriosa Domina? which praised the virgin Mary in the hymnal from the 16th century at a library in Spain.?\n\nTo add to the intrigue Tatsuo Minagawa suspects one of his ancestors, a powerful feudal lord killed hidden Christians with his sword. To atone for the sins of his forefathers Tatsuo Minagawa has converted to Christianity.\n\nAVI File Details\n========================================\nName.........: Foreign Correspondent - 07.08.07.avi\nFilesize.....: 274 MB (or 281,412 KB or 288,165,888 bytes)\nRuntime......: 00:35:27 (53,179 fr)\nVideo Codec..: XviD\nVideo Bitrate: 967 kb/s\nAudio Codec..: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 108 kb/s (54/ch, stereo) VBR LAME3.97\nFrame Size...: 608x352 (1.73:1) [=19:11]\n","torrent":{"xt":"urn:btih:99690deacfb1a45204ea6273c96c170acbad8bd7","amp;dn":"Foreign+Correspondent+-+07.08.07+-+Rendition%2C+The+Surge+in+Iraq%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99690deacfb1a45204ea6273c96c170acbad8bd7","infoHashBuffer":{"type":"Buffer","data":[153,105,13,234,207,177,164,82,4,234,98,115,201,108,23,10,203,173,139,215]},"announce":[],"urlList":[]}}