{"title":"Ben Jelen - Ex-Sensitive [2007]","uid":3991357,"size":75427456,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9978f299ddd5495959c47ce50d8e9ab5c51432e1&amp;dn=Ben+Jelen+-+Ex-Sensitive+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"torcano","files":13,"time":1201050581,"description":"by Jo-Ann Greene, Allmusic\n\nFrom the sitar swept intro of &quot;Pulse&quot; which opens Ex-Sensitive, it&amp;#039;s obvious that this album is far removed from Ben Jelen&amp;#039;s debut in sound and vision. If there were any lingering doubts, &quot;Where Do We Go&quot; wipes them away in a blaze of organ-drenched, guitar-ridden &amp;#039;60s pop. But that&amp;#039;s nothing compared to the rollicking, Small Faces flecked title track, with its storming rhythm and anthemic chorus. Of course, the multi-instrumentalist does play on this album, but his contributions are buried amid the prominent guitars and lavish organ, as well as Linda Perry&amp;#039;s lush productions. She has taken a singer/songwriter moping romantically around his piano and transformed him into an Everyman with a cause. OK, Jelen&amp;#039;s songs and universal themes made this metamorphosis possible, but it&amp;#039;s Perry who graces the set with an appealing richness and depth the artist was previously lacking. Jelen determinedly sets out to connect with each and every one of us, and help reconnect us to each other. &quot;Pulse&quot; sets the stage with the neo-mod &quot;Mr. Philosopher,&quot; and the equally upbeat and anthemic &quot;Just a Little&quot; explaining how. Even so, the singer doesn&amp;#039;t have all the answers, as the exuberant &quot;Where Do We Go&quot; makes clear, with Jelen&amp;#039;s inner doubts rising to the fore on the downbeat &quot;Not My Plan&quot; and the soul baring &quot;Vulnerable.&quot; Still, on &quot;Papa, Here I Go&quot; hope eventually overtakes desperation. Yet these inner tussles serve a greater cause: to find a solution for the ecological destruction of our planet. On the space age ballad &quot;Counting Down,&quot; David Bowie&amp;#039;s &quot;Starman&quot; is reinvented for the environmental age, while the title track takes a swipe at the &quot;lonely gadgets, brands and badges&quot; that litter our lives. The title of the loss filled &quot;Wreckage&quot; speaks eloquently for itself on one of the most powerful numbers here, while the soulful &quot;Other Side&quot; is a paean to mother earth masquerading as a love letter. The minimalistic &quot;What Have We Done&quot; closes the set on a bittersweet note as the blinkers drop from the eyes of mortal enemies, revealing visions of horror, and leaving behind emotional scars that will never truly heal. \n \n\n","torrent":{"xt":"urn:btih:9978f299ddd5495959c47ce50d8e9ab5c51432e1","amp;dn":"Ben+Jelen+-+Ex-Sensitive+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9978f299ddd5495959c47ce50d8e9ab5c51432e1","infoHashBuffer":{"type":"Buffer","data":[153,120,242,153,221,213,73,89,89,196,124,229,13,142,154,181,197,20,50,225]},"announce":[],"urlList":[]}}