{"title":"Blitz 3D SDK 1.0","uid":3935493,"size":12333559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99b46c7c3749bcf4e6f5501a60fced5765ef9457&amp;dn=Blitz+3D+SDK+1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"d-l33t3","files":2,"time":1197772485,"description":"Blitz 3D SDK\n\n&quot;Blitz3D SDK Released!\n\nNew Zealand software developers Blitz Research Ltd have today released the Blitz3D Software Development Kit for Windows game developers.\n\nThe package consists of a runtime library of over 300 commands that simplify the process of creating video games with computer languages such as Microsoft&amp;#039;s Visual Studio Express C# or C++ editions, the free DevC++ environment from Bloodshed or alternatively languages such as PureBasic and Blitz Research&amp;#039;s own next generation BASIC compiler BlitzMax.\n\nExtensive documentation based on the recently published Blitz3D Programming Manual is included covering the wealth of graphics, geometry, media and input commands available in the Blitz3DSDK environment.\n\nWith a wide range of file formats built in and an ever growing array of tools, plug-ins, and success stories Blitz Research looks forward to fostering continued growth of the independent game development community with their industry proven technology and support.\n\nAbout Blitz Research\n\nBlitz Research Limited is owned and operated in New Zealand by Mark Sibly, a provider of programming tools to friends and industry for more than 25 years.\n\nAbout Blitz3D\n\nBlitz3D has been the chosen development environment for a growing user-base of imagination rich game developers since its initial release in 2001.&quot;\n\n\n\nExtract the rar and read the &quot;readme&quot; file for instructions on how to set up.\n\nEnjoy.\n\nD-L33T3","torrent":{"xt":"urn:btih:99b46c7c3749bcf4e6f5501a60fced5765ef9457","amp;dn":"Blitz+3D+SDK+1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99b46c7c3749bcf4e6f5501a60fced5765ef9457","infoHashBuffer":{"type":"Buffer","data":[153,180,108,124,55,73,188,244,230,245,80,26,96,252,237,87,101,239,148,87]},"announce":[],"urlList":[]}}