{"title":"Portable Winamp Pro 5.51","uid":3966739,"size":8877881,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99ed0109cbb4da68ee5ef7e5f93fbcddb14d743b&amp;dn=Portable+Winamp+Pro+5.51&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fillous","files":1,"time":1199775857,"description":"Portable of Winamp&amp;#039;s last version that was released on December 20\n\nA flexible and sophisticated application for playing and managing your music\n\nWinamp is more than just a player. It&amp;#039;s your window to the multimedia world. From MP3s to streaming video, Winamp is the one place you go to feed your audio/video habit.\n\nSome key features of Winamp\nÃ‚Â· Winamp can use both Modern and Classic skins, so you can be both hip and retro at the same time.\nÃ‚Â· Winamp gives you easy and organized access to your favorite media. That&amp;#039;s what you call mass media\nÃ‚Â· Winamp can play a huge variety of audio and video formats right out of the box... err... out of the installation.\nÃ‚Â· You get access to hundreds of free audio and video channels in the Media Library. This ain&amp;#039;t your father&amp;#039;s library.\nÃ‚Â· Winamp can burn your music to CDs.\nÃ‚Â· Winamp makes it easy to create and manage your favorite songs through playlists. Yes, you can be your own DJ.\nÃ‚Â· Winamp allows you to extend it&amp;#039;s functionality through the use of &quot;plug-ins&quot; Its like the Mr. Potato Head of music.\nÃ‚Â· Winamp will allow you to alter the sound of your music through a built-in Equalizer. An audio receiver right on your PC.\nÃ‚Â· Winamp allows you to watch visual effects that are driven from your music with Visualizations. From flaming fireballs to screaming strobe effects, its all there.\n\n\nWinamp Main Window\nÃ‚Â· Winamp 5 features our new Modern Skin that&amp;#039;s easier to use and more powerful than ever\nÃ‚Â· Easily access the Media Library (ML), Playlist Editor (PL), integrated Video\nor Visualizations (Video/Vis Drawer), or the EQ, Skin Options, and Color Themes (Config Drawer) from the Main Window\nÃ‚Â· Includes over 50 color themes that suit nearly every mood or occasion!\nÃ‚Â· Winamp 5 carries forward the unobtrusive &quot;Window Shade&quot;\n\nWinamp Video\nÃ‚Â· Play many major video formats (NSV, WMV, MPG, etc.) with ease\nÃ‚Â· Easily resize video playback using the 1x, 2x, and Maximize window buttons\nÃ‚Â· Watch your favorite videos in Full Screen mode\nÃ‚Â· Quick access to dozens of Internet TV stations created by users\nÃ‚Â· Detach the video window from the main player\n\nNew in Winamp 5.51\n* A Completely Redesigned Interface, including Album Art\n* Multiple device support, including iPods\n* Access and Share Your Music and Videos with Winamp Remote\n* Play and Playlist the Best Music on the Web with Media Monitor\n* Get Artist &amp; Concert News, Videos &amp; more with Smart Search\n* Enjoy Dynamic Song Recommendations\n* Experience MP3 Surround Sound Support\n* Access to Thousands of Online Radio Stations, Videos and More!\n* Auto-Tagger provides automatic updates to file information\n* Control Winamp From Your Browser with the Winamp Toolbar","torrent":{"xt":"urn:btih:99ed0109cbb4da68ee5ef7e5f93fbcddb14d743b","amp;dn":"Portable+Winamp+Pro+5.51","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ed0109cbb4da68ee5ef7e5f93fbcddb14d743b","infoHashBuffer":{"type":"Buffer","data":[153,237,1,9,203,180,218,104,238,94,247,229,249,63,188,221,177,77,116,59]},"announce":[],"urlList":[]}}