{"title":"Resize Pictures Plus v1.1","uid":3761700,"size":3797556,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9a5ecf6ce3b163c4e4e99ca9f32dd233e7539cc7&amp;dn=Resize+Pictures+Plus+v1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"sphx2006","files":1,"time":1186160326,"description":"With Resize Pictures Plus You can resize, watermark, rename and optimizes your pictures, photos or images in batch mode.\n\nTodays digital cameras shoot large-sized images. This is great for making prints,but it is a bad thing when youre sharing images. You dont want to bog down someones e-mail, for instance, with oversized files. Plus, many e-mail programs wont send or receive large files. If you are posting the images to the Web, it will take too long to load and look weird in its original size.\n\nResize Pictures Plus graphics suite is an easy to use program that resize, watermark, rename and optimizes pictures and images to make them more suitable for email or publishing on blog and forum.\n\n\nKey Features:\n\n-------------\n\nSelect and process pictures in batch mode.\n\nAllows you to force a specified width or height and keep the\n\nproportions, or define fixed picture dimensions.\n\nView, add and remove pictures in a list with sorting features.\n\nAdd watermark and rename your pictures at once.\n\nAfter processed, the Jpg EXIF and Tiff Tags can not been lost.\n\nKeep file creating date time.\n\nDirect contrast between original picture and processed picture on the same screen.\n\nProvides 40+ graphics formats and saving into 7 most popular formats.\n\nSaving into true color, 256 colors or gray scale.\n\nYou can drag any pictures in Windows explorer and drop them the main window.\n\nAutomatically save your latest settings on exit.\n\nModify picture in built-in editor.\n","torrent":{"xt":"urn:btih:9a5ecf6ce3b163c4e4e99ca9f32dd233e7539cc7","amp;dn":"Resize+Pictures+Plus+v1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a5ecf6ce3b163c4e4e99ca9f32dd233e7539cc7","infoHashBuffer":{"type":"Buffer","data":[154,94,207,108,227,177,99,196,228,233,156,169,243,45,210,51,231,83,156,199]},"announce":[],"urlList":[]}}