{"title":"The Killing of Kashmir","uid":3353165,"size":371700202,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9abe4c26d5ad23d3a8df4d183d1095b37869edb2&amp;dn=The+Killing+of+Kashmir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kashmiri","files":1,"time":1120731249,"description":"he Killing of Kashmir  \t\n\tUnreported World \t\n\t\n\n\nPublished: 08-Apr-2004\nBy: Channel 4 \t\n\t\n\n\nReporter Sandra Jordan and producer Rodrigo Vazquez travel to the disputed state of Kashmir to reveal what life is like for civilians caught up in the vicious circle of violence between the Indian army and pro-Pakistani militants \t\n\t\n\nUnreported World: Killing of Kashmir broadcasts on Channel 4 at 9pm April 8, 2004.\n\n\n\nThis is a special hour-long 9pm edition of Unreported World which launches a new run of this critically-acclaimed series\n\n\n\nMore than 60,000 people, mostly innocent civilians, have died in the 15-year conflict. Half a million Indian troops are stationed in Kashmir, fighting Pakistani-funded militants who slip across the border to attack the troops but also to terrorise the local population into giving them shelter and assistance.\n\n\n\nWhile both governments talk of peace, Unreported World reveals that, on the ground, very little has changed. For the local villagers life is a cycle of militant violence and government repression.\n\n\n\nThe team arrive in Srinagar to find Indian police have just violently beaten a group of women who are protesting about the detention of two men and a woman for alleged links to pro-Pakistan militants.\n\n\n\nTwo sisters tell Jordan that around 25 masked troops from a Special Operations Group had burst in through the window and grabbed their father, mother and uncle. The children are terrified that their parents may join the 8,000 people who international human rights groups say have &quot;disappeared&quot; after being taken away by the security forces over the last 15 years.\n\n\n\nAfter a long wait outside the local police station, only the mother is released. She has been badly beaten and is on the edge of unconsciousness. She reveals that she had seen her husband in custody and that he had been badly tortured.\n\n\n\nTwo days later, the team find out that there is a shootout going on between the security forces and militants in a house in Srinagar. They arrive to find that after four hours the police and army have killed two leaders of the militant groups.\n\n\n\nThe army say that after finding out that the militants were hiding in the house, they got the civilians out and then a firefight started after they tried to search the house, resulting in the deaths of the two men.\n\n\n\nLocal eye-witnesses, including the owners of the house, tell Unreported World a different story. They say that early that morning the security forces had arrived and told them to get out of their house.\n\n\n\nHalf an hour later, soldiers brought the two men to the house, put them in a room and then executed them. The security forces stand by their version of events, but staged shootouts, say human rights groups, are commonplace.\n\n\n\nJordan and Vazquez then travel to the front line between India and Pakistan to see what life is like for the local villagers caught between the militants and the army.\n\n\n\nIn the remote village of Panar, where an encounter between the army and militants had taken place on the previous day, villagers tell them that following the death of a militant, the army had taken away two old men simply because their houses were closest to the gun battle.\n\n\n\nThey tell Jordan that the security forces regularly come to the village and torture them. They are also terrified of the militants who take revenge on the local population following shootouts.\n\n\n\nBack in Srinagar, the security forces are rounding up people in advance of Indian Republic Day. Four young men have been taken away and the Unreported World team go to the local barracks to see if they can find out what's happened to them, but the police deny holding them.\n\n\n\nAfter several days, the four men are released without charge. 17-year-old Naseer tells Jordan that they were severely beaten before being tortured using electric shock equipment. He thought he would die and had been told by his captors that they would stage an encounter to kill him.\n\n\n\nThe team end their journey in the home village of one of the militant commanders killed in the four-hour shoot-out. When his body arrives for burial the entire village turns out to greet him as a martyr. Another day of agony begins for the people of Kashmir.\n\n\n\nUnreported World: Killing of Kashmir broadcasts on Channel 4 at 9pm April 8, 2004.","torrent":{"xt":"urn:btih:9abe4c26d5ad23d3a8df4d183d1095b37869edb2","amp;dn":"The+Killing+of+Kashmir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9abe4c26d5ad23d3a8df4d183d1095b37869edb2","infoHashBuffer":{"type":"Buffer","data":[154,190,76,38,213,173,35,211,168,223,77,24,61,16,149,179,120,105,237,178]},"announce":[],"urlList":[]}}