{"title":"[Audiobook] Sandra Day O'Connor - The Majesty of the Law","uid":3967604,"size":741007967,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9b77ab14acc72ad430bc56e2faeeea1ebdce27bb&amp;dn=%5BAudiobook%5D+Sandra+Day+O%5C%27Connor+-+The+Majesty+of+the+Law&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rjeong","files":8,"time":1199825590,"description":"Please seed me!\n\nSandra Day O&amp;#039;Connor, The Majesty of the Law - 8 Discs &lt;a href=&quot;\nhttp://www.amazon.com/Majesty-Law-Reflections-Supreme-Justice/dp/0739302450&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Majesty-Law-Reflections-Supreme-Justice/dp/0739302450&lt;/a&gt;\n\nO&amp;#039;Connor, veteran associate justice of the U.S. Supreme Court, distills in this book the scores of talks she has given across the country and around the world in the 20 years since her accession to the high court. O&amp;#039;Connor, the author of the bestselling memoir Lazy B, is an enthusiast of the American legal system, reaching back to its origins in the Magna Carta and, later, in the English Privy Council, with its power to invalidate legislation. Declaring federal and state laws unconstitutional, of course, is the core of the Supreme Court&amp;#039;s authority over this country&amp;#039;s legal system, and O&amp;#039;Connor traces the exercise of that authority from the era of Chief Justice John Marshall to Brown v. Board of Education. In other chapters, O&amp;#039;Connor profiles Supreme Court titans such as Holmes and Taft, and reviews the long struggle to gain for women the right to vote. Elsewhere, the author suggests reforms for the jury system, extols the benefits of an independent judiciary and offers a graceful tribute to Justice Thurgood Marshall. Canons of ethics prohibit judges from public comment on controversial matters likely to arise in their future cases, and a Supreme Court justice cannot reveal the dynamics of the Court&amp;#039;s deliberations. These rules of discretion pervade O&amp;#039;Connor&amp;#039;s book. Divisive (and provocative) issues such as abortion, the death penalty or affirmative action are addressed only in the broadest possible generalities. Purged of controversy, O&amp;#039;Connor&amp;#039;s book is an engagingly written civics lesson, delivering a warm appreciation of legal history and principles but little light on the issues the Supreme Court confronts today.\n\naudio\naudiobook","torrent":{"xt":"urn:btih:9b77ab14acc72ad430bc56e2faeeea1ebdce27bb","amp;dn":"%5BAudiobook%5D+Sandra+Day+O%5C%27Connor+-+The+Majesty+of+the+Law","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b77ab14acc72ad430bc56e2faeeea1ebdce27bb","infoHashBuffer":{"type":"Buffer","data":[155,119,171,20,172,199,42,212,48,188,86,226,250,238,234,30,189,206,39,187]},"announce":[],"urlList":[]}}