{"title":"Mobilfunkkrieg.2008.German.Doku.dTV.XviD-MYR","uid":4004920,"size":238150553,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9d200ac10d0fc5a443569aa689ee7006bc25032d&amp;dn=Mobilfunkkrieg.2008.German.Doku.dTV.XviD-MYR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Muy-Yen","files":3,"time":1201776487,"description":"Mobilfunkkrieg - Der Kampf um die Masten\n\n\nEine Familie verlaesst ihr Haus, ein Unternehmer schlaeft nur noch im Keller, eine Physiotherapeutin laesst die Waende ihrer Praxis mit Metallgittern abschirmen: Die Angst vor Mobilfunkstrahlung ist allgegenwaertig - und waechst mit der zunehmenden Zahl der Sendeanlagen. Schon jetzt gibt es in Sachsen mehr als 3.100.\nIn der Naehe der Masten leiden Anwohner unter Schlafstoerungen, verlieren den Appetit, selbst Wachstumsstoerungen bei Kindern gaebe es, so die Bamberger Aerztin Dr. Waldmann-Selsam. Als sie ueber ihre Erfahrungen mit den Mobilfunkmasten berichtet, sind die Buerger erschuettert, werden spontan zu Unterstuetzern der Mobilfunkgegner. &quot;Der Mast muss weg!&quot; ist ihr Schlachtruf. Die Buerger machen Front, egal ob in Maxen, Struppen, Liegau-Augustusbad oder Limbach-Oberfrohna.\nEine Buergerinitiative haben auch die Einwohner von Morgenroethe-Rautenkranz gegruendet. Ihr Wunsch: Der Mast muss her! Sie haben es satt, noch immer nicht mobil telefonieren zu koennen. Kein Notdienst ist erreichbar, wenn unterwegs etwas passiert, kein Chef kann seine Arbeiter vor Ort anrufen, wenn sich deren Aufgabe aendert. Die Morgenroether glauben den Worten der Mobilfunkanbieter, dass es keine Gefahr gaebe, die Wellen ungefaehrlich seien.","torrent":{"xt":"urn:btih:9d200ac10d0fc5a443569aa689ee7006bc25032d","amp;dn":"Mobilfunkkrieg.2008.German.Doku.dTV.XviD-MYR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d200ac10d0fc5a443569aa689ee7006bc25032d","infoHashBuffer":{"type":"Buffer","data":[157,32,10,193,13,15,197,164,67,86,154,166,137,238,112,6,188,37,3,45]},"announce":[],"urlList":[]}}