{"title":"Shadows Of Time","uid":3985294,"size":734777344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9d711580804c0a44a5734a64a7dbe89479d23af0&amp;dn=Shadows+Of+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mainak1985","files":1,"time":1200777727,"description":"Shadows of Time\nSchatten der Zeit (Germany)\nBy DEREK ELLEY\nA Diana Film, Fanes Film production, in association with CP Medien and Mondragon Films. (International sales: Bavaria Film Intl., Munich.) Produced by Helmut Dietl, Norbert Preuss. Directed, written by Florian Gallenburger. Associate director, Amit Kumar.\n \nYoung Masha - Tumpa Das\nYoung Ravi - Sikandar Agarwal\nAdult Masha - Tannishtha Chatterjee\nAdult Ravi - Prashant Narayanan\nOld Masha - Sova Sen\nOld Ravi - Soumitra Chatterjee\nDeepa - Tillotama Shome\nYani Mishra - Irrfan Khan\nDeepa\\\\\\&amp;#039;s\nGrandfather - Satya Bandopadhyaya\nManager - Biplab Dasgupta\n \nA sumptuously shot slice of Asian melodrama served up in a stylishly refined way, \\\\\\&quot;Shadows of Time\\\\\\&quot; reps a real treat for romantics anywhere. Directed, written and key-crewed by Germans but Indian in every other respect, film seamlessly blends European and South Asian aesthetics in a story of love and regret spanned across 60 years. With no international stars attached, this impressive first feature by Florian Gallenberger (known for the Oscar winning short, \\\\\\&quot;Quiero Ser\\\\\\&quot;) will need careful nursing to find a market, though further festival exposure could help. Audience reaction at its Toronto world preem was warm.\n\nOpening, with the elderly Ravi (vet Soumitra Chatterjee) driving across a parched landscape to an abandoned carpet factory, sets up the sense of a long-limbed drama about to unfold. Throughout, the resonant widescreen lensing by ace German d.p. Juergen Juerges, with its deep ochres, red and blacks and its play with light and shadow, is a full partner in the action.\n\nStory flashbacks to the early 1940s, with Ravi Gupta (Sikandar Agarwal) a child laborer in the factory, squirreling away his paltry earnings and standing up for himself against the hard-nosed manager (Biplab Dasgupta). Ravi befriends a girl his own age, Masha (Tumpa Das), who\\\\\\&amp;#039;s been sold to the factory by her penniless father, and when a rich man visits and makes an offer for her, Ravi unsuccessfully tries to match the bid. He subsequently gives Masha money to escape, and she promises to wait for him every full moon at the biggest temple of Shiva in Calcutta, giving him her necklace to remember her by.\n\nThough all the exploitative conditions of child labor are up on the screen, pic never lets its main story become sidetracked by any social sermonizing. And with no datelines or references to outside events, the whole film exists in a temporal vacuum that keeps the focus tight on the central relationships.\n\nYears later, the adult Ravi (Prashant Narayanan) buys his own freedom and sets out for Calcutta. He begins working for an old carpet seller (Satya Bandopadhyaya) and his pretty granddaughter, Deepa (Tillotama Shome), who takes a shine to him. Hereon, the plot begins to seriously thicken, as chance and fate play roles in a way typical of Asian melodrama.\n\nMasha has become a professional courtesan (Tannishtha Chatterjee), romanced by a customs officer, Yani (Irrfan Khan). In an emotionally powerful, beautifully mounted sequence an hour in, Ravi and Masha almost meet at the Shiva temple one night but are separated by the chance arrival of Deepa. The lost opportunity arising from that moment fuels the rest of the picture, as Masha, thinking Ravi is married, decides to marry Yani, and Ravi, thinking Masha has forgotten him, finally marries Deepa.\n\nGallenberger\\\\\\&amp;#039;s script is unusually lean and focused, with characters straightforward in their emotions and -- unlike mainstream Indian melodrama -- plotting not reliant on lingering misunderstandings. After Ravi and Masha finally meet (at a posh dinner) and realize the truth, film becomes an increasingly mellow reverie on lost happiness. Coda, back in the present, is quietly moving.\n\nCasting is acute at every level, from Agarwal and Das as the two youths to Keralan thesp Narayanan as the handsome, adult Ravi. Shome is especially good as the patient Deepa, who knows she\\\\\\&amp;#039;s second choice in her husband\\\\\\&amp;#039;s affections. Only Tannishtha Chatterjee fails to carve out a fully formed character, as the adult Masha.\nMore than one option\n\n    * (Person) Irfan Khan\n    * (Person) Irrfan Khan\n\nCamera (color, widescreen), Juergen Juerges; editor, Hansjoerg Weissbrich; music, Gert Wilden Jr.; production designer, Amardeep Behl; art directors, T.P. Abid, Gautam Rajiv; costume designer, Lisy Christl; make-up, Lena Lazarotto, Heike Merker, Margrit Neufink, Waldemar Pokromski; sound (Dolby Digital), Frank Heidbrink, Tschangis Chahrokh-Zadeh; associate producers, Dieter Meyer, Roland Pellegrino; assistant directors, Deepika Gandhi, Andi Lang, Hanus Polak Jr.; casting, Dilip Shankar. Reviewed at Toronto Film Festival (Special Presentations), Sept. 12, 2004. Running time: 121 MIN.\n \n\nWith: Debika Sinha, Barun Chakraborty, Kumar Chakraborty, Shyamal Bhattacharya, Ashish Mukherjee.\n(Bengali dialogue)\n \n\nVariety is striving to present the most thorough review database. To report inaccuracies in review credits, please click here. We do not currently list below-the-line credits, although we hope to include them in the future. Please note we may not respond to every suggestion. ","torrent":{"xt":"urn:btih:9d711580804c0a44a5734a64a7dbe89479d23af0","amp;dn":"Shadows+Of+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d711580804c0a44a5734a64a7dbe89479d23af0","infoHashBuffer":{"type":"Buffer","data":[157,113,21,128,128,76,10,68,165,115,74,100,167,219,232,148,121,210,58,240]},"announce":[],"urlList":[]}}