{"title":"Fraps 2.6.4 - Retail","uid":3371792,"size":5286422,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9dda1c0df18bbfb244d5d711f6a0660cb002dd13&amp;dn=Fraps+2.6.4+-+Retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sparkz","files":5,"time":1124446164,"description":"Fraps is a universal Windows application that can be used with all games\nusing DirectX or OpenGL technology. In its current form Fraps performs\nmanytasks and can best be described as:\n  \nBenchmarking Software - See how many Frames Per Second (FPS) you are\ngetting in a corner of your screen. Perform custom benchmarks and\nmeasurethe frame rate between any two points. Save the statistics out to\ndisk and use them for your own reviews and applications.\n  \nScreen Capture Software - Take a screenshot with the press of a key!\nThere's no need to paste into a paint program every time you want to\ncapture the screen. Your screen captures are also automatically named and\ntimestamped.\n  \nRealtime Video Capture Software - Have you ever wanted to record video\nwhile playing your favourite game? Come join the Machinima revolution!\nThrow away the VCR, forget about using a DV cam, game recording has never\nbeen this easy! Fraps can capture audio and video up to 1152x864 at 60\nframes per second!\n\n2.6.4 - 15th Aug 2005\n- Fixed custom movie fps reverting to 29.97 after multiple restarts\n- Fixed sound not being captured in all movies under Windows 2000 \n- Fixed error message when running Fraps under limited user account\n- Fixed settings not being saved for limited users\n- Fixed Risk Your Life and Lineage 2 not capturing for some users\n- Added warning message if Direct3D debug runtime active\n- Installer will now update codec if it's being used at the time","torrent":{"xt":"urn:btih:9dda1c0df18bbfb244d5d711f6a0660cb002dd13","amp;dn":"Fraps+2.6.4+-+Retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dda1c0df18bbfb244d5d711f6a0660cb002dd13","infoHashBuffer":{"type":"Buffer","data":[157,218,28,13,241,139,191,178,68,213,215,17,246,160,102,12,176,2,221,19]},"announce":[],"urlList":[]}}