{"title":"Anonymous message to Scientology [EPIC]","uid":3989135,"size":4304896,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9fb1ad140928b5e85309ec1815220f4fac025178&amp;dn=Anonymous+message+to+Scientology+%5BEPIC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tomcruise2","files":1,"time":1200954080,"description":"Source:\n\nHello, Scientology. We are Anonymous.\n\nOver the years, we have been watching you. Your campaigns of misinformation; suppression of dissent; your litigious nature, all of these things have caught our eye. With the leakage of your latest propaganda video into mainstream circulation, the extent of your malign influence over those who trust you, who call you leader, has been made clear to us. Anonymous has therefore decided that your organization should be destroyed. For the good of your followers, for the good of mankind--for the laughs--we shall expel you from the Internet and systematically dismantle the Church of Scientology in its present form. We acknowledge you as a serious opponent, and we are prepared for a long, long campaign. You will not prevail forever against the angry masses of the body politic. Your methods, hypocrisy, and the artlessness of your organization have sounded its death knell.\n\nYou cannot hide; we are everywhere.\n\nWe cannot die; we are forever. We're getting bigger every day--and solely by the force of our ideas, malicious and hostile as they often are. If you want another name for your opponent, then call us Legion, for we are many.\n\nYet for all that we are not as monstrous as you are; still our methods are a parallel to your own. Doubtless you will use the Anon's actions as an example of the persecution you have so long warned your followers would come; this is acceptable. In fact, it is encouraged. We are your SPs.\n\nGradually as we merge our pulse with that of your &quot;Church&quot;, the suppression of your followers will become increasingly difficult to maintain. Believers will wake, and see that salvation has no price. They will know that the stress, the frustration that they feel is not something that may be blamed upon Anonymous. No--they will see that it stems from a source far closer to each. Yes, we are SPs. But the sum of suppression we could ever muster is eclipsed by that of the RTC.\n\nKnowledge is free.\n\nWe are Anonymous.\n\nWe are Legion.\n\nWe do not forgive.\n\nWE DO NOT FORGET.\n\nExpect us.","torrent":{"xt":"urn:btih:9fb1ad140928b5e85309ec1815220f4fac025178","amp;dn":"Anonymous+message+to+Scientology+%5BEPIC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fb1ad140928b5e85309ec1815220f4fac025178","infoHashBuffer":{"type":"Buffer","data":[159,177,173,20,9,40,181,232,83,9,236,24,21,34,15,79,172,2,81,120]},"announce":[],"urlList":[]}}