{"title":"Dr. Gene Scott Lectures - More Mysteries","uid":3879355,"size":155843545,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a02a110a91e04d7a29d94c0e20e7616f3a1b0247&amp;dn=Dr.+Gene+Scott+Lectures+-+More+Mysteries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aaronhahn777","files":20,"time":1194579678,"description":"DR. GENE SCOTT&amp;#039;S LECTURES\n\n     --More Mysteries (more random lectures will follow)\n\nThis torrent is a CD RIP of a some of Dr. Gene Scott&amp;#039;s random lectures.  But if you like his stuff, his case study on the Resurrection of Jesus Christ is one that all should hear. Enjoy!\n\n\nSome History:\n\nIn 1975, Scott began a series of broadcasts, which resulted in the creation of the University Network. By 1983, the University Network was broadcasting his sermons twenty-four hours a day via satellite to the United States and Canada, as well as to much of Mexico and the Caribbean.\n\nBy 1990, his network was available to 180 countries, and by 1992 his sermons were being broadcast in several languages on AM, FM, and short-wave radio. His programming consisted of his trademark informal style of Bible teaching mixed with provocative commentary, music, and personal interests in such diverse subjects as his paintings, scientific interpretations of the great wonders of the world, and his American saddle-bred horses.\n\nBefore Gene Scott died, many of his lectures were freely available at his website DrGeneScott.com. Immediately after his death, his wife Melissa took over all the operations of the church and removed all recordings of Gene Scott&amp;#039;s lectures from public availability. Not only were the free online lectures were removed, but Melissa also ordered thousands of cassette tape recordings of Dr. Scott&amp;#039;s teachings to be permanently removed from circulation so that no one would ever hear them again (written by another seeder).\n\nGene Scott himself warned that once he died, those who took over the church would destroy his entire life work. This was because his teachings frequently went into territory far beyond what one would normally expect from an ostensibly &quot;Christian&quot; preacher. Indeed, he spent much time educating his listeners on subjects which were highly politically sensitive even to this day, and he knew that only he himself could guarantee the continued availability of his teachings (written by another seeder).\n\n\n\nPlease seed the works of Gene Scott. More torrents will follow! \n\n\nI have several box sets of his works.  Although, ripping them from tape takes time.  The following lectures will all be shared!\n\n\n     -Demonology\n\n     -The Lost Tribes\n\n     -UFOs\n\n     -Atlantis\n\n     -The Stars\n\n     -Pyramids\n\n     -Revelations\n\n     -The Bible and Church History\n\n     -Jesus Christ:  Super-Nut or Super-Natural\n\n     -The Resurrection      (the best one in my opinion)\n\n\nENJOY","torrent":{"xt":"urn:btih:a02a110a91e04d7a29d94c0e20e7616f3a1b0247","amp;dn":"Dr.+Gene+Scott+Lectures+-+More+Mysteries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a02a110a91e04d7a29d94c0e20e7616f3a1b0247","infoHashBuffer":{"type":"Buffer","data":[160,42,17,10,145,224,77,122,41,217,76,14,32,231,97,111,58,27,2,71]},"announce":[],"urlList":[]}}