{"title":"The Band ~ Jericho","uid":3968395,"size":138404093,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a04013dc3d324f1c43599a239f890a247b36438c&amp;dn=The+Band+%7E+Jericho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":14,"time":1199869529,"description":"To me this is a classic Band album. Although Robbie isn&amp;#039;t in the foold, the Band proved they have what it takes to produce long term memorable replayable classics, even if some of them are covers....this is now my favourite Band album over &amp; above their classics, and Last Waltz...&amp; as a further credit here is the AMG review that reinforces this:-\nFew bands called it quits with more fanfare than the Band when they bowed out with the 1976 all-star concert famously preserved in LP and movie form as The Last Waltz. However, while guitarist, songwriter, and de facto leader Robbie Robertson may have been ready to retire the Band, it soon became clear that the other members of the group didn&amp;#039;t feel the same way (especially Levon Helm and Rick Danko), and by 1982 a Robertson-less lineup had hit the road. While new recordings were planned, it wasn&amp;#039;t until 1993, seven years after Richard Manuel was found dead in a Florida motel room, that a new album appeared from the Band, and while Jericho lacks the mythic resonance of their greatest work, it did unexpectedly prove that the Band could function very well without Robertson. While Jim Weider isn&amp;#039;t as sharp a guitarist as Robertson and his input as a songwriter is also missed, Garth Hudson&amp;#039;s epic keyboard arrangements, the lovely ache of Rick Danko&amp;#039;s vocals, and especially Levon Helm&amp;#039;s raw, soulful singing (as well as his drumming and mandolin work) still define this as the music of the Band. The material lacks the thematic reach of the Band&amp;#039;s strongest period, but &quot;The Caves of Jericho&quot; (written by Helm with Richard Bell and John Simon) shows they can come up with worthy songs on their own, and covers of Bob Dylan&amp;#039;s &quot;Blind Willie McTell&quot; and Bruce Springsteen&amp;#039;s &quot;Atlantic City&quot; are superb choices (especially the latter, with Helm&amp;#039;s vocals an unlikely but fine fit). And while the post-Robertson touring version of the Band seemed more interested in boogie than substance, there&amp;#039;s no denying good-time numbers like &quot;Remedy,&quot; &quot;Stuff You Gotta Watch,&quot; and the gloriously weird &quot;Move to Japan&quot; make with the good groove. The addition of an unreleased Richard Manuel performance may seemed a bit ghoulish, but his take on &quot;Country Boy&quot; sounds fine and is a bittersweet tribute to his talents. Jericho may pale in comparison to such masterworks as Music from Big Pink and The Band, but there&amp;#039;s little denying it&amp;#039;s a stronger and more committed work than Islands or the studio side of The Last Waltz, showing this group still had something to offer besides hippie nostalgia.\n\nI&amp;#039;ve included the original cover with tracks, but the back cover is my own creation....hope it suits as I don&amp;#039;t own the original album...shame\nplease seed as long as possible friends\n\ncheers GazzJazz","torrent":{"xt":"urn:btih:a04013dc3d324f1c43599a239f890a247b36438c","amp;dn":"The+Band+%7E+Jericho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a04013dc3d324f1c43599a239f890a247b36438c","infoHashBuffer":{"type":"Buffer","data":[160,64,19,220,61,50,79,28,67,89,154,35,159,137,10,36,123,54,67,140]},"announce":[],"urlList":[]}}