{"title":"Center Stage","uid":4006806,"size":4639358976,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a06098e3623a8aceb0d4f71c500d23e9ffff08ba&amp;dn=Center+Stage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"suku","files":42,"time":1201875957,"description":"&quot;Center Stage&quot; is an intimate look into the education of three young students, Jodie, Eva and Maureen, as they study at the American Ballet Academy. Life isn&amp;#039;t what they expected at the esteemed ABC, and all three face problems along the road. Jodie doesn&amp;#039;t have the &quot;ideal&quot; body for dancing, Eva doesn&amp;#039;t have the right attitude, and Maureen doesn&amp;#039;t have the heart. Along the way, they learn that love can be found in unlikely places, and dancing should be a passion, not a duty.  Written by the lexster\n\nAfter auditions, 12 young dancers make it to the American Ballet Academy. They&amp;#039;ll prepare for the student showcase to determine who will be asked to join the American Ballet Company. Tensions mount between Jonathan, the company&amp;#039;s aging choreographer, and Cooper, his best dancer, who also wants to choreograph. The brilliant Maureen seems poised for success, but she discovers that life is passing her by. Jody, whose body may be the wrong type and whose technique is ragged, elicits Cooper&amp;#039;s interest. The edgy, smart-mouthed Eva loves to dance but seems destined to be stuck in the back of the chorus. The showcase will decide their fates.\n\nAudio Spanish,English\nSub Spanish,English","torrent":{"xt":"urn:btih:a06098e3623a8aceb0d4f71c500d23e9ffff08ba","amp;dn":"Center+Stage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a06098e3623a8aceb0d4f71c500d23e9ffff08ba","infoHashBuffer":{"type":"Buffer","data":[160,96,152,227,98,58,138,206,176,212,247,28,80,13,35,233,255,255,8,186]},"announce":[],"urlList":[]}}