{"title":"Wonder Woman v1 pt4 186-254 ('70-'79)(Catseye2001) [h33t]","uid":4002418,"size":1207005009,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a15090d7e514cb44339bb256da46d2a5f1684708&amp;dn=Wonder+Woman+v1+pt4+186-254+%28%5C%2770-%5C%2779%29%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Catseye2001","files":70,"time":1201640216,"description":"Part 4 of the Wonder Woman v1 torrent. Issues 186-254 (1970-1979).  I ran into a snag here--as I was checking files, I discovered that my issues 255-259 were bad, so I ended this part earlier than anticipated. Issue #254 is actually from April of 1979, and my next torrent will start with issue #260, which is Oct &amp;#039;79.  If anyone has good copies of the 5 missing issues, I&amp;#039;d love to have them, and I&amp;#039;m sure I&amp;#039;m not the only one!\n\nSnipped from Wikipedia:\nAt the end of the 1960s, under the guidance of editor/plotter/artist Mike Sekowsky, Wonder Woman surrendered her powers to remain in &quot;Man&amp;#039;s World&quot; rather than accompany her fellow Amazons to another dimension where they could &quot;restore their magic.&quot; (Part of her motivation was to assist Steve Trevor, who was facing criminal charges.)\n\nNow a mod boutique owner, the powerless Diana Prince acquired a Chinese mentor named I Ching. Under I Ching&amp;#039;s guidance, Diana learned martial arts and weapons skills, and engaged in adventures that encompassed a variety of genres, from espionage to mythology. During this time she fought villains such as Catwoman, Doctor Cyber, the hippie gang THEM!, and the campy witch Morgana.\n\nThis new era of the comic book was influenced by the British television series The Avengers, with Wonder Woman in the role of Emma Peel. With Diana Prince running a boutique, fighting crime, and acting in concert with private detective allies Tim Trench and Jonny Double, the character resembled the golden age Black Canary. Soon after the launch of the &quot;new&quot; Wonder Woman, the editors severed all connections to her old life, most notably by killing Steve Trevor.[12]\n\nDuring the 25 bi-monthly issues of the &quot;new&quot; Wonder Woman, the writing team changed four times. Consequently, the stories display abrupt shifts in setting, theme, and tone. The revised series attracted writers not normally associated with comic books, most notably science fiction author Samuel R. Delany, who wrote Wonder Woman #202-203 (Oct. &amp; Dec. 1972).\n\nThe I Ching era had an influence on the 1974 Wonder Woman TV movie featuring Cathy Lee Crosby, in which Wonder Woman was portrayed as a non-powered globe-trotting super-spy who wore an amalgam of Wonder Woman and Diana Prince costumes. The era continues to influence stories decades later, most notably Walter Simonson&amp;#039;s run (Wonder Woman vol. 2, #189-194).[citation needed] The first two issues of Allan Heinberg&amp;#039;s run (Wonder Woman vol. 3, #1-2) include direct references to I Ching, and feature Diana wearing an outfit similar to that which she wore during the I Ching era.\n\nWonder Woman&amp;#039;s powers and traditional costume were restored in issue #204 (Feb. 1973). Gloria Steinem was a key player in the restoration. Steinem, offended that the most famous female superheroine had been depowered, placed Wonder Woman (in her original costume) on the cover of the first issue of Ms. magazine (1972), which also contained an appreciative essay about the character.\n\nThe return of the &quot;original&quot; Wonder Woman was executed by Robert Kanigher, who returned as the title&amp;#039;s writer-editor. For the first year he relied upon rewritten and redrawn stories from the Golden Age. Following that, a major two-year story arc (largely written by Martin Pasko) consisted of the heroine&amp;#039;s attempt to gain readmission in the Justice League of America. (Diana had quit the organization after renouncing her powers.) To prove her worthiness to rejoin the JLA, Wonder Woman voluntarily underwent twelve trials (analogous to the labors of Hercules), each of which was monitored in secret by a member of the JLA. Towards the end of this story-line, Steve Trevor was resurrected by Aphrodite. He adopted the identity of Steve Howard, and worked alongside Diana Prince (now knowing her true identity) at the United Nations.\n\nSoon after Wonder Woman&amp;#039;s readmittance to the JLA, DC Comics ushered in another format change. Following the popularity of the Wonder Woman TV series (initially set during World War II), the comic book was also transposed to this era. The change was made possible by the multiverse concept, which maintained that the 1970s Wonder Woman and the original 1940s version existed in two separate yet parallel, worlds. A few months after the TV series changed its setting to the 1970s, the comic book returned to the contemporary timeline. Soon after, when the series was written by Jack C. Harris, Steve (Howard) Trevor was killed off yet again.\n\n[IMG]http://i257.photobucket.com/albums/hh201/Catseye2001/WonderWoman_186_00.jpg[/IMG]  [IMG]http://i257.photobucket.com/albums/hh201/Catseye2001/Wonder_Woman_254_01fc.jpg[/IMG]\n\nConfused?  You won&amp;#039;t be, after this--   Ah, who am I kidding? If you can keep up with current character changes, parallel worlds, retconning, etc, then this stuff is a breeze.\n\nSeed, enjoy, yada yada!","torrent":{"xt":"urn:btih:a15090d7e514cb44339bb256da46d2a5f1684708","amp;dn":"Wonder+Woman+v1+pt4+186-254+%28%5C%2770-%5C%2779%29%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a15090d7e514cb44339bb256da46d2a5f1684708","infoHashBuffer":{"type":"Buffer","data":[161,80,144,215,229,20,203,68,51,155,178,86,218,70,210,165,241,104,71,8]},"announce":[],"urlList":[]}}