{"title":"John-Q 2002 By Burner.rr","uid":3997086,"size":1052034056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1bb720ce5304deb7ddfb086376442a94ac3f72a&amp;dn=John-Q+2002+By+Burner.rr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Burner.rr","files":2,"time":1201373345,"description":"Denzel Washington follows his powerful and gripping role in &quot;Training Day&quot; with a strong, powerful and intense performance in &quot;John Q.&quot; Immense star power, outstanding performances, a powerful message and a poignant story; these are the qualities, which make &quot;John Q&quot; one of the most powerful movies of the year.\n\nWith raw intensity, extreme authenticity and powerful intrigue Washington leads an all-star cast that includes Robert Duvall, Ray Liotta, James Woods and Anne Heche. With tremendous support from Kimberly Elise, Daniel E. Smith and Eddie Griffin, &quot;John Q.&quot; is a solid film that delivers on the promise to satisfy.\n\nThe best thing about watching &quot;John Q.&quot; is the conviction, integrity, brutal honesty and intense emotion each actor ought to their character. Furthermore, the cast is not afraid to tackle the truth surrounding the health care system and the way the system treats society. Washington, Heche, Duvall and Liotta create electricity with each scene they are in.\n\n&quot;John Q.&quot; surrounds a father who has been pushed over the edge as he attempts to save the life of his son, Mike, after it is found that his heart has a defect. Though he has insurance that covers the surgery to give his son a new heart, John Q. takes the hospital hostage until the hospital administrator puts Mike&amp;#039;s name on the list for a heart transplant.\n\nWhen your looking for it to be done right the first time!\n\nSay no to password downloads!\n","torrent":{"xt":"urn:btih:a1bb720ce5304deb7ddfb086376442a94ac3f72a","amp;dn":"John-Q+2002+By+Burner.rr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1bb720ce5304deb7ddfb086376442a94ac3f72a","infoHashBuffer":{"type":"Buffer","data":[161,187,114,12,229,48,77,235,125,223,176,134,55,100,66,169,74,195,247,42]},"announce":[],"urlList":[]}}