{"title":"Peligro Menores Sueltos [DVDRIP][Spanish]","uid":3925415,"size":730748928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1f58779efe8560355f30a0343487a67d847f824&amp;dn=Peligro+Menores+Sueltos+%5BDVDRIP%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":1,"time":1197056289,"description":"Ã‚Â¡Peligro! Menores sueltos (Unaccompanied Minors)\n\nReparto    Lewis Black, Rob Corddry, Dyllan Christopher, Wilmer Valderrama, Gina Mantegna, Dominique SaldaÃƒÂ±a, Tyler James Williams, Brett Kelly, Quinn Shephard, Paget Brewster\nDirector    Paul Feig\nProductor    Ira Glass, Lauren Donner, Michael Aguilar, Aaron Osborne\nGÃƒÂ©nero    Comedia\nPaÃƒÂ­s    EE.UU.\nDistribuidora    Warner Sogefilms\n\nSINOPSIS\nEs Nochebuena. Una espesa niebla ha provocado el cierre del aeropuerto y amenaza con arruinar las vacaciones de los pasajeros que se han quedado en tierra. \nAislados por la nieve de camino a casa de su padre, dos &quot;Menores Sueltos&quot;, alias MS, Spencer y su hermana pequeÃƒÂ±a, Katherine, son llevados a la sala de menores perdidos del aeropuerto, una celda de reclusiÃƒÂ³n para decenas de chicos abandonados y sin padres de todo el paÃƒÂ­s. \nAtrapado en el fuego cruzado de proyectiles de tortitas y cartones de zumo y desesperado por huir, Spencer intenta escapar hacia la libertad junto con otros cuatro MS, que no podrÃƒÂ­an ser mÃƒÂ¡s diferentes por mucho que lo hubieran intentado: la mimada niÃƒÂ±a rica Grace; la masculina Donna, que vive en un parque de caravanas; el brillante estudiante Charlie y el obseso de los comics Timothy Wellington, alias &quot;Beef&quot;. \nCon el gruÃƒÂ±ÃƒÂ³n director del Departamento de Relaciones con los Pasajeros, Oliver Porter, su pelota ayudante Zach Van Bourke y todos los guardias de seguridad del aeropuerto pisÃƒÂ¡ndoles los talones, este grupo de MS de procedencias tan diversas aprenden a dejar a un lado sus diferencias y ayudarse entre ellos para escapar de las garras de las autoridades aeroportuarias.\n\n","torrent":{"xt":"urn:btih:a1f58779efe8560355f30a0343487a67d847f824","amp;dn":"Peligro+Menores+Sueltos+%5BDVDRIP%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1f58779efe8560355f30a0343487a67d847f824","infoHashBuffer":{"type":"Buffer","data":[161,245,135,121,239,232,86,3,85,243,10,3,67,72,122,103,216,71,248,36]},"announce":[],"urlList":[]}}