{"title":"ECW.on.Sci-Fi.2008.01.29.WS.XviD-SC-SDH","uid":4004172,"size":361310424,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a271aacc71333f60b1b10cd495219a6cad097634&amp;dn=ECW.on.Sci-Fi.2008.01.29.WS.XviD-SC-SDH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"beckham23","files":28,"time":1201728786,"description":"toneCold420 and SmackDownHotel presents another High Quality Pro Wrestling XviD release for your viewing enjoyment.\n\nECW on Sci-Fi\nSovereign Center\nReading, PA\nJanuary 29, 2008\n\n\nAnother High Quality Pro Wrestling XviD release brought to you by StoneCold420\nand the SmackDownHotel DC++ Hub. Enjoy the show and that&amp;#039;s the bottomline cause StoneCold420 said so!!! This is SDH release #332 on ThePirateBay.org\n\nThis ECW on Sci-Fi HD show has been captured from the Sci-Fi-HD channel on DirecTv HDTV Digital Satellite in high quality mpeg 2 with 384 kbps AC3 Dolby Digital audio with a Pinnacle PCTV HD Ultimate Stick ATSC usb capture device then converted to 624 x 352 XviD with AutoGordianKnot with 128 kbps mp3 audio. \n\nThis is a 1/2 CD (350mb) XviD release of this ECW on Sci-Fi HD show and before you say this release isnt true HD it was still captured from the High Definition Sci-Fi-HD channel broadcasted in 16:9 at 1080i which has way better video quality then the Standard Definition channel that is only broadcasted in 4:3 at 480i. If you wish to burn this  XviD file to cd-r or a dvd-r then all SDH releases are compatible with all standalone Philips DVD - DivX players. Enjoy the show because this SDH release kicks ass and all you SC420 haters out there suck ass and thats the bottomline cause StoneCold420 said so!!!\n\nIf you don&amp;#039;t like the video capturing quality for SDH XviD wrestling releases and all you&amp;#039;re going to do is act like a bitch and complain about a FREE wrestling show that cost you nothing then DO NOT DOWNLOAD this and go download some other release instead and STFU or is that too hard for your candy ass to understand? \n\nI don&amp;#039;t do this for money only for the joy of sharing wrestling with other wrestling fans around the world and if you aren&amp;#039;t down with that then I got 2 words for you: FUCK OFF!!! Also the same set of assclowns who continally spams the comments section of ThePirateBay.org with low class scumbag remarks and comments on SDH torrents are all a bunch of low class scumbags who deserve my size 12 boot in your candy ass and my fist smashing your fucking face!!!\n\nATTENTION DOWNLOADERS:  If I say in the name of my wrestling releases HD then it means it was captured from the HD version of the DirecTv channel not the SD version of the same channel. Believe it or not there is a substantial difference in picture quality when capturing a show between the SD channels and the HD channels on DirecTv and if I choose to capture my shows from the HD channel instead of the SD channel then I see nothing wrong with that but since it is from a HD source channel then if I want to put HD after the show name that is my choice to do so since it is technically my release. If and when I do upload a TRUE HDTV capture at 1920 x 1080i or 1280 x 720p then I will put HDTV in the file name not HD Like I did earlier today with American Gladiator HDTV 1920 x 1080 show.\n--------------------------------------------\nOnly available on the Usenet now :P\nEnjoy","torrent":{"xt":"urn:btih:a271aacc71333f60b1b10cd495219a6cad097634","amp;dn":"ECW.on.Sci-Fi.2008.01.29.WS.XviD-SC-SDH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a271aacc71333f60b1b10cd495219a6cad097634","infoHashBuffer":{"type":"Buffer","data":[162,113,170,204,113,51,63,96,177,177,12,212,149,33,154,108,173,9,118,52]},"announce":[],"urlList":[]}}