{"title":"I am Legend","uid":3966626,"size":734877696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a2b795f95e5ed27a1b2af046396448e1c021b619&amp;dn=I+am+Legend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moeStaffa","files":1,"time":1199769203,"description":"Will Smith plays (as far as his character knows) the last man on earth, our hero, Robert Neville, a sole survivor of a world dominating virus created by man, that initially takes out 588 million people in 2009, and was originally created to somehow cure cancer. In 2012, Neville (a former scientist) dedicates his life to surviving for the sake of the human race, since he&amp;#039;s somehow immune to the virus and those who have been infected, and attempts to find a cure. In order to find a cure, he seeks out the infected beings at night, who seem to have completely forgotten how to act human, their instincts and survival skills have become non-existent, and either takes them out to survive, or in some cases, drags them to his underground lab for research purposes, in hopes of correcting humankind&amp;#039;s mistake. Written by Zack H.\n\nRobert Neville is a brilliant scientist, but even he could not contain the terrible virus that was unstoppable, incurable, and man-made. Somehow immune, Neville is now the last human survivor in what is left of New York City and maybe the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone. Mutant victims of the plague -- The Infected -- lurk in the shadows... watching Neville&amp;#039;s every move... waiting for him to make a fatal mistake. Perhaps mankind&amp;#039;s last, best hope, Neville is driven by only one remaining mission: to find a way to reverse the effects of the virus using his own immune blood. But he knows he is outnumbered... and quickly running out of time\n\nDVD Quality\n\nEnjoy","torrent":{"xt":"urn:btih:a2b795f95e5ed27a1b2af046396448e1c021b619","amp;dn":"I+am+Legend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2b795f95e5ed27a1b2af046396448e1c021b619","infoHashBuffer":{"type":"Buffer","data":[162,183,149,249,94,94,210,122,27,42,240,70,57,100,72,225,192,33,182,25]},"announce":[],"urlList":[]}}