{"title":"Frank Zappa 23-Nov 1974, Michigan State University, East Lansing","uid":3372685,"size":608701298,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a2c9d8256d5f678741dee8127face535bd642d77&amp;dn=Frank+Zappa+23-Nov+1974%2C+Michigan+State+University%2C+East+Lansing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zappateer","files":17,"time":1124633610,"description":"23-Nov 1974, Michigan State University, East Lansing, MI \n120 min, SBD, A- \nTush Tush Tush, Stinkfoot, RDNZL, Village Of The Sun, Echidna's Arf, Don't You Ever Wash That Thing?, Apostrophe', Penguin In Bondage, T'Mershi Duween, Dog Meat, Building A Girl, Dinah-Moe Humm, Camarillo Brillo, Montana, improvisations (incl Adventures Of The Space Booger, Little Red Book, Marty Had A Little Lamb, q: Mystery Song #1), Chunga's Revenge, Oh No, Son Of Orange County, More Trouble Every Day \n\n\n\nLineage: Sbd &gt; cassette &gt; cassette &gt; cdr &gt; flac\n\nrecorded by brian\n\n\ngot requests check out the list !\n\nhttp://home.swipnet.se/fzshows.\n\n\n\n\n\n\n*\n L&amp;Auml;RMVERMINDERUNG UND ANDERE AUDIOVERBESSERUNGEN! Wenn Sie m&amp;ouml;gen, downloaden Ger&amp;auml;usche und Verzerrung nicht! * WARNING/GUARANTEE Dieser Strom enth&amp;auml;lt Audio, den eine wirklich freie Gesellschaft weder noch suppress.In einige sozial f&amp;uuml;rchten w&amp;uuml;rde verz&amp;ouml;gerte Bereiche, Audiofanatiker und ultrakonservative lossless Organisationen verletzen Ihre erste &amp;Auml;nderung Rechte durch das Versuchen zur badmouth L&amp;auml;rmverminderung. Wir glauben, da&amp;szlig; dieses verfassungswidrig und un-Deutsch ist. Als Alternative zu diesen Regierung-st&amp;uuml;tzte die Programme (entworfen, um Sie docile und unwissend zu halten), zappateer freut sich, um anregende digitale Audiounterhaltung f&amp;uuml;r die von Ihnen zur Verf&amp;uuml;gung zu stellen, die herausgewachsen sind die Ger&amp;auml;usche und die Verzerrung der schlecht gebrachten und erarbeiteten Publikum Aufnahmen. Die Sprache und die Konzepte, die hierin enthalten werden, UM GARANTIERT werden EWIGEN STROM NICHT IM PLATZ ZU VERURSACHEN IN DEM DER KERL MIT DEM ZISCHEN UND DER VERZERRUNG UND DES &amp;Uuml;BERSCHUSS-EQED MIST S&amp;Auml;EN ihre STR&amp;Ouml;ME (www.zappateer.com), das diese Garantie so real wie die Drohungen der Audiofundamentalisten ist, die Angriffe auf L&amp;auml;rmverminderung innen verwenden ihr Versuch, die zappa Ventilatoren in eine Gesellschaft von mp3 umzuwandeln sourced noisey nincompoops (im Namen Stupidity). Wenn es eine H&amp;ouml;lle, sein Zischen und Ger&amp;auml;uschwartezeiten f&amp;uuml;r sie gibt, nicht wir. * meine &amp;Uuml;bertragungen sind mit audig y2 stichhaltigem Karte 24 Bit 96 kHz GEBRACHTE @ 48 kHz 24 Bit-Sony d-6 Kassette erfolgt und Monster kabelt alle erarbeitende Redigieren und Beispielumwandlung, die mit Sony soundforge erfolgt ist und Wellen wurden direkte x 24 Bit plugins CDS mit soundforge Cd architech gebrannt F&amp;Uuml;R DIE VON IHNEN GENIESSEN WHO WIE MEIN STROM-DANK UND! DIE, DIE NICHT SEIN WIRKLICH EINFACHES DOWNLOAD JEMAND ANDERES TORREN","torrent":{"xt":"urn:btih:a2c9d8256d5f678741dee8127face535bd642d77","amp;dn":"Frank+Zappa+23-Nov+1974%2C+Michigan+State+University%2C+East+Lansing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2c9d8256d5f678741dee8127face535bd642d77","infoHashBuffer":{"type":"Buffer","data":[162,201,216,37,109,95,103,135,65,222,232,18,127,172,229,53,189,100,45,119]},"announce":[],"urlList":[]}}