{"title":"Led Zeppelin 1973.01.22 - Southampton","uid":4007897,"size":866731310,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a524e58352ae574c1fba0e78aaa02c5b45365f0e&amp;dn=Led+Zeppelin+1973.01.22+-+Southampton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TimD54","files":22,"time":1201927639,"description":"It&amp;#039;s time for Southampton, 1-22-1973.  The MultiTrack Mixdown.  Rumor has it that these are Kevin Shirley&amp;#039;s working tapes.  I can&amp;#039;t verify that, and I don&amp;#039;t promise what I can&amp;#039;t even try to verify.  If it&amp;#039;s Shirley&amp;#039;s work, IMHO it&amp;#039;s incomplete.  But that&amp;#039;s more a measure of my esteem for Mr. Shirley&amp;#039;s work than it is for the sound of this recording - for a ROIO, it sounds amazing.  \n\nRight off the bat, just to let you know, this got treed a while back over on TTD, and there was some mild criticism of the performance.  Nah.  The guys were spectacular, maybe not the best they ever were, but that&amp;#039;s a pretty high standard, innit?  And like I said, you just can&amp;#039;t beat the sound.\nThere are, as usual, some great Plantations.  IMHO, just as valuable a show as the HTWWW recordings - it&amp;#039;s as loose and groovy as the LA shows were tight and focused, and would make a great companion show to those and maybe Osaka as a set - How The Homeland Was Won?  \n\nHere&amp;#039;s the review from after the show:\n\n&lt;&lt;&lt;BEGIN REVIEW&gt;&gt;&gt;\n\nWessex News\nNo Date\nAuthor: John Clark\n\nLZ Live at Clive&amp;#039;s\n\nFor two days, Southampton was blessed with the presence of the world&amp;#039;s top rock band.\n\nOn the first, it was the turn of the town, with Led Zeppelin blowing the minds of 2500 fans at the Gaumont. But the next day, our heroes came to the Union, and played to us in the Black Hole of Calcutta, or Old Ref. as it is sometimes known.\n\nThe Gaumont concert had been pretty tight, but not as good as I would have expected from a band that had been on the road for the past two months. But all my doubts were dispelled the next day.\n\nI don&amp;#039;t know if it was the atmosphere, or just being right at the front of the audience, but the Old Ref. concert was just fantastic. There&amp;#039;s no other word for it.\n\nThey enjoyed it, and we enjoyed it, and that&amp;#039;s what matters.\n\nAs usual, they were a bit slow to warm up - in fact &amp;#039;Rock n Roll&amp;#039;, their opening number, was very rough, and the next, &amp;#039;The Lady&amp;#039;, (OTHAFA - Ed.) a track from LZ 5 (Houses of the Holy - Ed.), wasn&amp;#039;t much better either.\n\n&amp;#039;Black Dog&amp;#039; followed, and the audience joined in instantly on the ah-ah-aaah chorus, whereas it took the Gaumont audience a couple of goes to get it right.\n\nLZ were beginning to cook. &amp;#039;Misty Mountain Hop&amp;#039; and &amp;#039;Since I&amp;#039;ve Been Loving You&amp;#039; came next, giving John Paul Jones a chance to show us his dexterity on the keyboards. Until &amp;#039;Loving You&amp;#039;, Jimmy Page had been churning out the riffs to make his numbers boogie, but on this one he gave us his first solo, very fast one second, and slow the next, getting everything out of each note.\n\nJust to watch him moving his fingers up and down the fretboard made me very envious - he must have some natural gift. &amp;#039;Dancing Days&amp;#039; and &amp;#039;The Song Remains The Same&amp;#039;, the two new numbers were the next, the first, a straight rocker very much in the LZ style, and the second, a longish complex number starting and finishing with some low tempo-melodic guitar playing, and connected with a heavy rocking bit and a superb organ solo from John Paul Jones.\n\nThe next number Robert Plant dedicated to the manager of the Gaumont - &amp;#039;Dazed and Confused&amp;#039;. This, a track from their first album, was used as a showpiece for Page&amp;#039;s long guitar solo. For part of this he used a big bow, and the highlight was when he hit the strings and got the note to echo back to him. When he&amp;#039;d been playing for about 10 minutes, the rest of the band joined in and stretched the number out to about 25 minutes.\n\nNext was a beam of clear, white light, as Plant called it, &amp;#039;Stairway To Heaven&amp;#039;. Plant&amp;#039;s vocals, which had been a bit hidden by Page&amp;#039;s guitar before, came through beautifully, the song gradually rising to the peak of that superb rocking ending. That got everybody on their feet, and shouting for every LZ number under the sun. But Plant asked everybody to shut up for a moment, while he told them about his visit to the toilet.\n\nOn the bog wall, he saw this name - Alan Whitehead - and this next number was dedicated to him. It was &amp;#039;Whole Lotta Love&amp;#039;. The band went into a number of old rock and roll tunes, then &amp;#039;I Can&amp;#039;t Quit You Babe&amp;#039;, and back to &amp;#039;Whole Lotta Love&amp;#039; for a tremendous climax to the show. A few minutes clapping, and they were back to give us &amp;#039;Heartbreaker&amp;#039;, and then &amp;#039;Thank You&amp;#039;, featuring John Paul Jones with a long organ intro., and back for a third time.\n\nPlant said how much they&amp;#039;d enjoyed the gig, and then they proceeded to play &amp;#039;How Many More Times&amp;#039;, the first time they&amp;#039;d done it for two and a half years. But you&amp;#039;d never have known it, it was so tight.\n\nStraight into &amp;#039;Communication Breakdown&amp;#039;, and then it was all over. See you again, they said, and a very knackered goodnight.\n\nThis was the only gig they recorded on the whole tour - because they reckon the acoustics of the old Ref are good - and after the show Jimmy Page said there would probably be a live album later this year. Let&amp;#039;s hope so - it&amp;#039;d be a great souvenir of a great show.\n\n\n&lt;&lt;&lt;END REVIEW&gt;&gt;&gt;\n\nYou know what to do if you want it.    \n\nShare and enjoy,\nTimD","torrent":{"xt":"urn:btih:a524e58352ae574c1fba0e78aaa02c5b45365f0e","amp;dn":"Led+Zeppelin+1973.01.22+-+Southampton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a524e58352ae574c1fba0e78aaa02c5b45365f0e","infoHashBuffer":{"type":"Buffer","data":[165,36,229,131,82,174,87,76,31,186,14,120,170,160,44,91,69,54,95,14]},"announce":[],"urlList":[]}}