{"title":"America pie:beta house(S.E.G)","uid":3993844,"size":729749504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a56d1c375caa5fb59985293af12a9eff8f629dde&amp;dn=America+pie%3Abeta+house%28S.E.G%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fenerli1907","files":1,"time":1201204434,"description":"American Pie Beta House\n\nThe hijinks now move from the town of Great Falls to the University of Michigan, where the infamous Beta House fraternity has been setting new standards for incredible parties and outrageous antics. Our heroes are cousins Erik and Dwight Stifler. Erik has recently been dumped by his high school girlfriend and is trying to re-invent himself while pledging Dwight&amp;#039;s fraternity, Beta House. Meanwhile, Dwight is trying to save Beta House from an onslaught by the newly established GEK (&quot;Geek&quot;) House, which is led by power-hungry nerd leader Edgar and his band of geek brothers and sisters. Erik&amp;#039;s best friend Mike &quot;Cooze&quot; Coozeman and his new roommate Bobby also pledge Beta House and ARE planning to enjoy college to the fullest. It promises to be a semester full of partying, craziness, pranks, and sexual tension to exceed expectations... ...and it does! Erik finds a girl, Ashley, to heal his heartbreak. Cooze dates Ashley&amp;#039;s roommate Denise -- but finds himself in a possible &quot;Crying Game&quot; scenario. Dwight and the other Betas fight off Geek House for social supremacy on campus. The rivalry gets so intense that the only way to settle it is through direct competition in the Greek Games, an ancient campus ritual that went so far out of control it was banned forty years ago. It turns out that even Geeks can be bullies, so the Betas have to pull together to fend off the Geeks and prove that some traditions deserve to be upheld.\n\nGood Quality.\n\nMade By Fenerli1907.\n","torrent":{"xt":"urn:btih:a56d1c375caa5fb59985293af12a9eff8f629dde","amp;dn":"America+pie%3Abeta+house%28S.E.G%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56d1c375caa5fb59985293af12a9eff8f629dde","infoHashBuffer":{"type":"Buffer","data":[165,109,28,55,92,170,95,181,153,133,41,58,241,42,158,255,143,98,157,222]},"announce":[],"urlList":[]}}