{"title":"Tananas.1996.Unamunacua.1996.(South.Africa)","uid":4000535,"size":60796928,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a59e639069c82fc22fc5a69713256632f6201923&amp;dn=Tananas.1996.Unamunacua.1996.%28South.Africa%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MrFrankenstein","files":14,"time":1201544764,"description":"For those of you who are into high quality acoustic music - or even if you&amp;#039;re just a homesick South African - here&amp;#039;s the third of a series of albums of arguably the best music ever to be made in South Africa, by the unique band known as Tananas.\n\nGiven the absence of free bandwidth from out of South Africa, this music is very rare and difficult to find online. Its a fusion of African sounds and beats, and classical guitar, that is something special.\n\nTo quote from Wikipedia:\n&quot;Tananas, (pronounced tuh-naa-nuhs) is a South African band formed in 1987. Originally it consisted of Mozambican Gito Baloi (bass and vocals), Ian Herman (drums and percussion) and Steve Newman (acoustic guitar). First recorded by the independent label Shifty Records[2], Tananas combines jazz, Mozambican salsa, and township jive. They have released eight albums, the last two on the Sony label.\n\nTananas have built a loyal following in their home country since the late 1980s, and they have performed at WOMAD festivals around the world. They have worked individually or as a band with Paul Simon and Sting, and have shared a stage with the likes of Bonnie Raitt, Suzanne Vega and Youssou N&amp;#039;dour.\n\nIf you like the music, please buy it and support the artists.\n\nThis is technically the fifth Tananas album, (titled &amp;#039;Unamunacua&amp;#039;) released way back in 1996.\n\nIf you grab it and like it, please seed. ","torrent":{"xt":"urn:btih:a59e639069c82fc22fc5a69713256632f6201923","amp;dn":"Tananas.1996.Unamunacua.1996.%28South.Africa%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59e639069c82fc22fc5a69713256632f6201923","infoHashBuffer":{"type":"Buffer","data":[165,158,99,144,105,200,47,194,47,197,166,151,19,37,102,50,246,32,25,35]},"announce":[],"urlList":[]}}