{"title":"Dean Koontz - 2007 - The Darkest Evening Of The Year (128 kbit/s","uid":3920321,"size":527590230,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a6f78b808368927fe6c67ef26bb8472d59f66436&amp;dn=Dean+Koontz+-+2007+-+The+Darkest+Evening+Of+The+Year+%28128+kbit%2Fs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sentinel28","files":8,"time":1196754723,"description":"from the publisher:\n\nAmy Redwing has dedicated her life to the southern California organization she founded to rescue abandoned and endangered golden retrievers. Among dog lovers, she?s a legend for the risks she?ll take to save an animal from abuse. Among her friends, Amy?s heedless devotion is often cause for concern. To widower Brian McCarthy, whose commitment she can?t allow herself to return, Amy?s behavior is far more puzzling and hides a shattering secret.\n\nNo one is surprised when Amy risks her life to save Nickie, nor when she takes the female golden into her home. The bond between Amy and Nickie is immediate and uncanny. Even her two other goldens, Fred and Ethel, recognize Nickie as special, a natural alpha. But the instant joy Nickie brings is shadowed by a series of eerie incidents. An ominous stranger. A mysterious home invasion.\n\nAnd the unmistakable sense that someone is watching Amy?s every move and that, whoever it is, he?s not alone.\n\nSomeone has come back to turn Amy into the desperate, hunted creature she?s always been there to save. But now there?s no one to save Amy and those she loves. From its breathtaking opening scene to its shocking climax, The Darkest Evening of the Year is Dean Koontz at his finest, a transcendent thriller certain to have readers turning pages until dawn.","torrent":{"xt":"urn:btih:a6f78b808368927fe6c67ef26bb8472d59f66436","amp;dn":"Dean+Koontz+-+2007+-+The+Darkest+Evening+Of+The+Year+%28128+kbit%2Fs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6f78b808368927fe6c67ef26bb8472d59f66436","infoHashBuffer":{"type":"Buffer","data":[166,247,139,128,131,104,146,127,230,198,126,242,107,184,71,45,89,246,100,54]},"announce":[],"urlList":[]}}