{"title":"SmartEncode 2.0.0.574 PR Beta","uid":3363157,"size":849503,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a77f774dd5673d56bbfd896465b2b8702fbcf5b4&amp;dn=SmartEncode+2.0.0.574+PR+Beta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lap87","files":1,"time":1122745833,"description":"Detta program &amp;auml;r d&amp;aring; en beta av den kommande SmartEncode som &amp;auml;r baserat p&amp;aring; OpenSource och kan &amp;auml;ven hittas p&amp;aring; &quot; http://smartencode.beplaced.com/ &quot; men anledningen till att jag l&amp;auml;gger upp denna &amp;auml;r f&amp;ouml;r att l&amp;auml;tta belastningen lite p&amp;aring; deras sida.\n\nSmartEncode is an audio ripper and encoder for Windows(tm). \n\nSmartEncode uses a highly refined form of the former technique, producing audio files that are both of small size and very high quality. \n\nSmartEncode has three encoding 'types' to suit the needs of the main groups of users. Those that want either the smallest size or the highest quality, and those that like to get a bit of both worlds. A common problem with conventional encoders is the amount of settings and tuning that are left up to the user to set accurately. SmartEncode takes care of all these issues internally, meaning you can leave all the options as they are, and still get great sounding audio.\n\n - Main Features -\n    \n* Easy to use\n    \n* Ultra-high quality audio compression using three different modes\n    \n* Audio analyser that uses AI to ensure efficient fine-tuning to your specific track\n    \n* Produces OGG-Compatible files (can be played with most media players and mobile music players)\n    \n* Efficient audio analysis and transformation means faster encoding\n   \n* Supports Dolby(tm) Prologic files with up to 255 discrete channels\n    \n* S3 Technology can create 5.1 surround files from CDs or stereo files\n    \n* Batch conversion for WAV files of various formats (e.g. 11Khz-48Khz)\n    \n* Benchmark feature to compare real-life performance of systems\n    \n* Step-by-step documentation ensures accessibility for nearly every kind of user\n    \n* Intelligent and configurable placement of ripped audio files\n    \n* More... (Discover it for yourself!)\n\n  Licensing\n\nSmartEncode is absolutely free to use! You may also distribute copies of it as long as it is in the original form (setup.exe file). Please make sure you read the EULA first before installing, copying or distributing it. SmartEncode is built around some open source software, which is released under the GNU public license. The source code to this application is closed, open library source code is available from the respective developers. \n\n\n/Upped by: LAP87 [BBB][K-D]","torrent":{"xt":"urn:btih:a77f774dd5673d56bbfd896465b2b8702fbcf5b4","amp;dn":"SmartEncode+2.0.0.574+PR+Beta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a77f774dd5673d56bbfd896465b2b8702fbcf5b4","infoHashBuffer":{"type":"Buffer","data":[167,127,119,77,213,103,61,86,187,253,137,100,101,178,184,112,47,188,245,180]},"announce":[],"urlList":[]}}