{"title":"Alex Jones - Endgame (VOB)","uid":3874747,"size":4681651363,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a82edae0fd859307015bc515dd4ac007a133ef8f&amp;dn=Alex+Jones+-+Endgame+%28VOB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RedDelPaPa","files":25,"time":1194318588,"description":"Alex Jones - Endgame - Complete DVD - Including original menus, chapters, and extras - VOB - 4.35GB\n\nFor the New World Order, a world government is just the beginning. Once in place they can engage their plan to exterminate 80% of the world&amp;#039;s population, while enabling the &quot;elites&quot; to live extended lives, or possibly even forever with the aid of advanced technology. For the first time, crusading filmmaker Alex Jones reveals their secret plan for humanity&amp;#039;s extermination: Operation ENDGAME.\n\nJones chronicles the history of the global elite&amp;#039;s bloody rise to power and reveals how they have funded dictators and financed the bloodiest wars, creating order out of chaos to pave the way for the first true world empire.\n\n* Watch as Jones and his team track the elusive Bilderberg Group to Ottawa and Istanbul to document their secret summits, allowing you to witness global kingpins setting the world&amp;#039;s agenda and instigating World War III.\n\n* Learn about the formation of the North America transportation control grid, which will end U.S. sovereignty forever.\n\n* Discover how the practitioners of the pseudo-science eugenics have taken control of governments worldwide as a means to carry out depopulation.\n\n* View the progress of the coming collapse of the United States and the formation of the North American Union.\n\nNever before has a documentary assembled all the pieces of the globalists&amp;#039; dark agenda. Endgame&amp;#039;s compelling look at past atrocities committed by those attempting to steer the future delivers information that the controlling media has meticulously censored for over 60 years. It fully reveals the elite&amp;#039;s program to dominate the earth and carry out the wicked plan in all of human history.\n\nEndgame is not conspiracy theory, it is documented fact in the elite&amp;#039;s own words.\n\nThis film has been authorized for non profit redistribution by its producer, Alex Jones. If you have the money, and would like to support Mr. Jones and all his hard work, please purchase an authentic copy of this film by going to\n\nIf you received your copy of this film via torrent download, please continue to seed this torrent as much as possible. It is imperative this information reach as many people as possible. Thank you.\n","torrent":{"xt":"urn:btih:a82edae0fd859307015bc515dd4ac007a133ef8f","amp;dn":"Alex+Jones+-+Endgame+%28VOB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a82edae0fd859307015bc515dd4ac007a133ef8f","infoHashBuffer":{"type":"Buffer","data":[168,46,218,224,253,133,147,7,1,91,197,21,221,74,192,7,161,51,239,143]},"announce":[],"urlList":[]}}