{"title":"Xilisoft Video Converter 3.1.51.0114 - vLcB + Serial","uid":3979539,"size":16572927,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a8b7c3577007c2953317a703d96774da367c300c&amp;dn=Xilisoft+Video+Converter+3.1.51.0114+-+vLcB+%2B+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"warezbg","files":3,"time":1200478940,"description":"Xilisoft Video Converter\n\nClick to enlarge\n\n\nClick to enlarge\n\n\nXilisoft Video Converter is powerful, versatile video conversion software which convert video file between all popular video formats such as convert AVI to MPEG, WMV to AVI, WMV to MPEG, H.264 video, etc. \n\nNo other program like Xilisoft Video Converter supports so comprehensive video formats including DVD, VCD, SVCD, AVI, MPEG, MP4, WMV, 3GP, H.264/MPEG-4 AVC, H.264/PSP AVC Video, MOV, RM, ASF, FLV, SWF, etc. In addition, The Video Converter provides an easy way to convert video file to popular audio file, like MP2, MP3, AC3, RA, M4A, OGG, AAC etc. The Video Converter also supports APE, CUE decoding and audio CD ripping.\n\nXilisoft Video Converter supports popular multimedia devices such as PSP, iPod, MP4 player, mobile phone, Zune, iPhone, BlackBerry etc. All conversion, such as AVI to MPEG, WMV to MPEG, WMV to AVI, are very easy and fast with the best quality. Free download Xilisoft Video Converter to have a wonderful experience right now!\n\n\nKey Features:\nIt supports converting to PSP video, iPod video, 3GP video, Zune video, iPhone MP4, BlackBerry etc;\nIt supports H.264 video format, PSP MPEG-4 AVC encoding/decoding, PSP AVC Video (480x272) (*.mp4);\nThe Video Converter wizard has been designed and added for beginners, guiding your conversion;\nZoom and split functions were added in Xilisoft Video Converter 3.1 version;\nIt provides batch conversion and multithreading, you can convert multiple files at the same time;\nIt could convert any clip or segment. You can convert any clip or segment by setting the start point and duration at will;\nThe Video Converter allows preview;\nWhen converting files, you can pause, stop and continue at any moment;\nYou could keep the default settings or set parameters of the video and audio codec by yourself. You can specify the output file name.\n","torrent":{"xt":"urn:btih:a8b7c3577007c2953317a703d96774da367c300c","amp;dn":"Xilisoft+Video+Converter+3.1.51.0114+-+vLcB+%2B+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b7c3577007c2953317a703d96774da367c300c","infoHashBuffer":{"type":"Buffer","data":[168,183,195,87,112,7,194,149,51,23,167,3,217,103,116,218,54,124,48,12]},"announce":[],"urlList":[]}}