{"title":"Marcus Hook Roll Band (Young Brothers Pre AC/DC)","uid":3923776,"size":104556347,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9a7421e798fe36627096931194eb169142f1bea&amp;dn=Marcus+Hook+Roll+Band+%28Young+Brothers+Pre+AC%2FDC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BadBob102","files":15,"time":1196963345,"description":"LINER NOTES TO THE MARCUS HOOK ROLL BAND COMPILATION ALBUM\n&quot;FULL FILE&quot;\n\nThis album contains all known existing tracks of The Marcus Hook Roll Band - an identity assumed by Harry Vanda &amp; George Young at the very end of their four year stint in London as session musicians and independent record producers. Though they had regularly issued material under a string of assumed identities (Haffey&amp;#039;s Whiskey Sour, Moondance, Paintbox, Band of Hope, Grapefruit, etc.) this was the most extensive of their projects.\n\nThe MHRB came together under the hand of ex-Pretty Thing Wally Allen, who managed to wrangle some studio time at Abbey Road. There they cut 5 tracks with their regular retinue of fellow musicians - just prior to journeying to Australia for a holiday.\n\nInstead of returning to London, Vanda &amp; Young relocated themselves in Australia and forgot all about the Marcus Hook sessions - until a frantic message came through from Allen that America was keen on the tracks and wanted more. &quot;We thought it was hilarious&quot; says George, &quot;it had been a joke to us&quot;.\n\nThe pair refused to return to London, so Allen visited Australia early in 1974 to record another ten tracks. This time, local musicians were used - including George&amp;#039;s kid brothers Angus &amp; Malcolm (who had not previously recorded).\n\nAfter repeated requests for a tour to support the product were turned down flat, American interest waned and album release was scrapped (it&amp;#039;s only issue being in Australia as &amp;#039;Tales of Old Grandaddy&amp;#039;).\n\nThe Marcus Hook tracks follow in the tradition of the best Easybeats&amp;#039; material - tough, perfectly structured and intelligent. A very convincing political and social sentiment runs through many of the songs, as does a strong soul/funk influence.\n\n&amp;#039;Natural Man&amp;#039; has become a cult classic, adored for its exhilerating pop/rock form; while &amp;#039;Shot In The Head&amp;#039; (originally recorded by Haffey&amp;#039;s Whiskey Sour and also covered by Savoy Brown) is as close to a theme song as the extraordinary duo have ever penned;\n\n&quot;I&amp;#039;ve Been 52 years in a rock &amp;#039;n roll band, ten thousand women on a one night stand. And all I got to show is a hole in my hand, where my money fell through.&quot;\n","torrent":{"xt":"urn:btih:a9a7421e798fe36627096931194eb169142f1bea","amp;dn":"Marcus+Hook+Roll+Band+%28Young+Brothers+Pre+AC%2FDC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9a7421e798fe36627096931194eb169142f1bea","infoHashBuffer":{"type":"Buffer","data":[169,167,66,30,121,143,227,102,39,9,105,49,25,78,177,105,20,47,27,234]},"announce":[],"urlList":[]}}