{"title":"I know I'm Not Alone","uid":3779679,"size":729401344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aaf44f4cd01a5b6776d0ea021ffc5a2cffbfe3d1&amp;dn=I+know+I%5C%27m+Not+Alone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fuctndabrain","files":1,"time":1187657195,"description":"Synopsis:  Musician and peace activist, Michael Franti, goes on a trip to Bagdad and Palestine to spread a message of peace, love and understanding. The movie shows what life under occupation is like in two different countries. \n\n\n\n\n\n\nIMDB Review: \\&quot;This is a wonderful documentary from the hand of the musician Michael Franti. this film shows what he finds in the occupied countries and cities of Baghdad and Gaza, it doesn\\&amp;#039;t show the political aspects but the human costs of war. the movie is touching, moving and shocking. Michael Franti goes into dangerous areas, to show the people and listen to there stories. he talks to people who want to make a change, people who want to live in peace. \n\na wonderful aspect of the movie is that he shows both side\\&amp;#039;s. in Baghdad he shows the people of Iraq but also the Americans. in Gaza he shows the Palestinians and the Israeli people. he doesn\\&amp;#039;t judge anyone of them, he just want to understand the situation. \n\nthere is one meeting near the end of the movie between an Palestinian and Israeli soldier, that really moved me. they want to live side by side, but then the government needs to change. one of them says; \\&quot;we need a government that isn\\&amp;#039;t lead by religion. if religion is involved in politics it is giving trouble.\\&quot; \n\ni can tell you a lot more about this film, but you have to see it for yourself. you will be surprised, you will be laughing, you will be shocked and you will be crying.\\&quot; ","torrent":{"xt":"urn:btih:aaf44f4cd01a5b6776d0ea021ffc5a2cffbfe3d1","amp;dn":"I+know+I%5C%27m+Not+Alone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf44f4cd01a5b6776d0ea021ffc5a2cffbfe3d1","infoHashBuffer":{"type":"Buffer","data":[170,244,79,76,208,26,91,103,118,208,234,2,31,252,90,44,255,191,227,209]},"announce":[],"urlList":[]}}