{"title":"HOT passed out teenage girl gets cum in pussy [*SCREENSHOTS*]","uid":4015320,"size":350392910,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ab7dbb8dd2dd6b2542250d55669ac0d5d53da200&amp;dn=HOT+passed+out+teenage+girl+gets+cum+in+pussy+%5B%2ASCREENSHOTS%2A%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PekkaHeino","files":12,"time":1202327064,"description":"Well... i will just try to make this as descriptive as possible.\n\n\nFirst of all. This clip is damn hot. The girl is stunningly sexy and they just violate her tight body like it was nothing. I Like it.\n\n\nIn this scene there are two guys that have drugged down a teenage girl so that she is passed out. (As seen on pic here: http://hidebehind.com/04E81B )\n\nShe has the smalest cutest little teenage pussy ever (see pic: http://hidebehind.com/C67D5D ) I bet its damn tight.\n\n\nFirst they undress her and then they fuck her around a bit in various positions ( http://hidebehind.com/E20C58 ) she stays passed out for the entire scene so they can really do anything they want to her...\n\nShe also have a tatoo over that nice ass ( http://hidebehind.com/AAB4EB )\n\n\nWhen the scene is almost over and the guys are about to cum they both take turns cumming inside her pussy while she still is passed out. \nI guess they thought &quot;what the hell&quot; and just went ahead and did what felt best since she couldnt complain anyway.. and i cant really blame them...\n\nWhen the first guy cums, he first lays her on her back over a pillow... ( http://hidebehind.com/003158 ) he then fucks her in a steady pace and you can hear by his breathing when he is cumming...when he cums, he continiues to fuck her in the same pace but puts his dick in a little deeper (to shoot his cum deeper in her) and then finally he turns the camera a bit to give more of a side view when he tries slowly to get the last drops of sperm into her ( http://hidebehind.com/3C0611 ) and then he pulls the dick out and some sperm leaks out ( http://hidebehind.com/04AEA4 )\n\n\nThe second guy lays on his back and then lays her still passed out body on top of him. Flat on her tummy. And then fucks her like that. Harder than the other guy. ( http://hidebehind.com/C643E6 )\nThen, you can see how he is stopping the fucking a couple of times to last a little longer without cumming. And suddenly he just cant hold back anymore and fuck her hard until he cums. And this guy cum *HARD*. You see his dick contract and spasm with every stream of sperm he shoots into her pussy. And its alot. And he does it deep to...with every thrust he plunges into her the deepest he can to cum as deep inside her as possible ( http://hidebehind.com/57950C )\n\nWhen he is finally finished, he slowly takes his dick out and some of his sperm leaks out ( http://hidebehind.com/E1D2E1 ) and its quite an impressive load....\n\n\n\nI will upload more porn such as this when i have the time. I hope you guys enjoy this.\t\n\nThe same screenshots as above is included in the torrent.","torrent":{"xt":"urn:btih:ab7dbb8dd2dd6b2542250d55669ac0d5d53da200","amp;dn":"HOT+passed+out+teenage+girl+gets+cum+in+pussy+%5B%2ASCREENSHOTS%2A%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab7dbb8dd2dd6b2542250d55669ac0d5d53da200","infoHashBuffer":{"type":"Buffer","data":[171,125,187,141,210,221,107,37,66,37,13,85,102,154,192,213,213,61,162,0]},"announce":[],"urlList":[]}}