{"title":"Azurik Rise of Perathia XBOX - ProjectX","uid":3361337,"size":2072735900,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ab965e7493f656ac2bb4f9dcc5fe23d9bd12a613&amp;dn=Azurik+Rise+of+Perathia+XBOX+-+ProjectX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigboobsplz","files":46,"time":1122384822,"description":"\n   _________________________       ___________  _________________ __\n  _/         / _     /           /     / _   | /      |     ___//_/\n |   /      / /     /   _    ___/     /  /   |/   /___|_    |__._______\n |     ____/       _        /     /    ___/_  /      |   |  |      /\n |_____| |__________/________//     /__________)________|___|  |    _/\n-X----- - --- - --- --- /___________/ -- -- ----  -- --- X/            \n                                                         /______|______\n  presents ......: Azurik: Rise of Perathia \n  Company .......: Microsoft\n\n  Origin ........: USA / NTSC              Format ........: *.ISO Image\n  System ........: Microsoft XBOX          # of Files ....: 42 x 50MB\n  Released ......: May 4th, 2002           Filename ......: PX-AROP.RAR\n\n-X- ---- --- - --- ---------- -- - ------------- --- -- --- ---- --- --X-\n\n  A young man, on a heroic journey, in the greatest adventure of all\n  time... Azurik - Rise of Perathia, a third person, 3D action\n  adventure game designed to showcase the capabilities of the Xbox, you\n  assume the role of a young apprentice Lore Guardian named Azurik.\n  Sworn to protect the sacred elements - fire, water, earth, and air.\n  You must stop an apocalyptic prophecy that threatens to condemn your\n  world to destruction. With intense hand-to-hand combat, intuitive\n  puzzles, amazing seamless environments, and vast exploration, Azurik\n  combines the best of three genres by including ample doses of epic\n  adventure, fast console-style action, and intriguing story-based RPG\n  gameplay. Harness the power of the elements, only on the Xbox.\n\n  * Action, &quot;Axion&quot; style - A revolutionary weapon system lets gamers\n    unleash the fury of the elements with attack powers and shield in a\n    fraction of a second. Every great warrior must master his weapon;\n    Azurik must also balance brains and brawn to defeat his enemies. \n\n  * A Huge, Seamless Universe - The world of Perathia is an immense\n    environment with regions dedicated to the elemental realms of air,\n    earth, water, fire, death, and life. Each region is a feast for the\n    eyes with incredible rich textures, dynamic lighting , real shading\n    and spectacular particle effects that will make the world seem\n    truly alive.\n\n  * Smart, Dynamic Enemies - A vast array of unique and ever-changing\n    creatures work together; flocking, swarming and riding one another\n    to present dynamic combat challenges. Each creature has its\n    weakness - find it, and exploit it to win. Be careful come\n    nightfall, some things are not as they seem. \n\n  * True Freedom in Gameplay - The gamer is truly free to explore the\n    world of Perathia. Move between realms with no loading screens to\n    distract you from your adventure. \n\n\n  We tested this game on a developer XBOX, and it works.  Since there is\n  no mod chip yet, we have no idea if this release will work on retail\n  XBOXes when/if a mod comes out.  However, now that there is a release,\n  a modchip developer will be inclined to get our releases to work, so\n  we think a future mod will work with this release.\n\n  If a game is small enough to be burned to a CD, you can burn it to \n  either a CD or DVD, at your option, using the same ISO file.  \n  The Xbox does not use media checks like the PS2. \n\n  When burning to a CD, if your CD burning program has an option, \n  choose &quot;MODE1/2048&quot;, exactly as if you were burning a PC CD-ROM.\n  We recommend PrimoDVD for burning Xbox for both CD and DVD, but \n  all CD writing software besides Clone CD should work fine.\n\n  From our experience, the retail Xbox can only read DVD-RW's\n  and CD-RW's, so if you want to be sure that these will work\n  with a future mod, we recommend burning them to Rewritable\n  discs. We have heard reports of the retail Xbox reading some\n  types of DVD-R discs, but we have been unable to verify this.\n\n-X-- --- - ----------- -- -------- - - -- ------------- -------- --- --X-\n\n                _____ _____  ____   /____   __  ___/___  /\n               /_____)_____)/     //__    /      /    /\n           _ _/    /   _  /______/______/______/     /\n                              ___/              /        _ _\n\n","torrent":{"xt":"urn:btih:ab965e7493f656ac2bb4f9dcc5fe23d9bd12a613","amp;dn":"Azurik+Rise+of+Perathia+XBOX+-+ProjectX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab965e7493f656ac2bb4f9dcc5fe23d9bd12a613","infoHashBuffer":{"type":"Buffer","data":[171,150,94,116,147,246,86,172,43,180,249,220,197,254,35,217,189,18,166,19]},"announce":[],"urlList":[]}}