{"title":"The Simpsons Movie","uid":3780885,"size":4594937856,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:abf13d29fc4076507afd1857fb92ef3030baee9e&amp;dn=The+Simpsons+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"el_segundo","files":-1,"time":1187771588,"description":"Homer adopts a pig who&amp;#039;s run away from Krusty Burger after Krusty tried to have him slaughtered, naming the pig &quot;Spider Pig.&quot; At the same time, the lake is protected after the audience sink the barge Green Day are on with garbage after they mention the environment. Meanwhile, Spider Pig&amp;#039;s waste has filled up a silo in just 2 days, apparently with Homer&amp;#039;s help. Homer can&amp;#039;t get to the dump quickly so dumps the silo in the lake, polluting it. Russ Cargill, the villainous boss of the EPA, gives Arnold Schwarzenegger 5 options, forcing him to choose 4 (which is, unfortunately, to destroy Springfield) and putting a dome over Springfield to prevent evacuation. Homer, however, has escaped, along with his family. Can he stop the evil Cargill from annihilating his home town, and his family, who have been forced to return to Springfield? Written by movieguy3 \n\nThe city of Springfield orders a clean up of the polluted Lake Springfield and bans waste dumps there. However, someone forgot to tell Homer Simpson that, and when he dumps a silo of &quot;Pig Crap&quot; in it, he inadvertently dooms Springfield, his family, and himself.","torrent":{"xt":"urn:btih:abf13d29fc4076507afd1857fb92ef3030baee9e","amp;dn":"The+Simpsons+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf13d29fc4076507afd1857fb92ef3030baee9e","infoHashBuffer":{"type":"Buffer","data":[171,241,61,41,252,64,118,80,122,253,24,87,251,146,239,48,48,186,238,158]},"announce":[],"urlList":[]}}