{"title":"Heroes Season 2 (all 11 episodes!) DOWNLOAD THIS ONE","uid":3932044,"size":4037419212,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ac1a6b9bef0868e50a01b381fc72f3f41a05045c&amp;dn=Heroes+Season+2+%28all+11+episodes%21%29+DOWNLOAD+THIS+ONE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DannOrly","files":11,"time":1197541948,"description":"Same thing as this torrent:\n &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3920379/Heroes_Season_2_(all_11_episodes_)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3920379/Heroes_Season_2_(all_11_episodes_)&lt;/a&gt;\n\n\nExcept all the episodes, uhh... actually work. XD\n\nSorry about that guys.\n\nPick and choose to download episodes 2,3, and 5 if you wish. \n\n\n\n\n\n\n\n\nAll of season 2 of heroes. Check it out:\n\nSeason 2: 2007\n# \tTitle \tWriter(s) \tDirector \tOriginal air Date\n01 \t&quot;Four Months Later...&quot; \tTim Kring \tGreg Beeman \tSeptember 24, 2007\n\nThe story resumes four months after the first season&amp;#039;s finale. Mohinder has a run-in with the Company. The Bennets attempt to live under the radar in a new Californian town. Hiro meets his childhood hero Takezo Kensei. Twins Maya and Alejandro flee a murder charge in Honduras. A connection is uncovered between Kaito Nakamura and Angela Petrelli. \n02 \t&quot;Lizards&quot; \tMichael Green \tAllan Arkush \tOctober 1, 2007\n\nClaire fends off another student&amp;#039;s suspicions. Maya and Alejandro&amp;#039;s abilities are revealed as they make their way to Mexico. Mohinder encounters an old friend while on a mission for the Company. Hiro works to contain the damage caused by his journey into the past. And Peter falls in with Irish gangsters and he begins to rediscover his abilities. \n03 \t&quot;Kindred&quot; \tJ.J. Philbin \tPaul Edwards \tOctober 8, 2007\n\nMohinder searches for the last of Isaac Mendez&amp;#039;s paintings. Maya and Alejandro are separated. Hiro helps Kensei develop his skills and become the hero of legend. Niki and Micah leave Las Vegas to get away from their past. Claire discovers some of West&amp;#039;s secrets. Peter agrees to help the gangsters in order to discover his identity. \n04 \t&quot;The Kindness of Strangers&quot; \tTim Kring \tAdam Kane \tOctober 15, 2007\n\nAs Micah settles into his new home in New Orleans, his cousin Monica discovers her own ability. Matt enlists Nathan&amp;#039;s help to find the killer, and discovers something about his own past. Maya and Alejandro find a new travelling companion. Claire tries to balance family secrets with a burgeoning romance. \n05 \t&quot;Fight or Flight&quot; \tJoy Blake &amp; Melissa Blake \tLeslie Glatter \tOctober 22, 2007\n\nAs Peter contemplates opening the box, Elle tries to find where Peter is. Matt and Nathan visit Matt&amp;#039;s father in order to save Molly. Meanwhile Mohinder sends Molly back to the Company for a cure, much to Noah&amp;#039;s dismay. Monica tries out her new abilities. Ando tries to read the ancient messages given to him by Hiro. \n06 \t&quot;The Line&quot; \tAdam Armus &amp; Kay Foster \tJeannot Szwarc \tOctober 29, 2007\n\nPeter tries to track down the people who are hunting him. Meanwhile, Bob asks Mohinder to experiment on Monica. Back in time, Hiro and Kensei work to free Yaeko&amp;#039;s father, only to discover that there&amp;#039;s a much bigger threat behind White Beard&amp;#039;s army. \n07 \t&quot;Out of Time&quot; \tAron Eli Coleite \tDaniel Attias \tNovember 5, 2007\n\nPeter finds himself a year into the future, where 93% of the world&amp;#039;s population has died of the &quot;Shanti virus&quot;. West learns the man who abducted him is Claire&amp;#039;s father. Hiro defeats White Beard and returns to the present time. Matt, Nathan and Mohinder try to combat both Maury Parkman and the Shanti virus. The true identity of the mysterious &quot;Adam Monroe&quot; is revealed. \n08 \t&quot;Four Months Ago...&quot; \tTim Kring \tGreg Beeman \tNovember 12, 2007\n\nNathan pays a price for his previous heroic actions. After Peter survives the bomb scare in New York City, the Company sees him as a threat. D.L. makes the ultimate sacrifice for his family. Maya reveals her power, which leads her and Alejandro to America in search for help. \n09 \t&quot;Cautionary Tales&quot; \tJoe Pokaski \tGreg Yaitanes \tNovember 19, 2007\n\nThe Bennet family prepare to go on the run before the Company finds them. Hiro goes back in time and discovers who killed his father. Mohinder encounters Elle, forcing him to make a decision that could end up changing lives. Matt faces various obstacles as he deals with his expanding mental abilities. \n10 \t&quot;Truth &amp; Consequences&quot; \tJesse Alexander \tAdam Kane \tNovember 26, 2007\n\nPeter attempts to destroy the virus that wipes out most of Earth&amp;#039;s population. Hiro hunts his father&amp;#039;s killer. Maya must choose between Alejandro and Sylar. Niki has bad news for Micah. \n11 \t&quot;Powerless&quot; \tJeph Loeb \tAllan Arkush \tDecember 3, 2007\n\nPeter and Nathan Petrelli are reunited, but a battle erupts between them, Matt Parkman and Hiro Nakamura, set up by Adam Monroe. Monica Dawson is captured by a street gang, and Micah Sanders turns to his mother Niki for help. Maya Herrera learns Sylar&amp;#039;s true nature when he kidnaps Molly Walker and Mohinder Suresh. Elle plays the hero to get back into her father&amp;#039;s good graces. \t\t","torrent":{"xt":"urn:btih:ac1a6b9bef0868e50a01b381fc72f3f41a05045c","amp;dn":"Heroes+Season+2+%28all+11+episodes%21%29+DOWNLOAD+THIS+ONE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac1a6b9bef0868e50a01b381fc72f3f41a05045c","infoHashBuffer":{"type":"Buffer","data":[172,26,107,155,239,8,104,229,10,1,179,129,252,114,243,244,26,5,4,92]},"announce":[],"urlList":[]}}