{"title":"Last Action Hero - Arnold Swarzenegger AC3 Xvid","uid":3915487,"size":1363781632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aca056f4796db02e6eedbe325de30da13b33470c&amp;dn=Last+Action+Hero+-+Arnold+Swarzenegger+AC3+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DogNo7","files":-1,"time":1196456002,"description":"\nCampy, fun movie that pokes fun at the movie industry, and has a playful, jousting sort of feel to it.  What the morons rating the movie at the IMDB don't understand is that the movie is SATIRE.  The various apparent technical &quot;mistakes&quot; are intentional!  I won't spoil it, but if you watch, and pay attention, you will note some strangeness within the movie that is not spelled out, but is mentioned and discussed by the characters at the beginning of the film.  My only conclusion from the low rating this film got is that the majority of people are morons.\n\n\nFrom the Tome of the Infertile Virgin, The IMDB:\n\nYoung Danny Madigan is a big fan of Jack Slater, a larger-than-life action hero played by Arnold Schwarzenegger. When his best friend, Nick the projectionist, gives him a magic ticket to the new Jack Slater film, Danny is transported into Slater's world, where the good guys always win. One of Slater's enemies, Benedict the hitman, gets hold of the ticket and ends up in Danny's world, where he realises that if he can kill Schwarzenegger, Slater will be no more. Slater and Danny must travel back and stop him.\n\n\nMy rating: 7 out of 10 stars\n\n","torrent":{"xt":"urn:btih:aca056f4796db02e6eedbe325de30da13b33470c","amp;dn":"Last+Action+Hero+-+Arnold+Swarzenegger+AC3+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca056f4796db02e6eedbe325de30da13b33470c","infoHashBuffer":{"type":"Buffer","data":[172,160,86,244,121,109,176,46,110,237,190,50,93,227,13,161,59,51,71,12]},"announce":[],"urlList":[]}}