{"title":"Blaze Bayley Full Discography","uid":3917588,"size":428036228,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aca61345557dd9d970e48fb7e2960f2928b5a09f&amp;dn=Blaze+Bayley+Full+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"UrlikSkarsol","files":38,"time":1196576318,"description":"Blaze Bayley gets no respect.  Really.  If people have heard of him at all, it&amp;#039;s, at best &quot;that guy that sang for Iron Maiden when Bruce was gone&quot;.  He is unfairly maligned for the quality of the songs on the two Iron Maiden albums he sang on (I actually really like The X-Factor album, but whatever) which is ridiculous, since he didn&amp;#039;t write any of them.  So almost nobody seems to have even checked out any of his solo material.   Which is a mistake.  Because it really, really kicks ass.  \n\nThe style is very much what you&amp;#039;d expect: traditional heavy/power metal, with slight nods to both Priest and Maiden, though it doesn&amp;#039;t really have much that sounds like either other than occasional twin guitar passages.  Blaze has a REALLY unusual voice and that gives the material a much more distinctive feel than it might otherwise have; if this were sung by any of the zillion Halford/Dickinson/Tate styled vocalists typical of traditional metal the songs wouldn&amp;#039;t be nearly as ear-catching.  But they are, and they are.  Blaze Bayley is a lot more than a guy who filled in for Bruce Dickinson for a few years, just like Tim Owens is a lot more than a guy who filled in for Rob Halford for a few years (just listen to the last two Iced Earth albums, or Beyond Fear) and had a bad movie based on his story.  Blaze can&amp;#039;t just sing, he can write great songs.  \n\n\nIf you still like that old skool metal sound, you gotta check out the Blaze solo work.  \n\nEnjoy, and bang it &amp;#039;til it bleeds!","torrent":{"xt":"urn:btih:aca61345557dd9d970e48fb7e2960f2928b5a09f","amp;dn":"Blaze+Bayley+Full+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca61345557dd9d970e48fb7e2960f2928b5a09f","infoHashBuffer":{"type":"Buffer","data":[172,166,19,69,85,125,217,217,112,228,143,183,226,150,15,41,40,181,160,159]},"announce":[],"urlList":[]}}