{"title":"Google Earth Pro v4.1.7087 Incl Patch-DEC0DE","uid":3772004,"size":20082056,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:acb45bbb3617d68d4c0aff7c72085719870480dc&amp;dn=Google+Earth+Pro+v4.1.7087+Incl+Patch-DEC0DE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1187039651,"description":"Google Earth Pro harnesses the full power of the tool. Offering an expanded feature set, enhanced printing, and the fastest data delivery speed, it is the ultimate research, presentation and collaboration tool for geo-specific information. Google Earth Pro is used by successful, forward-thinking professionals to deliver complex data sets simply and clearly.\n\nWith Google Earth Pro, it?s easy to research locations and present your discoveries. In just a few clicks, you can import site plans, property lists or client sites and share the view with your client or colleague. You can even export high-quality images to documents or the web.\n\nAnnotate and visualize\n\nRepresent your location-based data using 3D drawing tools, or transfer up to 2,500 locations by address or geospatial coordinates from a spreadsheet. The GIS Data Importing Module lets you incorporate GIS data in file formats such as .shp and .tab. Examples include parcel, demographic, and 3D building data.\n\nShare and analyze\n\nShare your Google Earth views and data representations with your clients as a KML, Google Earth?s original file format. With your upgraded Pro subscription, you get additional measurement tools (square feet, mile, acreage, radius and so on), so simply select the points on the screen using your mouse and let Google Earth calculate the rest.\n\nCreate visually powerful presentations\n\nExport high-resolution images up to 11? x 17? 4800 pixels and use them in documents, presentations, web or printed materials. You audience can come along for the ride as you create your own compressed movies of the zooms and virtual tours you take in Google Earth.\n\nUseful for many industries\n\nWhether you?re in commercial real estate, insurance or media, Google Earth Pro lets you represent geo-specific information to full dramatic effect.","torrent":{"xt":"urn:btih:acb45bbb3617d68d4c0aff7c72085719870480dc","amp;dn":"Google+Earth+Pro+v4.1.7087+Incl+Patch-DEC0DE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acb45bbb3617d68d4c0aff7c72085719870480dc","infoHashBuffer":{"type":"Buffer","data":[172,180,91,187,54,23,214,141,76,10,255,124,114,8,87,25,135,4,128,220]},"announce":[],"urlList":[]}}