{"title":"End Game - By Alex Jones","uid":3887073,"size":1707133702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aceb9e66438965e82b9a76c78af742f16cccb84d&amp;dn=End+Game+-+By+Alex+Jones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UncleUnko","files":1,"time":1194916125,"description":"iPod formatted version of ENDGAM3 By Alex Jones!\n\nThis M4V file plays in just about every media player including iTunes, QuickTime, Media Player in Windows, and etc. etc. \n\nThis is a film that EVERY American should see! It&amp;#039;s NOT just for people who like political films like Arron Russo&amp;#039;s &quot; Freedom To Facism &quot; and etc.  YOU really NEED to watch this film!\n\n\nHost Site:\nh t t p : / / w w w . e n d g a m e t h e m o v i e . c o m \n\nSite Blurb:\n\nFor the New World Order, a world government is just the beginning. Once in place they can engage their plan to exterminate 80% of the world&amp;#039;s population, while enabling the &quot;elites&quot; to live forever with the aid of advanced technology. For the first time, crusading filmmaker ALEX JONES reveals their secret plan for humanity&amp;#039;s extermination: Operation ENDGAME.\n\nJones chronicles the history of the global elite&amp;#039;s bloody rise to power and reveals how they have funded dictators and financed the bloodiest wars?creating order out of chaos to pave the way for the first true world empire.\n\n\n    * Watch as Jones and his team track the elusive Bilderberg Group to Ottawa and Istanbul to document their secret summits, allowing you to witness global kingpins setting the world&amp;#039;s agenda and instigating World War III.\n\n    * Learn about the formation of the North America transportation control grid, which will end U.S. sovereignty forever.\n\n    * Discover how the practitioners of the pseudo-science eugenics have taken control of governments worldwide as a means to carry out depopulation.\n\n    * View the progress of the coming collapse of the United States and the formation of the North American Union.\n\n\nNever before has a documentary assembled all the pieces of the globalists&amp;#039; dark agenda. Endgame&amp;#039;s compelling look at past atrocities committed by those attempting to steer the future delivers information that the controlling media has meticulously censored for over 60 years. It fully reveals the elite&amp;#039;s program to dominate the earth and carry out the wicked plan in all of human history.\n\n\nEndgame is not conspiracy theory, it is documented fact in the elite&amp;#039;s own words.\n\n\n\n-- \nGo here for related research videos: w w w . y o u t u b e . c o m / p r o f i l e _ p l a y _ l i s t ? u s e r = T e s s e l a t o r\n\n","torrent":{"xt":"urn:btih:aceb9e66438965e82b9a76c78af742f16cccb84d","amp;dn":"End+Game+-+By+Alex+Jones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aceb9e66438965e82b9a76c78af742f16cccb84d","infoHashBuffer":{"type":"Buffer","data":[172,235,158,102,67,137,101,232,43,154,118,199,138,247,66,241,108,204,184,77]},"announce":[],"urlList":[]}}