{"title":"O Vingador (A Man Apart) 2003 DVDRip Dual Audio By Bozano","uid":4009751,"size":734552985,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad4918d78a4ffd2c06148ed6eb2435c6ecca7fbb&amp;dn=O+Vingador+%28A+Man+Apart%29+2003+DVDRip+Dual+Audio+By+Bozano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bozano","files":3,"time":1202019168,"description":"ApÃƒÂ³s realizar a prisao do principal chefe do trafico de drogas que opera na fronteira dos EUA com o Mexico, um policial precisa enfrentar um novo traficante que deseja ser o novo chefe do local e acaba o privando de sua maior alegria: sua esposa. Dirigido por F. Gary Gray (Sexta-Feira em Apuros) e com Vin Diesel no elenco.\n\n\nSean Vetter and Demetrius Hicks are members of the DEA who are fighting an ongoing drug war on the California/Mexico border, they are most successful at it because of their edge of growing up on the street and being thugs converted to cops. The DEA busts one of the major players by the name of &quot;Memo&quot; Lucero and imprison him in the United States but then a major player named Diablo then takes over the business and now he is now the major player targeted by Vetter and his team. But when Vetter&amp;#039;s wife is killed in a botched hit organized by Diablo, he seeks revenge against those responsible and in the process has to seek help from the imprisoned Lucero in order to catch Diablo. But in the process, Vetter and Hicks have to fight their way up the chain to get to Diablo but it&amp;#039;s easier said than done when all Vetter can focus on is revenge...\n\nEnjoy... :)","torrent":{"xt":"urn:btih:ad4918d78a4ffd2c06148ed6eb2435c6ecca7fbb","amp;dn":"O+Vingador+%28A+Man+Apart%29+2003+DVDRip+Dual+Audio+By+Bozano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad4918d78a4ffd2c06148ed6eb2435c6ecca7fbb","infoHashBuffer":{"type":"Buffer","data":[173,73,24,215,138,79,253,44,6,20,142,214,235,36,53,198,236,202,127,187]},"announce":[],"urlList":[]}}