{"title":"Ouija.CVCD_BY_Dandora","uid":3754005,"size":813766740,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad9f6a57e4d339f3dbd5e60891237541de9ce948&amp;dn=Ouija.CVCD_BY_Dandora&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dandora","files":1,"time":1185496871,"description":"SINOPSIS\n\nClara, una joven y atractiva estudiante de periodismo, acaba de llegar al pueblo donde va a pasar sus vacaciones. Al poco de llegar conocera a Victor, un apasionado de las ciencias ocultas que rapidamente quedara fascinado por los encantos de su nueva amiga. Juntos formaran un grupo de jovenes que se reuniran para vivir una experiencia divertida a la vez que peligrosa: Hacer una sesion OUIJA.\n\nPara sorpresa de todos, la tabla empieza a moverse desde el principio. Un enigmatico ser, que dice llamarse AUDSCIAS se comunica con los jovenes a traves de la ouija, proponiendoles juegos eroticos e insinuantes que provocan la curiosidad de todos. Una sesion tras otra el extraÃƒ?Ã‚Â±o ser pierde paulatinamente su aparente inocencia y empieza a poner a prueba a los participantes, exigiendoles que hagan cosas para el. Uno de ellos se rebela y, poco despues, sufre un brutal accidente.\n\nEl grupo se divide entre los que creen que ha sido una casualidad y los que creen que es un castigo de ese tal Audscias.\n\nA partir de este momento una serie de extraÃƒ?Ã‚Â±os acontecimientos se sucederan en torno al grupo. Todos desconfian de todos y ya nadie esta seguro de lo que realmente ocurre. La unica forma de averiguar la verdad y terminar con toda esta pesadilla es seguir haciendo OUIJA. \n\n","torrent":{"xt":"urn:btih:ad9f6a57e4d339f3dbd5e60891237541de9ce948","amp;dn":"Ouija.CVCD_BY_Dandora","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad9f6a57e4d339f3dbd5e60891237541de9ce948","infoHashBuffer":{"type":"Buffer","data":[173,159,106,87,228,211,57,243,219,213,230,8,145,35,117,65,222,156,233,72]},"announce":[],"urlList":[]}}