{"title":"The Cincinnati Kid [El Rey del Juego][Multilang+multisub]","uid":3946236,"size":6124333917,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ae3c03a35ee583bab4580891e4904ec45328eb21&amp;dn=The+Cincinnati+Kid+%5BEl+Rey+del+Juego%5D%5BMultilang%2Bmultisub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"doroteoteo","files":22,"time":1198501309,"description":"El Rey del Juego\n\n[img]http://i41.photobucket.com/albums/e267/lurdo/portadas/El_Rey_Del_JuegoCOVER.jpg[/img]\n\nSinopsis\nUn par de palabras para cualquiera que se sienta en la mesa a jugar al pÃƒÂ³quer con Kid: Jugar y llorar.Steve McQueen interpreta el papel de Cincinnati Kid, un insignificante, codicioso, pero excelente jugador de cartas. Kid tendrÃƒÂ¡ que aprovechar la oportunidad de enfrentarse con el mejor jugador de pÃƒÂ³quer de todos los Estados Unidos, el Rey (Edward G. Robinson). Norman Jewison ( En le calor de la noche, Hechizo de luna) dirige esta tensa exploraciÃƒÂ³n de partidas clandestinas de pÃƒÂ³quer, creando un gran suspense en cada una de las cartas que van siendo descubiertas.\nAnn- Margret, Karl Marlden, Rip Torn, Joan Blondell (ganadora del galardÃƒÂ³n a la mejor actriz secundario por la National Board of Review) y muchos mÃƒÂ¡s componen un reparto que es el pÃƒÂ³quer de ases de El Rey del Juego. Ã‚Â¡Agarra una silla y ponte a jugar!..\n\n\n\nSynopsis (in English)\n\nSteve McQueen brings his cool fire to the role of the Cincinnati Kid, a small-timer eager to take his chances in high-stakes poker. He gets his chance. Regal, ruthless   Lancey Howard (Edward G. Robinson), the elite gambler called the Man, accepts the KidÃ‚Â´s challenge. Norman Jewison (In the Heat of the Night, Moonstruck) directs this taut exploration of back-room gaming, building suspense with each turn of a card. And Ann-Margret, Karl Malden, Rip Torn, National Board of Review Best Supporting Actress Award winner Joan Blondell and many more comprise a full house of talent. Grab a chair and ante up..\n\n\nDirector Norman Jewison\n\nActores Steve McQueen, Edward G. Robinson, Ann-Margret, Karl Malden, Tuesday Weld, Cab Calloway, Jack Weston, Rip Torn\n\nDuraciÃƒÂ³n 99 min\n\nVideo Pal\n1.85:1 , 16:9\n\nIdiomas Audio Dolby Digital Mono: EspaÃƒÂ±ol, InglÃƒÂ©s, AlemÃƒÂ¡n\n\nSubtÃƒÂ­tulos InglÃƒÂ©s, AlemÃƒÂ¡n, EspaÃƒÂ±ol, PortuguÃƒÂ©s, DanÃƒÂ©s, FinlandÃƒÂ©s, Sueco, Hebreo, Polaco, Checo, Croata, Esloveno, Griego, HÃƒÂºngaro, Turco, IslandÃƒÂ©s, Noruego, InglÃƒÂ©s para sordos, AlemÃƒÂ¡n para sordos\n\nOtras caracterÃƒÂ­sticas\n\nMenÃƒÂºs interactivos, Acceso directo a escenas, Comentario del director Norman Jewison, Comentarios de escenas especÃƒÂ­ficas de Phil Gordon y Dave Foley (Presentadores de &quot;Celebrity Poker Showdown&quot;, Documental\n\nFULL DVD9\n\nMore info in solodvd org\n\nVERIFICACION\n[IMG]http://i41.photobucket.com/albums/e267/lurdo/album%20name/Elreydel.jpg[/IMG]","torrent":{"xt":"urn:btih:ae3c03a35ee583bab4580891e4904ec45328eb21","amp;dn":"The+Cincinnati+Kid+%5BEl+Rey+del+Juego%5D%5BMultilang%2Bmultisub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae3c03a35ee583bab4580891e4904ec45328eb21","infoHashBuffer":{"type":"Buffer","data":[174,60,3,163,94,229,131,186,180,88,8,145,228,144,78,196,83,40,235,33]},"announce":[],"urlList":[]}}