{"title":"Escape of the Living Dead - Complete","uid":4015304,"size":72052280,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:af011246f4e61efc999aa706dc85ae2176a61845&amp;dn=Escape+of+the+Living+Dead+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Rheyvan","files":6,"time":1202326469,"description":"It is 1971, and it&amp;#039;s been three years since the blood soaked night that the dead rose from their graves, attacking and devouring the living. Now, the legacy of that horrific and unexplained event is about to be unleashed once again upon an unsuspecting world. But this time, there may be no escape for those in the terrifying clutches of the cannibalistic living dead! Hidden within the concrete walls of a secret medical research lab, someone has been studying the last remaining undead remnants of the marauding zombie army. Unleashed by the untimely intervention of a group of road weary bikers looking for an easy score, the walking dead renew their gut ripping campaign of terror. As each member of a rural community dies in the grotesque feeding frenzy of the zombies, so does the nightmare army grow as half-eaten victims rise up to join the ranks of the undead. Can anything possibly contain the contagion being spread by the escape of the living dead? Written by John Russo, who co-wrote the screenplay for Night Of The Living Dead with George Romero.","torrent":{"xt":"urn:btih:af011246f4e61efc999aa706dc85ae2176a61845","amp;dn":"Escape+of+the+Living+Dead+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af011246f4e61efc999aa706dc85ae2176a61845","infoHashBuffer":{"type":"Buffer","data":[175,1,18,70,244,230,30,252,153,154,167,6,220,133,174,33,118,166,24,69]},"announce":[],"urlList":[]}}