{"title":"TransFormers Animated DVD NTSC [MB3]","uid":3977558,"size":4293935988,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af94e04d1f3c63c9ab34bfc5da470bd40ac32f3f&amp;dn=TransFormers+Animated+DVD+NTSC+%5BMB3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Blockhead420","files":87,"time":1200362219,"description":"   TransFormers Animated Vol1 DVD NTSC\n\n   Series.........: Transformers Animated\n   Episodes.......: 1-4\n   Extras.........: TV Spot and Commercial Bumpers\n\n   Video:\n   Format.........: NTSC\n   Fps............: 29.97\n   Resolution.....: 720x480\n\n   Audio:\n   Language.......: English\n   Hertz..........: 48KHz\n   Bitrate........: VBR 192Kbps\n\nTransformers Animated - The Cartoon Series\n\nThe Official Series Description\n\nOn their home planet of CYBERTRON, OPTIMUS PRIME and his crew AUTOBOTS are not heroes, they are loyal, dedicated, resourceful, hard-working, fun-loving \\&amp;#039;regular bots.\\&amp;#039;\n\nOPTIMUS PRIME dreams of excitement, adventure and somehow making a difference in the galaxy. Given his first command in an unremarkable sector of CYBERTRONIAN space over a ragtag crew of misfits including: BULKHEAD a lovable, gentle-giant \\&amp;#039;strong-bot\\&amp;#039;, BUMBLEBEE a wise-cracking, over-eager \\&amp;#039;hyper-bot, PROWL an instinctual, intense \\&amp;#039;inja-bot\\&amp;#039;, and RATCHET a crusty, battle-hardened \\&amp;#039;medi-bot.\\&amp;#039;\n\nOPTIMUS PRIME gets more than he bargained for when the AUTOBOTS answer a routine distress call and suddenly find themselves in possession of CYBERTRON\\&amp;#039;s most precious and powerful artifact, the ALLSPARK. The ALLSPARK is being pursued across the galaxy by the megalomaniacal MEGATRON and his army of ruthless DECEPTICONS, a brutal race of war-mongering robots who seek to use the ALLSPARK as their ultimate weapon of destruction.\n\nIt\\&amp;#039;s a struggle for the plucky and unseasoned band of AUTOBOTS, but despite overwhelming odds, OPTIMUS PRIME and his crew manage to obliterate MEGATRON\\&amp;#039;s ship and save the ALLSPARK, only to have their own battle-damaged ship crash land on a remote backwater planet known as Earth.\n\nResponding to an industrial disaster, the AUTOBOTS \\&amp;#039;blend-in\\&amp;#039; with their new surroundings by scanning and assuming the form of the local emergency vehicles. But it doesn\\&amp;#039;t take long before they\\&amp;#039;re changing back to robot mode and utilizing their unique individual powers: OPTIMUS PRIME\\&amp;#039;s versatile gadgetry, BULKHEAD\\&amp;#039;s strength, BUMBLEBEE\\&amp;#039;s energy stingers, PROWL\\&amp;#039;s stealth, and RATCHET\\&amp;#039;s magnetism to save the day.\n\nThe AUTOBOTS unlikely guide through human society is a brash, energetic 8-year-old girl named Sari Sumdac, the adopted daughter of a robotics magnate. Setting the AUTOBOTS up with their headquarters in an old abandoned auto plant on the outskirts of town, Sari not only becomes an \\&amp;#039;honorary AUTOBOT\\&amp;#039; by enlightening them on such mysteries of Earth life such as megamalls, holovision, hoverboards, junk food, and basic hanging out, but also becomes a vital component of the team in their adventures. For the ALLSPARK endows Sari with a very special power, one the DECEPTICONS would love to get their hands on, not to mention the ALLSPARK itself.\n\nAnd before they know it, the AUTOBOTS are not just heroes in the eyes of the humans, they\\&amp;#039;re superheroes! Sworn to protect the ALLSPARK and their newly adopted home, the AUTOBOTS now have a huge responsibility to CYBERTRON and a super reputation to live up to on Earth.\n\n   Enjoy!!!\n   [MB3] aka [Blockhead] aka [Asgard]","torrent":{"xt":"urn:btih:af94e04d1f3c63c9ab34bfc5da470bd40ac32f3f","amp;dn":"TransFormers+Animated+DVD+NTSC+%5BMB3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af94e04d1f3c63c9ab34bfc5da470bd40ac32f3f","infoHashBuffer":{"type":"Buffer","data":[175,148,224,77,31,60,99,201,171,52,191,197,218,71,11,212,10,195,47,63]},"announce":[],"urlList":[]}}