{"title":"BLACK OAK ARKANSAS-Definitive Rock Collection [2cd / Anthology]","uid":3975828,"size":162279132,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b181d0414a68b32979da26582b12405c75112269&amp;dn=BLACK+OAK+ARKANSAS-Definitive+Rock+Collection+%5B2cd+%2F+Anthology%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"badbigdog","files":-1,"time":1200265564,"description":"D I S C  1\n01. Uncle Lijiah \n02. Hot And Nasty \t\n03. Lord Have Mercy On My Soul \t\n04. When Electricity Came To Arkansas \t\n05. Keep The Faith \t\n06. Fever In My Mind \t\n07. White Headed Woman \t\n08. Gravel Roads \t\n09. Fertile Woman \t\n10. Mutants Of The Monster \t\n11. Gettin' Kinda Cocky \t\n12. Hot Rod \n13. Swimmin' In Quicksand \t\n14. Happy Hooker \n15. Red Hot Lovin' \t\nD I S C  2\n01. Jim Dandy \t\n02. High 'N' Dry \t\n03. Sting Me \t\n04. Son Of A Gun \t\n05. Dixie \n06. Everybody Wants To See Heaven 'Nobody Want To Die' \t\n07. Taxman \t\n08. Fancy Nancy \t\n09. Back Door Man \t\n10. Diggin' For Gold \t\n11. Cryin' Shame \t\n12. Hey Ya'll \t\n13. Strong Enough To Be Gentle \t\n14. Rock 'N' Roll \t\n15. So You Want To Be A Rock 'N' Roll Star ---------------------------------------------------------------BLACK OAK ARKANSAS is an American Southern rock band named after the band's hometown of Black Oak, Arkansas. The band reached the height of its fame in the 1970s with ten charting albums released in that decade. Their style is punctuated by multiple guitar players and the raspy voice and on-stage antics of vocalist Jim &quot;Dandy&quot; Mangrum. The group, originally called &quot;The Knowbody Else&quot;, was formed in 1965 in Black Oak, Arkansas, by Jim &quot;Dandy&quot; Mangrum (vocals), Rickie Reynolds (guitar), Stanley Knight (guitar), Harvey Jett (guitar), Pat Daugherty (bass), and Wayne Evans (drums). Their first PA system was stolen from a local high school. Members of the group were subsequently charged in absentia with grand larceny and sentenced to 26 years at the Tucker Prison Farm (this sentence was later suspended). This led to their retreat to the hills of rural northeast Arkansas where they lived off the land and refined their musical style. Some of their influences during this time were The Beatles and The Byrds.\n\nThe Knowbody Else moved to Memphis, Tennessee in 1969 and signed a record deal with Stax Records. Their self-titled debut album, and their only album with Stax, was largely ignored by the populace. During this time the band became interested in psychedelia and Eastern spiritualism which, combined with their Southern Baptist upbringing, contributed to their sound.\n\nAfter several trips to Los Angeles, California in 1970, the band was signed by Atco Records and rechristened &quot;Black Oak Arkansas&quot;. Their self-titled debut album Black Oak Arkansas was released in 1971 while the band toured extensively, gaining a reputation as a live act. The twin album releases that followed in 1972, Keep The Faith and If An Angel Came To See You, Would You Make Her Feel At Home, expanded on the groupÃƒÂ¢??s eclectic musical style.\n\nIn 1973, Black Oak Arkansas released their fourth album Raunch 'N' Roll Live and introduced a new drummer, Tommy Aldridge. It was their fifth album High on the Hog, released later that year, that established solid commercial success by peaking at number 52 on the Billboard charts. Vocalist Ruby Starr also toured with the band during this period. Her raspy voice can be heard on the group's remake of LaVern Baker's 1957 hit &quot;Jim Dandy,&quot; which reached number 25 on Billboard's Hot 100.\n\nThe 1974 release &quot;Street Party&quot; may have failed to maintain the momentum, however, another 1974 release entitled &quot;Early Times&quot;, an overlooked Stax recording, made up for lost time. In 1975 the original lineup of Black Oak Arkansas (minus Harvey Jett, who was replaced by Jimmy Henderson) released their last album, Ain't Life Grand. A new version of the band called &quot;Black Oak&quot; was formed in 1977 around Jim &quot;Dandy&quot; Mangrum and Jimmy Henderson. Greg Reding (guitar and keyboards), Jack Holder (guitar), Andy Tanas (bass), and Joel Williams (drums) participated on the two Capricorn albums which were recorded in 1977 (Race with the Devil) and 1978 (I'd Rather Be Sailing.) In 1978, guitarist Shawn Lane joined the band at age 14 and toured with the band for four years.\n\nReleased in 1984, Ready, as Hell debuted a heavier sound with pinch harmonics and keyboards featured throughout. The album also marked the return of Rickie Lee Reynolds on rhythm guitar. In 1986, The Black Attack Is Back continued the heavy style of the previous album and featured the particularly adventurous track &quot;I Want A Woman With Big Titties&quot;.\n\nJames Mangrum has continued recording and touring with a series of different Black Oak lineups up to present day. Black Oak Arkansas currently enjoys a loyal fan following. However, the later lineups have yet to duplicate the level of album sales that the original lineup generated in the early-mid 1970s. Jim Dandy is credited with inspiring Van Halen frontman David Lee Roth's image and onstage persona as well. [ W I K I P E D I A http://en.wikipedia.org/wiki/Black_Oak_Arkansas ]","torrent":{"xt":"urn:btih:b181d0414a68b32979da26582b12405c75112269","amp;dn":"BLACK+OAK+ARKANSAS-Definitive+Rock+Collection+%5B2cd+%2F+Anthology%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b181d0414a68b32979da26582b12405c75112269","infoHashBuffer":{"type":"Buffer","data":[177,129,208,65,74,104,179,41,121,218,38,88,43,18,64,92,117,17,34,105]},"announce":[],"urlList":[]}}