{"title":"Svobodnoe Plavanie (Free Floating)","uid":3769256,"size":3914168320,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1e0a0c38962aa912bd1ca7ebdc4f39f32dfa06e&amp;dn=Svobodnoe+Plavanie+%28Free+Floating%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kmarx","files":1,"time":1186789268,"description":"Svobodnoe plavanie (Free Floating)\n------------------------------------------\n\nAs the town\\&amp;#039;s only factory gets closed down, a young worker is to find his new future ÃƒÂ¢?? without having much to choose from. \n\nA great Russian indie flick. Think Ghost World, minus the Jewish sophistication.\n\nPAL\nRussian sound only, no subs.\n\n-------------------------------\nDirector:Boris Khlebnikov\nWriter:Boris Khlebnikov \n-------------------------------\nRuntime: 101 min \nCountry:Russia \nLanguage:Russian \nAspect Ratio:1.37 : 1\nCompany:Koktebel Film Company\n\n------------------------------\n\nReview by: zioshech from United States \n\nThis movie was shot on location in a small Russian backwater town called Myshkin, which is located on the banks of the Volga River, far away from the bustling business world of Moscow. It opens with a very long still shot of a bum sitting in front of decaying Soviet-era factory gates, setting up the extremely slow pace and down-to-earth feel of the rest of the movie. In the hands of a different director, static shots that seem to linger for minutes would have proved excruciating, but in Free Floating, Boris Khlebnikov, makes you feel like you are living each frame of the movie. The true to life sounds combine with the dynamic visuals to create an ultra-realistic sensation. At one point in the movie I felt like I was riding a rusty bicycle down a dirt road with the main character, and at another I felt the old bus lurching as the driver shifted gears. But the real magic of this movie comes from the subtle and not so subtle ironies, and the language of the characters. Evgeniy Sytyy, who plays one of the employer characters whom the main character Lyonya encounters as he searches for work, delivers hilarious inspirational speeches, which apparently he improvised for every take. Unfortunately, the subtitles in the version of the movie that I saw were completely inadequate, and if you don\\&amp;#039;t speak Russian you will miss out on a lot.\n\nIn an ENTERKINO Russian interview by Olesya Kurpyaeva, the director aptly described some of the spirit that went into making Free Floating... \n\n\\&quot;Everything happened kind of naturally. For example, I tell my cinematographer, let\\&amp;#039;s try to shoot in the style of a rural comic book, complete simplicity with absolutely dumb shots: people come in, people leave, a dog runs in, yawns, scratches -- just fixating life. Then came the idea that the film should be like an old hand organ -- turning very slowly, the music playing, the pictures changing...\\&quot; \n\nYet, like in a good comic book every picture carried the story forward and contained a tasty morsel that could be savored for a few minutes. Even if you don\\&amp;#039;t speak Russian, and don\\&amp;#039;t particularly care for the plight of jobless youths in post-Soviet provincial Russia, you will enjoy living with the people in this meandering tale.","torrent":{"xt":"urn:btih:b1e0a0c38962aa912bd1ca7ebdc4f39f32dfa06e","amp;dn":"Svobodnoe+Plavanie+%28Free+Floating%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1e0a0c38962aa912bd1ca7ebdc4f39f32dfa06e","infoHashBuffer":{"type":"Buffer","data":[177,224,160,195,137,98,170,145,43,209,202,126,189,196,243,159,50,223,160,110]},"announce":[],"urlList":[]}}