{"title":"Rare Earth","uid":4003583,"size":6252331,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b24ef6e3fd0790eacc5e6e57edbe70386e807f73&amp;dn=Rare+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ghostWolf","files":4,"time":1201703286,"description":"Record company: Rare Earth ? EMI\nYear:1971\nProducer: Rare Earth\nBand: Rare Earth\nVinyl Single\nTracks:\n\tSide A: Hey Big Brother\n\tSide B: Under God\\&amp;#039;s Light\n\n\nThe History of Rare Earth\nIn 1961 a group of high school buddies formed a band and called it \\&quot;The Sunliners\\&quot;.\nAfter playing for about seven years the group decided to change the name of the band. Hence forth comes \\&quot;Rare Earth\\&quot;.\nMotown Record Corporation approached Rare Earth in the latter part of 1968 to sign a recording contract. \nAt first the group was reluctant to sign because of knowing of other white groups and artists before them that had \nnot had any success because Motown was geared for promotion and distrubution in the black market only. \nIt was when Motown decided they wanted to launch a new division of Motown to cater to white artists that Rare Earth started \nto seriously consider signing.\nMotown did not have a name for the new division and lable so jokeingly the band suggested the name Rare Earth. Unbelieveably they agreed. \nThat convinced the band that Motown was serious about making Rare Earth their first successful white band and they were going to sign more \nwhite acts to be on the \\&quot;Rare Earth\\&quot; Label. \nTo clear up a long time false statement that Rare Earth was the only white act to ever be signed with Motown, Rare Earth was the one and only \nsuccessful white band to be signed with Motown. Rare Earth was with Motown from 1968 to 1978.\n\nMotown wanted an album from Rare Earth immediately after signing.\nRare Earth was playing bars for several years prior to signing with Motown. Motown music at that time was very strong on the radio \nso Rare Earth was playing a lot of Motown songs in clubs. Thus the bands roots developed from R&amp;B music. \nMost people in the beginning thought Rare Earth to be black. Surprise, surprise. \nThe band had been playing the song \\&quot;Get Ready\\&quot; in clubs for about a year or two prior to recording it. \nIt started out a 3 minute song until one member took a solo and then everyone wanted a solo so over time the song became 21 minutes long. \nIt became the closing song each night and people liked it so much they would stay just to hear it.\nThe band decided that \\&quot;Get Ready\\&quot; would be Rare Earth\\&amp;#039;s first recording, to be 21 minutes long and to be one whole side of the first album. \nMotown was leary about doing this but the band insisted because radio was starting to play album cuts which were longer than the normal 3 minute single. \n\\&quot;Get Ready\\&quot; first broke in Washington D.C. in the black market, spread across the country and eventually into the white market.\nIt was a huge hit selling millions of records and remaining on the charts for almost 3 years. \nSome of Rare Earth\\&amp;#039;s other hits from 1969 to 1974 were songs such as \\&quot;Big Brother\\&quot;,\\&quot;Born to wander\\&quot;, \\&quot;Tobacco road\\&quot;, \\&quot;Losin You\\&quot;, and \n\\&quot;I Just Want To Celebrate\\&quot;.\n &lt;a href=&quot;\nhttp://www.rareearth.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rareearth.com&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b24ef6e3fd0790eacc5e6e57edbe70386e807f73","amp;dn":"Rare+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b24ef6e3fd0790eacc5e6e57edbe70386e807f73","infoHashBuffer":{"type":"Buffer","data":[178,78,246,227,253,7,144,234,204,94,110,87,237,190,112,56,110,128,127,115]},"announce":[],"urlList":[]}}