{"title":"Best of the WinMX years [ElgerHz]","uid":3759890,"size":25428124,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:b301e03bb69c01dbb035fa21238f5bc59ebdc528&amp;dn=Best+of+the+WinMX+years+%5BElgerHz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ElgerHz","files":1,"time":1185998214,"description":"I currently have a LOT of porn on my computer, and in order to make room for some more, I have to burn some of it to CD/DVD. But before I do that I thought I would take some of the porn and create and uplopad some torrents, starting with the oldest stuff first.\n\nA long time ago, WinMX was the king of the P2P file sharing programs, this was mainly because it was totally free, it didn&amp;#039;t use a lot of resources and it didn&amp;#039;t have any spyware or other nasty things included. \nBut unfortunately the popularity of WinMX gradually got lower, the reasons for this was the vast amount of fake files that appeared and that there were so many users who didn&amp;#039;t share files - something which led to more download attempts towards users who actually DID share. The result of this was endless download queues and a lot of traffic directed to all those who shared. This could however be solved by installing MXmonitor which was a program that filtered out all the leeches/freeloaders, but the problem now was that the WinMX and MXmonitor combination used a LOT of computer resources.\n\nFinally I got tired of the whole thing and I started using Limewire instead, but I eventually got tired of that too, and in the end I started downloading torrents with Azureus instead.\n\n\nAnyway, included in this collection are some of the very first porn I ever downloaded by using WinMX, and it consists of a rag bag mix of 460 pictures with various sizes, qualities and ages of the girls depicted. As far as I know, all persons on these pictures are at the age of 18 or above, there are however a couple of pictures where the girls might be below 18, but these are nonude images.\n\nEnjoy!\n\n\nCheck out my other torrents here:  &lt;a href=&quot;\nhttp://www.thepiratebay.se/user/ElgerHz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thepiratebay.se/user/ElgerHz&lt;/a&gt;","torrent":{"xt":"urn:btih:b301e03bb69c01dbb035fa21238f5bc59ebdc528","amp;dn":"Best+of+the+WinMX+years+%5BElgerHz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b301e03bb69c01dbb035fa21238f5bc59ebdc528","infoHashBuffer":{"type":"Buffer","data":[179,1,224,59,182,156,1,219,176,53,250,33,35,143,91,197,158,189,197,40]},"announce":[],"urlList":[]}}