{"title":"Monsanto vs. Percy Schmeiser","uid":3759905,"size":27839416,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b35961d492af9c9e9b4c16c0cf91978d4e0ebd6a&amp;dn=Monsanto+vs.+Percy+Schmeiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brygge_","files":3,"time":1185999502,"description":" MONSANTO VS. PERCY SCHMEISER\nReport on the lawsuit that challenges the ownership of life by corporations\nPercy Schmeiser and Ignacio Chapela\nMonsanto, the giant multinational agro-chemical company, sued Percy Schmeiser over the presence of their patented canola that had invaded the edges of Schmeiser&amp;#039;s field from a neighbor&amp;#039;s plot. The Schmeiser case has become one of the most watched and most important cases for organic farmers, seed savers, for the movement against the invasion of the biosphere by genetically modified plants, and against corporate ownership of life.\n\nSchmeiser was recorded in Ukiah, CA, in November 2006. He gave a report of his multi-year legal battle to save his land and home, and his 50 year legacy as plant breeder from being seized by Monsanto over 12 pounds of invading seeds. After two shattering losses in court he finally won a partial victory in the Canadian Supreme Court. However the court upheld Monsanto&amp;#039;s patent rights - even when their genetically modified canola invades another field or cross pollinates with organic or pedigree canola or even their relatives. Any invaded organism becomes the property of Monsanto as well. Under globalization the patent rights may apply to the US as well.\n\nPercy Schmeiser is a Canadian farmer from Bruno, Saskatchewan. He took over the family farm in 1947. He and his wife are known on the Prairies as seed savers. Over 50 years they developed a canola seed that was resistant to disease and lost their life&amp;#039;s work by contamination from genetically modified canola. &lt;http://www.percyschmeiser.com&gt;\n\nIn part TWO Percy Schmeiser shares the stage with Ignacio Chapela, from UC Berkeley. In October 2000 Chapela discovered the contamination of Mexican corn with Monsanto GMO corn.\n\nRelated downloads: &lt;a href=&quot;\nhttp://thepiratebay.se/user/brygge_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/brygge_&lt;/a&gt;","torrent":{"xt":"urn:btih:b35961d492af9c9e9b4c16c0cf91978d4e0ebd6a","amp;dn":"Monsanto+vs.+Percy+Schmeiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b35961d492af9c9e9b4c16c0cf91978d4e0ebd6a","infoHashBuffer":{"type":"Buffer","data":[179,89,97,212,146,175,156,158,155,76,22,192,207,145,151,141,78,14,189,106]},"announce":[],"urlList":[]}}