{"title":"Apex Video Converter Super 5.86 [eNJoY-iT]","uid":3757031,"size":15982637,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b429cecbb9f23b22f3492bf01968908ae82086a7&amp;dn=Apex+Video+Converter+Super+5.86+%5BeNJoY-iT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sunblock","files":1,"time":1185736474,"description":"Apex Video Converter Super is designed to meet all your needs of convert file .It supports to convert your favorite video from AVI, MOV, QuickTime, MPEG, WMV, ASF, RM, RMVB, VCD, DVD to AVI, MPEG, VCD, DVD, MOV, RM, RMVB, WMV, ASF, iPod, PSP, 3GP, Xbox, PPC, PMP, Flash SWF, Flash FLV, Youtube FLV, MP3 Audio, WMA Audio, WAV Audio, MP2 Audio, GIF Animation and GIF, BMP EPS, JPG, PCX, PSD, PDF, TIFF, WMF, EMF, PNG, J2K Picture formats. \n\nExtremely fast conversion speed and friendly user interface let you convert video files between many formats with ease. The powerful features and unbeatable price make Apex Video Converter Super an affordable and powerful video conversion solution on personal computer. \n\nApex Video Converter Super supports batch files conversion, specifies start and end position while convert, supports large video files, even large then 2GB. No Technical Knowledge Required. Also you can select to automatically shut down your PC after conversion. \n\nNew features of Apex Video Converter Super : \n\n- VCD Ripper -- Support ripper VCD movies from dat file to any pop video formats \n\n- DVD Ripper -- Support ripper unprotected DVD movies from vob file to any pop video formats \n\n- Support converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Flash SWF, Youtube FLV, Flash FLV . \n\n- Support converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to MP3, WMA, WAV, MP2 Audio \n\n- Support converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Gif Animation and GIF, BMP, EPS, JPG, PCX, PSD, PDF, TIFF, WMF, EMF, PNG, J2K IMAGE\n\n","torrent":{"xt":"urn:btih:b429cecbb9f23b22f3492bf01968908ae82086a7","amp;dn":"Apex+Video+Converter+Super+5.86+%5BeNJoY-iT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b429cecbb9f23b22f3492bf01968908ae82086a7","infoHashBuffer":{"type":"Buffer","data":[180,41,206,203,185,242,59,34,243,73,43,240,25,104,144,138,232,32,134,167]},"announce":[],"urlList":[]}}