{"title":"Vicious Alliance - Humanity Bleeds (Demo)","uid":3771424,"size":8737353,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5a132de3697fa4bf79eb0b64c2acd631ca67fb4&amp;dn=Vicious+Alliance+-+Humanity+Bleeds+%28Demo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chainsmoker21","files":6,"time":1186991686,"description":" VICIOUS ALLIANCE\n\nElectro / Industrial / Gothic\n\nPhiladelphia, Pennsylvania \nUnited States   \n \n \n\nInfluences HARSH EBM, AGGROTECH, FUTUREPOP, SYNTHPOP, TRANCE \nAccessory, Amduscia, Assemblage 23, Clan of Xymox, Funker Vogt, Grendel, God Module, Hocico, Juno Reactor, Lights of Euphoria, Pride and Fall , Rotersand, Seabound, S.I.T.D., Suicide Commando, Tactical Sekt , Z Procheck\n \nSounds Like &quot;I&amp;#039;d just thought you&amp;#039;d like to know that I&amp;#039;ve been very impressed with the two MP3&amp;#039;s you&amp;#039;ve sent me. They&amp;#039;re really pretty accomplished for such a new band. The Dark Electro that you&amp;#039;re producing is my stock in trade as a DJ, and what you&amp;#039;ve sent me is better than quite a lot of the stuff out there just now. I can hear certain influences - Hocico and Amduscia being the obvious ones -but you&amp;#039;ve carved out your own sound around that. Well done!&quot; \nDJ Cyberchrist \n\n&quot;The song building, sounds used, and melodies are all top notch. This kind of melodically and structurally sound dark electro is hard to find, and if you ask me there are only a few signed bans that can compete to what you are already putting out before your first release.&quot; \nDJ Distortedboy \n\n&quot;Very vibrant and high energy, very much like old Flesh Field (which I&amp;#039;m a big fan of). Your powerful synths make your music easy to get into and give me quite a rush when listening to it. I really can&amp;#039;t praise the entire electronic component enough and I think by far it is the most developed aspect of your music. The beats and the riffs flow so well together the sound is impossible to resist.&quot; \n\nDJ Shok \n\n&quot;Two years beyond in the future, a mix between the last works by Hocico and an unknown band who has not been yet created. First time I played &quot;this is a war now!&quot; in a club, it seemed like this never-heard-of band was a top of the charts cult band, just awesome!...from MÃƒÂ©xico city.&quot; \n\nDJ DDarko \n\n&quot;Vicious Alliance is a rising voice that truly stands out in EBM, not solely because of its enveloping rich layers of sound and overall sinister bounciness (which makes them a complete success on the dancefloor), but because they carry out powerful messages and prophecies of a dreary present and bleak future in synthesized poetry. They&amp;#039;re not just producing quality music on a frequency that moves us in every sense, they&amp;#039;re transmitting relevant political commentaries. So these aren&amp;#039;t just musicians, they&amp;#039;re prophets; Vicious Alliance is a bomb that shatters treacherous walls and resounds throughout.&quot; \n\nDJ Miss Narco \n \n \nRecord Label Please contact us if interested ! \n\nType of Label None \n &lt;a href=&quot;\nhttp://www.myspace.com/viciousallianceebm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.myspace.com/viciousallianceebm&lt;/a&gt;\n\n--------------------------------------------------------------------------------\n\n\nVicious Alliance - II Ice Age\n\nVicious Alliance - I am Obsolete\n\nVicious Alliance - Disease of Rotten Minds\n\n","torrent":{"xt":"urn:btih:b5a132de3697fa4bf79eb0b64c2acd631ca67fb4","amp;dn":"Vicious+Alliance+-+Humanity+Bleeds+%28Demo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5a132de3697fa4bf79eb0b64c2acd631ca67fb4","infoHashBuffer":{"type":"Buffer","data":[181,161,50,222,54,151,250,75,247,158,176,182,76,42,205,99,28,166,127,180]},"announce":[],"urlList":[]}}