{"title":"Metallica Legacy Edition Black Album","uid":3885887,"size":88653275,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b6e87c8c7b39844d0e760971c07a95061f679b02&amp;dn=Metallica+Legacy+Edition+Black+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"guscadle","files":1,"time":1194827108,"description":"This project began as a personal endeavor when I listened to &amp;#039;Metallica&amp;#039; as an audience, analyzed it with the care and attention of a Metallica team member, and carefully re-edited it, concentrating on creating the storytelling style that Hetfield, Hammet, Ulrich, and Newstead originally made famous. Although I definitely appreciate all the unexpected attention and support, I also respect and understand the discontentment of Metallica in and of itself.\n\n Beginning with &quot;Ride The Lightning&quot; and ending with &quot;And Justice For All&quot;, Metallica employ a sort of audio &quot;canon&quot;, if you will. Five recurring themes/outlines follow, and are referred to as &quot;Legacy&quot; tracks. It goes as follows:\n\n \n\n Track One:\n  Begins with some sort of epic build up piece and goes into an all-out thrash anthem. \n\n  &quot;Ride&quot; starts off with &quot;Fight Fire With Fire&quot;. &quot;Fight Fire With Fire&quot; is the first Metallica song to start with an acoustic guitar intro with 3 harmonized guitars that make a beautiful and well structured sound which fades out into the normal thrash metal guitar style (with distortion).\n \n  &quot;Master&quot; leads off with Battery. Battery begins with a slow, clean guitar part. In this case, as many as four acoustic guitars are layered harmonically before the drums and bass come in with distorted guitars playing a more melodic version of the acoustic part. This lasts until 1:06, when the guitars cut into a very fast minimalist thrash metal riff that is the basis for the rest of the song.\n \n  &quot;Justice&quot; begins with &quot;Blackened&quot;. &quot;Blackened&quot; opens quietly before switching to a thrash metal style (182 bpm). In this case, the intro contains several electric guitars rather than classical guitars. However, it continues the general &quot;tonal&quot; nature of the previous introductions. An interesting note is that the intro was recorded with several harmonized guitars layered on a tape which afterwards was flipped. The intro heard on the &quot;...And Justice for All&quot; album is actually the recorded intro played backwards.\n\n \n  Track Two:\n   In the key of Em, this is the title track. The verse is played on the low E string, afterward being played in F#. The solo also starts off in Em, and eventually progresses into F# as well. This track seems to be the focal point of the album, laying the theme and tone of the rest to come.\n\n  &quot;Ride&quot; : &quot;Ride The Lightning&quot;\n\n  &quot;Master&quot;: &quot;Master of Puppets&quot;\n  \n  &quot;Justice&quot;: &quot;...And Justice For All&quot;\n\n\n  Track Four:\n    The ballad. Usually slower and softer on the verse, utilizing clean guitars and acoustic guitars to add to the feel, while louder and distorted on the chorus. Then leading into a powerful solo which is faded out.\n\n   &quot;Ride&quot;: &quot;Fade To Black&quot;\n   \n   &quot;Master&quot;: &quot;Welcome Home (Sanitarium)\n   \n   &quot;Justice&quot;: &quot;One&quot;\n\n   Track Varies From Album To Album:\n     Either the last track or the second to last track of the album, this is the progressive/instrumental track. \n\n    &quot;Ride&quot;: &quot;The Call of Ktulu&quot;\n\n    &quot;Master&quot;: &quot;Orion&quot;\n   \n    &quot;Justice&quot;: &quot;To Live Is To Die&quot;\n\n    Last Track On Album:\n       This &quot;Legacy&quot; track started on &quot;Master&quot;. It ends the album and is a full-out trash anthem to leave one feeling spent. Very agressive, and very testosterone-filled riffs follow.\n\n     &quot;Master&quot;: &quot;Damage Inc.&quot;\n\n     &quot;Justice&quot;: &quot;Dyers Eve&quot;\n\n\n\n Now that that has been laid out and explained, I will go on and explain what &quot;Metallica (Legacy Edition) is. None of the music has been altered, while some parts have been re-arranged for canonical reasons. The track list is as follows.\n\n1. Holier Than Thou (Legacy Edition)\n2. Enter Sandman\n3. Sad But True\n4. The Unforgiven\n5. Wherever I May Roam\n6. Don&amp;#039;t Tread On Me\n7. Through The Never\n8. Nothing Else Matters\n9. Of Wolf And Man\n10. The God That Failed\n11. My Friend Of Misery (Untouched Legacy Edition)\n12. The Struggle Within (Legacy Edition)\n \n As you may have noticed, the first few track names are out of order with the original release. This is for canonical reasons. The beginning of Struggle has been added onto Holier, giving it the same epic build-up as the older Metallica releases. Sandman has been put into the second spot, while The Unforgiven stays in fourth because it follows Metallica canon. Tracks 5-11 are untouched. Struggle has its beginning still clipped off to keep in with the canon of the album, and starts out complete thrash as intended.\n\n The Black Album was a controversial album amongst fans of the band. While the album and the band were critically praised and commercially successful, some fans expressed disappointment and even outrage at the new direction taken by Metallica. Gone for the most part were faster staccato riffs during verses and throaty vocals found on the band&amp;#039;s first four albums; the overall speed and complexity of the music were greatly reduced. The Black Album presented a more radio-friendly, commercially accessible Metallica, especially evidenced by the ballad &quot;Nothing Else Matters&quot;. Moreover, following the success of &quot;One,&quot; the breakaway single from their ...And Justice for All album, five videos were released from the Black Album. (&quot;Enter Sandman&quot;, &quot;Nothing Else Matters&quot;, &quot;Sad But True&quot;, &quot;Wherever I May Roam&quot; and &quot;The Unforgiven&quot;).\n\n The Black Album stands as a dividing point for Metallica fans. Its&amp;#039; supporters claim that it is still a &quot;metal&quot; album, while its critics describe it as the beginning of the end for Metallica&amp;#039;s greatness. Songs such as &quot;Holier Than Thou&quot;, &quot;Through The Never&quot;, and &quot;The Struggle Within&quot; show Metallica still practiced elements of thrash, while detractors point to the ballads &quot;Nothing Else Matters&quot; and &quot;The Unforgiven&quot; as signs that Metallica was more interested in commercial gain than catering exclusively to their thrash metal fan base. Some say after The Black Album, Metallica became a hard rock band.  \n\n The purpose of &quot;Metallica Legacy Edition&quot; is to look at the album from a different perspective. This is what the album probably would have sounded like had Metallica continued the &quot;Legacy&quot; of its audio canon.\n\nEnjoy.       ","torrent":{"xt":"urn:btih:b6e87c8c7b39844d0e760971c07a95061f679b02","amp;dn":"Metallica+Legacy+Edition+Black+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6e87c8c7b39844d0e760971c07a95061f679b02","infoHashBuffer":{"type":"Buffer","data":[182,232,124,140,123,57,132,77,14,118,9,113,192,122,149,6,31,103,155,2]},"announce":[],"urlList":[]}}