{"title":"Metal Swarm - Kevin J. Anderson","uid":3931892,"size":113489739,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b7af0a9c93c91840c9b99891b2206ee33d0cc3d8&amp;dn=Metal+Swarm+-+Kevin+J.+Anderson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"idan73","files":148,"time":1197529185,"description":"Think its about time to start using our nokia audiobook app.\n\nThis release includes chapters.\n\nto kick things off ill start with this amazing continuation of \\&quot;Saga of Seven Suns\\&quot; by Kevin J.Anderson\n\nhot off the press - in december\n\n\\&quot;Book 6: Metal Swarm\n\nThe alien hydrogues have been defeated, driven back into the cores of their gas-giant planets by an alliance of the Earth Defence Forces, the ancient Ildiran Empire, the gypsy-like Roamer clans and fantasic water elemental beings as well as gigantic living \\&amp;#039;treeships\\&amp;#039;. But as the various factions try to pick up the pieces and recover, the deep-seated wounds may be fatal.\\&quot;\t\n\n\n&quot;Audiobooks is a beta concept that enables you to enjoy audiobooks while on the go. It includes a highly efficient audio compression technology optimized for voice (AMR-WB), a player application for S60 (Nokia Audiobook Player), and an audio converter tool for PC (Nokia Audiobook Manager). Whereas traditional music player applications are optimized for music, Nokia Audiobook Player is optimized for audiobooks, enabling you to browse chapters, set bookmarks, and automatically continue from where you last time stopped listening\nA typical 400 page novel translates into a 10-20 hours long audiobook, which would traditionally take more than dozen CDs or hundreds of megabytes of low-quality MP3 files. Nokia Audiobooks uses a codec called AMR-WB, which is optimized for voice. With Nokia Audiobooks, you will get 5-10 times more content to your phone with similar voice quality, compared to content compressed with MP3 at 64 or 128 kbps. Consequently, you can easily store multiple audiobooks on your memory card - and still have plenty of capacity left for other things (like pics and video) you find important in life.&quot;\n\n\n**repackaged the .wav and will post either mp3 or mp4(audio, basically .aac). will make both 128 but think mp4 will be smaller file. while keeping quality. \npls post votes in next 24 hours as to what you want me to seed. mp3 or mp4\nsplit file in chapters (took me a while)**","torrent":{"xt":"urn:btih:b7af0a9c93c91840c9b99891b2206ee33d0cc3d8","amp;dn":"Metal+Swarm+-+Kevin+J.+Anderson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7af0a9c93c91840c9b99891b2206ee33d0cc3d8","infoHashBuffer":{"type":"Buffer","data":[183,175,10,156,147,201,24,64,201,185,152,145,178,32,110,227,61,12,195,216]},"announce":[],"urlList":[]}}