{"title":"Ventrilo Srv 2.3.1 cracked, working, *17* user limit!","uid":3781885,"size":304203,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b8511f87ab9e506179aba5e87fba3d30da772d8b&amp;dn=Ventrilo+Srv+2.3.1+cracked%2C+working%2C+%2A17%2A+user+limit%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tob1337","files":7,"time":1187865594,"description":"ok, so this is basicly a ventrilo server for 2.3.1 cracked, tho it got a *17* user limit, this is a copy of the nfo, btw, this is already &quot;cracked&quot; all you gotta do is start ventrilo_srv.exe and off you go\n\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nAPPLICATION : Ventrilo Server - Public - Version 2.3.1 *CRACKED 17 USER*\n\t OS : Win\n       TYPE : VoIP\n        WWW : http://www.ventrilo.com\n    RELDATE : 2006\n PROTECTION : 8 User Limit and some other stuff..\n CRKRELDATE : 30/3/2007\n    CRKDATE : 22/3/2007 a week of testing :)\n\nINSTALLATION: Install.\n              Copy .exe in crack dir. to install dir.\n              \n       NOTES: Where should we begin?!\n\nThis crack has been tested as much as we can. We have worked several hours/days\nand weeks to get it to this state. First we would give you some background info.\nAfter allowing the 10th user in the problems started with disconnect problems.\nServer crashed and multi user logins appeared. Why? Well since the original\n8 user limit only removes old data for ONLY 8 users, we had to build our own\ndisconnect routine that removes data for user connects over 8.. and it worked\ngood as hell! nice :)\n\nThings got messy around the 17th user anyway. We told you about the removing data\nproblem and the optimized 8 user shit.. and if we bring in the 18th user things\ncrash, no space for that user, timestamps and stuff.. and we cant just change the\nmain four almost identical loops that controls the users, it&amp;#039;s messy!\nWe took a look at the early builds of the server that didn&amp;#039;t come with the a 8\nuser limit.. and the four main loops.. almost the same but with a difference..\nrewritten to handle more users. If we got the time and want to.. we might try to\nrewrite this exe to work with 18 users or more.. but it&amp;#039;s a hell of a job..\nwe have already patched this proggie with around 200bytes or so.. do the math to\nfix memory shit for 18+ users.\n\nAnyway, we bring you this 17 user version as stable as it we made it.\nYou can&amp;#039;t login with a 18th user, we did fix that so it won&amp;#039;t crash, it will\nresult in a login timout instead for that user. We don&amp;#039;t know if there is a issue\non other OS&amp;#039;s. It&amp;#039;s tested on Vista and XP, and if you recive connect problems\nafter a 18th user tried to login.. then just don&amp;#039;t login with the 18th user ;)\n\nWe also included the Ventrilo 2.3.2.Beta.3 Client patched to run multi instances.\n\nIf it runs ok.. be happy! If it you got problems, do nothing!\n\nThere IS a REASON why it&amp;#039;s so FEW WORKING or non at all cracks to this app!\n\nEnjoy! /ONY and SEB-\n\nps. tnx for all feedback at the forum.. you know who you are and what we talk about.. :)\n\nABOUT:\n\nVentrilo 2.3.1 is the next evolutionary step of Voice over IP (VoIP) group communications software. Ventrilo is also the industry standard by which all others measure themselves as they attempt to imitate its features.\n\nBy offering surround sound positioning and special sound effects on a per user, per channel, per server or global configuration level the program provides each user the option to fully customize exactly how they wish to hear sounds from other users or events.\n\nVentrilo is best known for it&amp;#039;s superior sound quality and minimal use of CPU resources so as not to interfere with day to day operations of the computer or during online game competitions. It is also preferred for the simple user interface that any first time computer user can very quickly learn because the most commonly used features are immediately visible and can be activated with a single click of the mouse.\n\nTo see what the program looks like and a list of some of the many features the program offers please click on the About link in the navigation menu. \n\nVersion 2.3.1 introduces more user control of how the main window is displayed. You can turn on and off the title bar, display the large buttons on the right or switch to toolbar mode with icons on the top to maximize the usable width of the window. Extended mode which hides the User Name, Server and Bindings options. Turn on and off grid lines in the user list window. You can also customize the user list window icons and toolbar icons.\n\nAll of these changes still keep the most commonly used features at your finger tips by means of a single click of the mouse. No need to navigate clunky multi-stage menu options just send a comment to the other users.\n\nVersion 2.3.1 is now compliant with the Microsoft XP Themes User Interface.","torrent":{"xt":"urn:btih:b8511f87ab9e506179aba5e87fba3d30da772d8b","amp;dn":"Ventrilo+Srv+2.3.1+cracked%2C+working%2C+%2A17%2A+user+limit%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8511f87ab9e506179aba5e87fba3d30da772d8b","infoHashBuffer":{"type":"Buffer","data":[184,81,31,135,171,158,80,97,121,171,165,232,127,186,61,48,218,119,45,139]},"announce":[],"urlList":[]}}