{"title":"Donnie Darko Score","uid":3921700,"size":182489702,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b87aada1b11ad2f7b1a50bca978114303d8e27a0&amp;dn=Donnie+Darko+Score&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bdfortin","files":18,"time":1196840229,"description":"Edit: Changed the torrent name to reflect that it's the score, not the soundtrack. Thanks DAnisbril. Also added a better description:\n\nWritten and Performed by Michael Andrews, except &quot;Mad World&quot; written by Roland Orzabal.\n\n&quot;If I had to pick a word to describe Michael Andrews' hauntingly beautiful score for Donnie Darko, it would be... retro-futuristic. The score is so retro in the sense that it was performed mostly with instruments built in the 60's and 70's (it wasn't until I hung out with Mike that I discovered what a vocoder was), and futuristic in the sense that synthesized musical scores became prominent in the science-fiction films of the early eighties (Tomita's Snowflakes Are Dancing and Vangelis' score for Blade Runner were often conversation pieces).\n\n&quot;Since ours is indeed a science-fiction film (as well as an 80's period piece), Mike embraced the aesthetic, but then added his simplistic melodies and ethereal soundscapes, never forgetting that the mystery of the great unknown lies behind every chorus.\n\n&quot;Some of my fondest memories of hanging out with Mike (and his trusted engineer Todd Burke) in his Hollywood studio during Christmas rush of 2000 are the cigarettes smoked (I now feel that this movie is responsible for Mike's habit and I will make him quit), the videotaping of Mike's hands improvising a melody on his piano, and walking in one late December afternoon to discover that Mike and his pal Gary Jules had recorded a brilliant cover of the classic Tears For Fears song 'Mad World.'\n\n&quot;I feel that this song and Mike's compositions (&quot;Walts in the 4th Dimension&quot; is a favorite) will become the signature for this film, and I have been told that it can stick in your head like glue.\n\n&quot;It is indeed a mad, mad world. We should feel lucky to have Michael Andrews and his music while confronting the madness and emerging with a smile.&quot;\n\n- Richard Kelly, October 2001\n\n\nTrack listing:\n\n01 - Carpathian Ridge\n02 - The Tangent Universe\n03 - The Artifact &amp; Living\n04 - Middlesex Times\n05 - Manipulated Living\n06 - Philosophy of Time Travel\n07 - Liquid Spear Waltz\n08 - Gretchen Ross\n09 - Burn it to the Ground\n10 - Slipping Away\n11 - Rosie Darko\n12 - Cellar Door\n13 - Ensurance Trap\n14 - Waltz in the 4th Dimension\n15 - Time Travel\n16 - Did you Know Him?\n17 - Mad World\n18 - Mad World (alternate version)","torrent":{"xt":"urn:btih:b87aada1b11ad2f7b1a50bca978114303d8e27a0","amp;dn":"Donnie+Darko+Score","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b87aada1b11ad2f7b1a50bca978114303d8e27a0","infoHashBuffer":{"type":"Buffer","data":[184,122,173,161,177,26,210,247,177,165,11,202,151,129,20,48,61,142,39,160]},"announce":[],"urlList":[]}}