{"title":"12 OCLOCK HIGH 206-207  [retrOtv]","uid":4000044,"size":730697775,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b8e8e61e9a764fce2aba814363c00f2c1a94f5a7&amp;dn=12+OCLOCK+HIGH+206-207++%5BretrOtv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":3,"time":1201518551,"description":"12 O&amp;#039;CLOCK HIGH 206-207\n\n206. The Hotshot   10/18/1965 \nThe 511th Fighter Group arrives at Archbury to escort the 918 on the home leg of the shuttle mission. On the way Troper attacks a train making him 10 minutes late for the rendezvous. The 511th does not give the proper recognition codes and one pilot is shot down. On the ground an angry Lieutenant Col. Troper slugs Gallagher. Gallagher tells Troper to forget about it. They are ordered to train together. In London Troper gets drunk, insults Gallagher, and takes off with Gallagher&amp;#039;s date Fay. Gallagher orders a brief at 0400, only 12 of the 511th pilots show up. Gallagher has Troper put under house arrest. Merritt leads the fighters and not one bomber is lost.\n  Guest star: Jill Haworth (Fay Vendry), Seymour Cassel (Captain Johnson) , Tom Symonds (Waiter), Charles Kuenstle (Sargent Garnet), George Brenlin (Lieutenant Bukich), Warren Oates (Lieutenant Colonel Jerry Troper), Jill Ireland (Alyce Carpenter), Walter Brooke (Roy Saxon), Gunnar Hellstrom (Colonel Falkenstein)\n\n207. Show Me a Hero, I&amp;#039;ll Show You a Bum    10/25/1965 \nOn a mission 9 out of the 10 crew of the Piccadilly Lily are wounded save one - Komansky. Komansky fly&amp;#039;s and lands the plane, becoming a press celebrity. A wounded Gallagher puts him in for the Silver Star. Kirby Wyatt, the 918th press liaison calls Susan Nesbitt, an American correspondent working for the BBC. She takes advantage of Komansky realizing this story could make her (he rescued General Gallagher&amp;#039;s son). Kirby Wyatt goes along with Susan. Sandy is very uncomfortable with the celebrity. He is kidded about being a jinx by Technical Sergeant Chapman, Major Benson&amp;#039;s Flight Engineer. Sandy replaces him on a mission, and has to kick a bomb loose. Sandy is awarded the Silver Star.\n  Guest star: Jill Haworth (Fay Vendry) , Mike Doherty (London M.P.), Shawn Michaels (Civilian Reporter), Ira Barmak (G.I. Reporter), Charles McDaniel (Control Officer), Pat O&amp;#039;Hara (Air Raid Warden), Michael McDonald (III) (Staff Sergeant Weber), Lee Farr (Major Benson), Steven Bell (Sergeant Roberts), Lois Nettleton (Susan Nesbitt), Lloyd Bochner (Kirby Wyatt), Anne Whitfield (Pamela Hurley), Burt Reynolds (Technical Sergeant Chapman)\n\nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:b8e8e61e9a764fce2aba814363c00f2c1a94f5a7","amp;dn":"12+OCLOCK+HIGH+206-207++%5BretrOtv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8e8e61e9a764fce2aba814363c00f2c1a94f5a7","infoHashBuffer":{"type":"Buffer","data":[184,232,230,30,154,118,79,206,42,186,129,67,99,192,15,44,26,148,245,167]},"announce":[],"urlList":[]}}