{"title":"Everything.Will.Be.Okay.Bitter.Films.XviD","uid":3880243,"size":152246312,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:b9e78ed8da44713b1401922b7335e77db997e858&amp;dn=Everything.Will.Be.Okay.Bitter.Films.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dumilum","files":1,"time":1194632052,"description":"\tThis is an AVI  rip of the new Don Hertzfeldt film, newly released on DVD by Bitter Films.  If you want the full disc complete with sketches, production notes, deleted scenes, etc., see the DVD-R version that I uploaded here.   If you like this, please consider buying it on DVD direct from Bitter Films - it&amp;#039;s really cheap, and pure genius.  Hertzfeldt&amp;#039;s other films can be found on the KG tracker, here and here.\n\nThis is one of Hertzfeldt&amp;#039;s best animated shorts, continuing the psychedelic, experimental style of Rejected and The Meaning of Life.  This one is not quite as lengthy or as epic as the latter, but it is still amazing and mindblowing, and it&amp;#039;s only the first part of a two-part series!  Don Hertzfeldt has absolutely no peers in animation - he hand draws everything, uses old-fashioned stop-motion animating techniques, and all special effects are in camera.  No computers used at all!  This gives the films a beautifully handcrafted feel, and permeates everything with an atmosphere familiar from classic silent and experimental films.\n\nThis film was the winner of the Jury Prize in Short Filmmaking at Sundance in 2007.\n\nThe description from the back of the case:\n\nQuote:\nWARNING: We, the producers, are providing a free insurance policy covering the sanity of every patron attending this EXPLOSION OF TERROR.  Not for the weak of constitution! Adults only, please! NOT FOR SISSIES!  SEE: THE LIFE OF BILL!  SEE placid social impotence! SEE Bill stand around a lot!  SEE Bill react to changes in light and temperature!  Peer inside Bill&amp;#039;s IMPOSSIBLY ROUND HEAD and WITNESS the sad, confused hallucinations of a HAUNTED BRAIN.  BEHOLD EVERYDAY OCCURRENCES that sort of go nowhere!  TRY TO FOLLOW ambiguous plot lines!  SEE ironic juxtaposition!  STARE AT little moving pictures THAT VAGUELY REMIND YOU OF SOMETHING SAD FROM LONG AGO that you can&amp;#039;t quite put your finger on.  WONDER IF you couldn&amp;#039;t have purchased something A LITTLE CHEERIER.  FIENDISH NAKED EXISTENTIALISM!  BLOOD CURDLING SAMENESS!  HORROR!  DISTRESS!  REDUNDANT CAPTITALIZATION!  Can you stomach THE CREEPING AWARENESS OF MORTALITY WITHIN A LONELY, INDIFFERENT UNIVERSE, ALL BESPLATTERED ACROSS THE SCREEN?  A den of LIVING NIGHTMARES!  Now playing in MOVING-FRAME-O-VISION, at NO ADDITIONAL CHARGE.  Girls!  See if your boyfriend can take it!  Boys!  See if your girlfriend will instinctively cling to you during the scary bits, using her subconscious need for fathering protection as your AWKWARD CUE for clumsy, ultimately humiliating sexual fumblings!  DEPRESS your friends!  DISAPPOINT your parents!  WARNING:  We cannot be responsible if you NEVER SLEEP AGAIN!\n\nScreenshots:\n &lt;a href=&quot;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i15.photobucket.com/albums/a395/NewObject23/ewbok4.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b9e78ed8da44713b1401922b7335e77db997e858","amp;dn":"Everything.Will.Be.Okay.Bitter.Films.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e78ed8da44713b1401922b7335e77db997e858","infoHashBuffer":{"type":"Buffer","data":[185,231,142,216,218,68,113,59,20,1,146,43,115,53,231,125,185,151,232,88]},"announce":[],"urlList":[]}}