{"title":"[Kung Fu] Destroyers Of The 5 Deadly Venoms (1979) - Rmvb (Repos","uid":3776140,"size":301619441,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:badb881605731629b616682b5ac53b0ad5dcff4a&amp;dn=%5BKung+Fu%5D+Destroyers+Of+The+5+Deadly+Venoms+%281979%29+-+Rmvb+%28Repos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JamesKees","files":6,"time":1187369603,"description":"This is a repost\n\nDestroyers Of The 5 Deadly Venoms aka The Magnificent Ruffians (1979)\n\nAvg. Rating:  \t\n  4.1 / 5 (based on 7 ratings).\n\nPlot:\tThe Venoms star in this Chang-Cheh directed fu flick about a group of down-and-out fighters who all wind up battling each other after a series of betrayals and set-ups.\n\nOverview:\tThe movie opens with Lu Feng, a warlord who uses a golden spear, bemoaning that kung-fu has become useless. Guns are being introduced to China, and no one wants to learn the martial arts anymore. Lu&amp;#039;s protection agency is suffering, but he still finds time to trick what few kung-fu fighters he can find into coming to his town, so he can murder them in mortal combat. This opening scene is very effective, as Lu greets visiting kung-fu fighters like a perfect gentleman, and then slaughters them without mercy.\n\nIn another part of Lu&amp;#039;s town, Sun Chien, Chiang Sheng, and new guy Wang Li bum around, starving kung-fu fighters who&amp;#039;ve been left unemployed by China&amp;#039;s many recent changes. What they do is eat their fill in restaurants, and then let the employees beat them instead of paying. Kuo Choi is in a similar plight, and eventually he hooks up with the three. Meanwhile, Lo Meng plays a hot-tempered owner of a failing escort agency; Lu Feng wants to buy his property, but Lo won&amp;#039;t sell, instead beating Lu&amp;#039;s men into submission. Lo lives with his mom and sister, both of whom try to keep him from fighting. Yes, Lo Meng is a total mama&amp;#039;s boy in this movie. But what&amp;#039;s worse is that he&amp;#039;s barely in it until the middle half.\n\nLu Feng eventually gets Kuo Choi and his pals to live at his estate, where they&amp;#039;re free to drink, carouse, and practice kung-fu. Lu&amp;#039;s plan is to get the four of them to take out Lo Meng. Lu can&amp;#039;t do this himself, because he&amp;#039;s smitten with Lo Meng&amp;#039;s cute sister. So he wants Lo killed quietly. Lu fools Kuo and pals into thinking Lo Meng is a bad guy who needs to be punished. The four of them head over to Lo&amp;#039;s place, but a problem arises: the five &quot;ruffians&quot; realize they share the same outlook on life. Instead of killing Lo, the four become friends with him, meeting him every afternoon at an abandoned temple to practice kung-fu.\n\nLu has his henchman secretly replace Kuo Choi&amp;#039;s staff with a replica that&amp;#039;s stuffed with explosives. At their next kung-fu practice, Kuo hits Lo with it. The explosion kills Lo. Shocked, Kuo Choi runs for his life, as Chiang Sheng, Sun Chien, and Wang Li assume he&amp;#039;s been hired by Lu to murder Lo Meng. Lu&amp;#039;s happy with the results, and shows up to promptly take on the three of them, in &quot;revenge&quot; for Lo. The three realize they&amp;#039;ve been duped, and put on a heroic stand, but only Chiang Sheng survives Lu Feng&amp;#039;s devastating techniques.\n\nChiang Sheng and Kuo Choi team up, after discovering the disturbing fate of Lo&amp;#039;s mother and sister. They decide to take on Lu Feng. Not understanding his style, they create impromptu counters and attacks. The three engage in battle at dawn the next morning, in a fight that&amp;#039;s brimming with the flips, leaps, and violence one would expect from the Venoms. Of course, only one of them&amp;#039;s left standing at the end.\n\nCast: \tLu Feng  ||  Lo Meng  ||  Johnny Wang Lung-Wei  ||  Phillip Kwok Chun-Fung  ||  Annie Liu On-Lai  ||  Lau Fong-Sai  ||  Chiang Sheng  ||  Sun Chien  ||  Wong Lik  ||  Wang Lai  ||  Wong Ching-Ho  ||  Chui Tai-Ping  ||  Yeung Hung  ||  Tony Tam Jan-Dung  ||  Wang Han-Chen  ||  Shum Lo  ||  Lam Chi-Tai  ||  Ngai Tim-Choi  ||  Lui Daat  ||  Paul Wong Kwan  ||  To Wing-Leung\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:badb881605731629b616682b5ac53b0ad5dcff4a","amp;dn":"%5BKung+Fu%5D+Destroyers+Of+The+5+Deadly+Venoms+%281979%29+-+Rmvb+%28Repos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"badb881605731629b616682b5ac53b0ad5dcff4a","infoHashBuffer":{"type":"Buffer","data":[186,219,136,22,5,115,22,41,182,22,104,43,90,197,59,10,213,220,255,74]},"announce":[],"urlList":[]}}