{"title":"Negativland - Live From The House Of Blues April 11th, 2000 (FLA","uid":3900479,"size":1090739558,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bb28fd2b899d85d5a9ef25861287846f75f18efe&amp;dn=Negativland+-+Live+From+The+House+Of+Blues+April+11th%2C+2000+%28FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"buddykins2006","files":30,"time":1195530912,"description":"Negativland is about to call it quits. One member is now in federal prison for hacking into classified DieCorp think tank documents. Another has become a Native American casino consultant in the Southwest and wants nothing more to do with \\\\\\&quot;low paying alternative music.\\\\\\&quot; The band\\\\\\&amp;#039;s drummer recently gave up sticks and skins for a more lucrative life of insider day trading. The Weatherman now installs customer satisfaction monitoring equipment full-time for Global Cable, Inc. and has no further desire to \\\\\\&quot;create\\\\\\&quot; anything. Crosley Bendix, the group\\\\\\&amp;#039;s longtime senior mentor and cultural advisor, has left the United States for good to spend his twilight years at a mechanical drawing table interpreting crop circle formations for MI5 in England. His final words on these shores were, \\\\\\&quot;music is basically dead. I\\\\\\&amp;#039;m not going to waste any more time on it.\\\\\\&quot; It looks like the slow, agonizing demise of Negativland has finally reached fruition after so many years of trying.\n\nTRUE or FALSE?\n\nWell, like everything else you have to read these days, it\\\\\\&amp;#039;s difficult to tell. There may be some grains of truth in the above \\\\\\&quot;information,\\\\\\&quot; but where exactly are those grains located? (Answer available only from Negativland\\\\\\&amp;#039;s currently-out-of-business address.) The only truth you can be sure of is that nothing characterizes our over-informationalized society more than our collective inability to personally verify anything. And the spinning just keeps spinning faster.\n\nAs so called \\\\\\&quot;culture jammers\\\\\\&quot;, the group known as Negativland has for many years held a mirror up to the media world, broken it, and shuffled the pieces back into very different shapes. So it is fitting that, perhaps for the last time (believe it or not), Negativland now returns to the highways of America with a live performance about modern info-life and its many confusions.\n\nNegativland\\\\\\&amp;#039;s 20th Anniversary TRUE/FALSE tour (and first nationwide tour in seven years) celebrates the group\\\\\\&amp;#039;s first two decades of musical observations and sticky lawsuits with a millennial concert lasting over two and a half hours, including a great deal of never-before-heard material, as well as a few reworked \\\\\\&quot;tunes\\\\\\&quot; from their twenty years of recordings. Rounding out this over-stimulating evening of entertainment is an elaborately collaged brew of film, video and slides, an actual puppet show appropriate for all ages, and the first national appearance of longtime Negativland collaborator, Pastor Dick.\n\nExpect to remain seated for maximum absorption during this long, densely- packed performance, designed to help you to discern TRUE from FALSE. ","torrent":{"xt":"urn:btih:bb28fd2b899d85d5a9ef25861287846f75f18efe","amp;dn":"Negativland+-+Live+From+The+House+Of+Blues+April+11th%2C+2000+%28FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb28fd2b899d85d5a9ef25861287846f75f18efe","infoHashBuffer":{"type":"Buffer","data":[187,40,253,43,137,157,133,213,169,239,37,134,18,135,132,111,117,241,142,254]},"announce":[],"urlList":[]}}