{"title":"Outrageous Fortune","uid":3997887,"size":7915449993,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bbc1bdbf9c4e8d76ee9dbfd04d03ab8175d85fa2&amp;dn=Outrageous+Fortune&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dyslexik","files":26,"time":1201403160,"description":" &lt;a href=&quot;http://www.outrageousfortune.co.nz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.outrageousfortune.co.nz/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0461097/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0461097/&lt;/a&gt;\n\nOutrageous Fortune is one of New Zealand&amp;#039;s top dramas. The Wests are a one-family crime wave with a proud tradition in thievery, larceny and petty crime, until now. When patriarch Wolfgang West is sentenced to four years in jail, his wife Cheryl decides enough is enough; the family are cleaning up their act and going straight. Can the Wests live up to Cheryl&amp;#039;s resolve and stay out of crime? It&amp;#039;s not easy to be a saint when you have the DNA of a sinner.\n\nOutrageous Fortune follows one cheerfully trashy crime family&amp;#039;s attempts to stay out of trouble: matriarch Cheryl, determined to save her brood from following in their father&amp;#039;s footsteps, eldest son Jethro, an ambitious lawyer-to-be with a few secrets, Jethro&amp;#039;s twin Van (identical except in the brains department) who only wants to be like his dad, 18-year-old Pascalle, who wants to be Rachel Hunter, 15-year-old movie buff Loretta, who is blackmailing her teacher, and Grandpa Ted, who may have Alzheimer&amp;#039;s - unless he&amp;#039;s just playing it up to annoy people.\n\nThen there&amp;#039;s Detective Sergeant Wayne Judd, the West family nemesis; the Hongs, a wealthy Asian family who may or may not have Triad connections, Caroline Darling, Loretta&amp;#039;s deputy principal, who has been having an affair with Jethro since he was a 15-year-old student, Munter, Van&amp;#039;s best mate and partner in crime, and Wolf himself, who does not intend to take his wife&amp;#039;s sudden wave of righteousness lying down.\n\nOutrageous Fortune is a family comedy-drama about the wrong sort of people trying to do the right thing when the rewards for going straight are neither immediate nor bountiful. Outrageous Fortune is a bold, fresh comedy-drama which is by turns bawdy, action-packed, satirical and trashy - but only ever a heartbeat away from reality. ","torrent":{"xt":"urn:btih:bbc1bdbf9c4e8d76ee9dbfd04d03ab8175d85fa2","amp;dn":"Outrageous+Fortune","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc1bdbf9c4e8d76ee9dbfd04d03ab8175d85fa2","infoHashBuffer":{"type":"Buffer","data":[187,193,189,191,156,78,141,118,238,157,191,208,77,3,171,129,117,216,95,162]},"announce":[],"urlList":[]}}