{"title":"Fox Super Bowl XLII Pregame Show Xvid DupeD","uid":4016134,"size":1468162895,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bd494dd950756193c1dc78d330781e496d0701a8&amp;dn=Fox+Super+Bowl+XLII+Pregame+Show+Xvid+DupeD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DupeD","files":2,"time":1202370810,"description":"Fox Super Bowl XLII Pregame Show Xvid\n2h:52m \nVideo: .AVI 720x480 \nAudio: 48 khz 16bps Stereo \n1138kbps 29.94 fps\n\nThe Fox Super Bowl Sunday Pregame Show Rundown:\n \nHere is the rundown by the half hour for the Fox Super Bowl Sunday Pregame show which ran from 2 - 6 p.m. ET of Feb. 3rd 2008\n\n2:00-2:30 PM ET ? \n\n- Chris Myers, assigned to cover the Patriots, reports live from the team hotel on New England?s pursuit of perfection. A win in Super Bowl XLII would give the Pats an unblemished 19-0 mark, a first in NFL history, making it the first team to go undefeated since the 1972 Miami Dolphins \n\n- Pam Oliver, assigned to cover the Giants, reports live from the team hotel on New York?s furious dash to the Super Bowl, which began with a playoff clinching win, where else, on the road, against Buffalo\n\n- Myers and Oliver report on any late breaking team news\n\n- Jimmy Johnson looks back at the first game this season between the Giants and Patriots in the State Farm Covers the Field segment. Both teams met in the regular season finale on Dec. 29 at Giants Stadium, a high-scoring affair that the Patriots won, 38-35\n\n- Curt Menefee voices over a feature on the 1972 Miami Dolphins, to this point the only undefeated team in NFL history\n\n- Get to Know You: Giants defensive end Osi Umenyiora\n\n\n2:30-3:00 PM ET ?\n\n- Ryan Seacrest Red Carpet Interviews\n\n- Grumpy Old Coaches: Jimmy Johnson and Barry Switzer, the only two men to coach teams to Super Bowl victory and collegiate national championships, reprise their weekly FOX NFL SUNDAY roles and go at it over Super Bowl XLII\n\n- Team of the Decade: 1960s Green Bay Packers*\n\n- Eli Manning feature\n\n- Terry Bradshaw interviews former NFL QB Archie Manning, father of Giants QB Eli Manning\n\n- Get to Know You: Patriots safety Rodney Harrison\n\n- Walter Payton Man of the Year nominees\n\n- Tribute to members of the NFL family that have passed away in the last year\n\n\n3:00-3:30 PM ET ?\n\n- Comedic prognosticator Frank Caliendo makes the first of three in-character picks on the game\n\n- Curt Menefee presents a feature on the Giants? defensive front-four\n\n- Get to Know You: Giants linebacker Antonio Pierce\n\n- NFL Insider Jay Glazer discusses Super Bowl XLII with four of the NFL?s best players: Kansas City Chiefs tight end Tony Gonzalez, Denver Broncos safety John Lynch, San Diego Chargers linebacker Shawne Merriman and Dallas Cowboys tight end Jason Witten \n\n- Feature on the ultra-competitive Boston-New York sports rivalry\n\n- Ryan Seacrest Red Carpet Interviews \n\n\n3:30-4:00 PM ET ? \n\n- Jimmy Johnson, a two-time Super Bowl champion head coach, interviews Patriots head coach Bill Belichick, already a three-time Super Bowl winner\n\n- Team of the Decade: 1970s Pittsburgh Steelers*\n\n- Willie Nelson and Sarah Evans perform ?Don?t Let Your Babies Grow Up to be Cowboys?\n\n- Ryan Seacrest Red Carpet Interviews\n\n- Tom Petty halftime performance preview\n\n- Fox Business Network?s Neil Cavuto reports from New York on the business of the Super Bowl\n\n- Jillian Reynolds reports on the Super Bowl XLII party scene\n\n\n4:00-4:30 PM ET ?\n\n- Team of the Decade: 1980s San Francisco 49ers*\n\n- Ryan Seacrest Red Carpet Interviews\n\n- Randy Moss feature\n\n- Get to Know You: Patriots wide receivers Donte? Stallworth and Wes Welker\n\n- Frank Caliendo makes the second of three in-character picks\n\n- Just two weeks away from the 50th Daytona 500, reigning NASCAR champion Jimmie Johnson interviewed \n\n- World premiere performance of American Idol judge Paula Abdul?s new hit single ?Dance Like There?s No Tomorrow?\n\n\n4:30-5:00 PM ET ?\n\n- Michael Strahan Diary\n\n- Howie Long interviews Patriots veteran linebacker Junior Seau\n\n- Get to Know You: Patriots linebackers\n\n- Team of the Decade: 1990s Dallas Cowboys*\n\n- Making of Bud Light?s Super Bowl commercials\n\n- Ryan Seacrest Red Carpet Interviews\n\n\n\n5:00-5:30 PM ET ?\n\n- Alicia Keys performance\n\n- Joe Buck and Troy Aikman provide their initial thoughts on Super Bowl XLII as kick-off approaches\n\n- Pam Oliver interviews Giants head coach Tom Coughlin\n\n\n5:30-6:00 PM ET ?\n\n- Terry Bradshaw interviews Patriots quarterback Tom Brady\n\n- Team of the Decade: 2000s New England Patriots*\n\n- Bradshaw, Long and Johnson make their Super Bowl XLII predictions\n\n- Frank Caliendo makes his final of three in-character picks\n\n- Declaration of Independence reading by distinguished leaders of the NFL community, past and present, and military personnel stationed around the world. The feature includes a reading by Pat Tillman?s widow Marie and a tribute to soldiers.\n","torrent":{"xt":"urn:btih:bd494dd950756193c1dc78d330781e496d0701a8","amp;dn":"Fox+Super+Bowl+XLII+Pregame+Show+Xvid+DupeD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd494dd950756193c1dc78d330781e496d0701a8","infoHashBuffer":{"type":"Buffer","data":[189,73,77,217,80,117,97,147,193,220,120,211,48,120,30,73,109,7,1,168]},"announce":[],"urlList":[]}}