{"title":"Fuzion Frenzy XBOX - ProjectX.","uid":3370999,"size":634774496,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:bd580c26224256051c2bbceda0096912a90bcb31&amp;dn=Fuzion+Frenzy+XBOX+-+ProjectX.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigboobsplz","files":15,"time":1124278695,"description":"\n   ____________________ ________   ________________________________\n  _/         /        /           /     /       /      |     ____/\n |   /      /  /     /     /    /_/     /  /    /   /___|_    |__._______\n |     ____/        _   /    / /     /    ___/_  /      |   |  |      /\n |_____| |___________/_______/ /     /__________|________|___|  |    _/\n-X----- - --- - --- --- /____________/ -- - ----  -- ---- X/            \n                                                          /______|______\n  presents ......: Fusion Frenzy\n  Company .......: Microsoft\n\n  Origin ........: USA / NTSC              Format ........: *.ISO Image\n  System ........: Microsoft XBOX          # of Files ....: 13 x 50MB\n  Released ......: May 4th, 2002           Filename ......: PX-FF.RAR\n\n-X- ---- --- - --- ---------- -- - ------------- --- -- --- ---- --- --X-\n\n  4A non-stop party game with an edge, Fuzion Frenzy transcends\n  tradition with real-time multiplayer action, innovative game\n  concepts, futuristic themes and characters, dynamic 3D environments,\n  and next generation graphics and sounds. Fuzion Frenzy is an urban\n  street sport competition loaded with head-to-head, fast-paced\n  mini-games and a wide variety of gameplay offering something for\n  everyone. Fuzion Frenzy, the party-style game play you love, in an\n  environment that transports you to the future, only on the Xbox.\n\n  * Non-Stop action - The fun never ends with Fuzion Frenzy's\n    continuous action-packed game experience. Unlike turn-based games,\n    Fuzion Frenzy provides real-time play for all players in both the\n    main game and mini-games. \n\n  * Superior mini-games - Fuzion Frenzy contains many different types\n    of mini-games designed to broaded the appeal of the party game. All\n    of Fuzion Frenzy's mini-games provide head-to-head, fast-paced,\n    action-packed competition that requires strategy and skill to\n    conquer. \n\n  * Edgy, urban, futuristic theme and characters - Fuzion Frenzy's\n    edgy, urban, futuristic environment delivers a party game core\n    gamers can relate to. Gamers immerse themselves in the various\n    futuristic arenas for a more compelling gaming experience. \n\n  * Scaling - Players can customize the length of the game or play only\n    individual mini-games. \n\n  * Dynamic environments - Fuzion Frenzy includes highly interactive\n    and constantly changing urban-arena environments. These changes\n    make for a unique game playing experience every time. \n\n  * Superior graphics and sound - Impactful and advanced visual effects\n    and sound features are made possible with the power of Xbox\n    technology.\n\n  We tested this game on a developer XBOX, and it works.  Since there is\n  no mod chip yet, we have no idea if this release will work on retail\n  XBOXes when/if a mod comes out.  However, now that there is a release,\n  a modchip developer will be inclined to get our releases to work, so\n  we think a future mod will work with this release.\n\n  If a game is small enough to be burned to a CD, you can burn it to \n  either a CD or DVD, at your option, using the same ISO file.  \n  The Xbox does not use media checks like the PS2. \n\n  When burning to a CD, if your CD burning program has an option, \n  choose &quot;MODE1/2048&quot;, exactly as if you were burning a PC CD-ROM.\n  We recommend PrimoDVD for burning Xbox for both CD and DVD, but \n  all CD writing software besides Clone CD should work fine.\n\n  From our experience, the retail Xbox can only read DVD-RW's\n  and CD-RW's, so if you want to be sure that these will work\n  with a future mod, we recommend burning them to Rewritable\n  discs. We have heard reports of the retail Xbox reading some\n  types of DVD-R discs, but we have been unable to verify this.\n\n-X-- --- - ----------- -- -------- - - -- ------------- -------- --- --X-\n\n                _____ _____  ____   /____   __  ___/___  /\n               /_____)_____)/     //__    /      /    /\n           _ _/    /   _  /______/______/______/     /\n                              ___/              /        _ _\n\n","torrent":{"xt":"urn:btih:bd580c26224256051c2bbceda0096912a90bcb31","amp;dn":"Fuzion+Frenzy+XBOX+-+ProjectX.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd580c26224256051c2bbceda0096912a90bcb31","infoHashBuffer":{"type":"Buffer","data":[189,88,12,38,34,66,86,5,28,43,188,237,160,9,105,18,169,11,203,49]},"announce":[],"urlList":[]}}