{"title":"Infinity Inc 1-53, annuals, specials  (Catseye2001) [h33t]","uid":4012347,"size":850401795,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:be0fd6cd1f82b7e5f732f9fcdea317f3f1068a9a&amp;dn=Infinity+Inc+1-53%2C+annuals%2C+specials++%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Catseye2001","files":64,"time":1202167676,"description":"Sorry, no pics today--I&amp;#039;m fluish and it&amp;#039;s taken me 2 days to crawl from bed to the computer. But here&amp;#039;s DC&amp;#039;s Infinity Inc, issues 1-53 plus annuals 1 and 2, Huntress Origin, the Infinity Inc/Outsiders mini, Showcase 97-99 (Power Girl issues), and Young All-Stars Annual 01.\n\nSnipped from Wikipedia:\n\nInfinity Inc. is a team of comic book superheroes in the DC Comics universe, mostly composed of the children and heirs of the Justice Society of America, making them the Society&amp;#039;s analogue to the Teen Titans, which is composed of sidekicks of Justice League members. Created by Roy Thomas, Jerry Ordway and Mike Machlan, they first appeared in All-Star Squadron #25 (September 1983). It is also the name of the comic book starring the group, which ran from issue #1 (March 1984) through #53 (June 1988).\n\nThe group was organized by Sylvester Pemberton, the original Star-Spangled Kid in Infinity Inc. (vol. 1) #1 when a number of JSA proteges were denied admission to the JSA. They instead formed their own group. Members of Infinity, Inc. were known as Infinitors.\n\nRoy Thomas and his wife Dann wrote the series throughout its run. Artists on the series included Todd McFarlane, Vince Argondezzi and Michael Bair.\n\nThe series ended with the death of the Star-Spangled Kid (by then known as Skyman), and presumably the group disbanded shortly thereafter. Several members have gone on to supporting roles in other comics series. Fury filled a pivotal role in The Sandman and is the mother of Daniel. Hourman, Nuklon (as Atom Smasher), Silver Scarab (as Dr. Fate) and Power Girl eventually joined the 21st Century incarnation of the JSA.\n\nOriginally, the series took place on the parallel world of Earth-Two, but in 1986 it was merged with the rest of DC continuity following Crisis on Infinite Earths. From then on, they shared their spot as Los Angeles&amp;#039; superteam with The Outsiders, and were involved in a crossover with The New Teen Titans.\n\nEnjoy, and Seed!!  ","torrent":{"xt":"urn:btih:be0fd6cd1f82b7e5f732f9fcdea317f3f1068a9a","amp;dn":"Infinity+Inc+1-53%2C+annuals%2C+specials++%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be0fd6cd1f82b7e5f732f9fcdea317f3f1068a9a","infoHashBuffer":{"type":"Buffer","data":[190,15,214,205,31,130,183,229,247,50,249,252,222,163,23,243,241,6,138,154]},"announce":[],"urlList":[]}}