{"title":"Rocket from the Crypt - Final Show DVD","uid":4009430,"size":4429398016,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:be6627627e04ce278ad7a5f160ed2c04ef1f859a&amp;dn=Rocket+from+the+Crypt+-+Final+Show+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Whitebelt","files":10,"time":1201996396,"description":"Demise\nIn August of 2005, after breaking up Hot Snakes, Reis announced that Rocket From the Crypt would play their final show that Halloween in San Diego. After a final east coast performance in New York, they played an emotional yet typically raucous farewell show before a capacity crowd at the Westin Horton Plaza Hotel in downtown San Diego on Halloween, which was filmed for a DVD release.\n\nFollowing the band\\&amp;#039;s breakup Reis focused his energy on running Swami Records and continued to play with the Sultans. Reichert founded and runs the online merchandise company Merch Lackey. O\\&amp;#039;Beirne teaches project management and marketing at a San Diego high school, while Crane left San Diego semi-permanently for Belize. Stamets continues to perform in San Diego-area bands such as Beehive and the Barracudas. Rubalcaba became part-owner of the independent record store Thirsty Moon Records in the Hillcrest area of San Diego and plays with the band Earthless. He also joined Reis in the Sultans for infrequent performances until that group\\&amp;#039;s breakup in January 2007.\n\nSwami Records released a \\&quot;rough cut\\&quot; of the Rocket From the Crypt farewell concert DVD in time for Halloween 2006, with a finished version including a live CD scheduled for release sometime in 2007. A fire at the offices of Fourth Project, the video company producing the DVD, pushed back this final version and it remains to be seen whether the loss of equipment and facilities will affect the eventual release. Also in the works are a DVD of the band\\&amp;#039;s music videos, assorted live footage and interviews, as well as a third installment of their All Systems Go rarities series.\n\n","torrent":{"xt":"urn:btih:be6627627e04ce278ad7a5f160ed2c04ef1f859a","amp;dn":"Rocket+from+the+Crypt+-+Final+Show+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be6627627e04ce278ad7a5f160ed2c04ef1f859a","infoHashBuffer":{"type":"Buffer","data":[190,102,39,98,126,4,206,39,138,215,165,241,96,237,44,4,239,31,133,154]},"announce":[],"urlList":[]}}