{"title":"Marshall Thomas - Monarch - Mind Control Programs (2007)","uid":3760728,"size":631558732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bfc1d1a6ea817665aeb39fe72fd6aeaa7cfd38e7&amp;dn=Marshall+Thomas+-+Monarch+-+Mind+Control+Programs+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grinreaper_CCE","files":20,"time":1186068732,"description":"Monarch: The New Phoenix Program, run time 2.5hrs.\n\nThis work of a series of short videos by Marshall Thomas is dedicated to exposing the current Phoenix Program in the US aimed at dissidents, whistleblowers, and \\\\\\&quot;security risks\\\\\\&quot;, who are subjected to a combined program of Phoenix, MKULTRA, Cointelpro, and human experimentation using non-lethal weapons. The beginning videos establish a pattern of behavior, show the scientists and their research, and expose previous similar crimes that are historical fact. The final videos showing the situation of targeted individuals are not proven facts, but stem from my meetings with over 150 of the current victims in the US. Please view the Monarch films beginning with chapter one. The previous films are slide shows that contain more background information. The total run time for Monarch is 2 hours. For more info on targeted individuals go to mindjustice.org\n\n\nChapter 1 Phoenix Program\n\nThe Phoenix Program was the assassination campaign in Vietnam that killed 40,000 civilians suspected of aiding the enemy. Phoenix was the formative experience for a generation of CIA and military intelligence personel, such as NSA general Michael Aquino and Col. John B. Alexander. It is the blueprint for the current counterinsurgency/infiltration campaign waged against domestic dissidents using state of the art microwave weapons that kill with invisible bullets. Chapter one of a twelve part series.\n\n\nChapter 2 Human Radiation Experiments\n\nChapter two of ten. Thousands of US citizens are used as human guinea pigs in a secret program that began in 1943 and was made public in 1995.\nIt included plutonium injections, total body irradiation, purposeful exposure of military personel, and poisoning of millions of US civilians from fallout.\n\nChapter 2B Human Radiation Experiments\n\nThe history of US government human experimentation begins with the Manhattan Project.\n\n\nChapter 3A MKULTRA 1953\n\nDetails Russian and Chinese brainwashing techniques and the US mind control program known as MKULTRA circa 1945-1953.  \n\nChapter 3B: MKULTRA 1953\n\nHow Nazi Paperclip scientists were recruited for human radiation studies, microwave technology, and MKULTRA mind control experiments.\n\nChapter 3C: Ewen Cameron\n\nThe only legal challenge to MKULTRA that has succeeded in 60 years of operations. Ewen Cameron was the world\\\\\\&amp;#039;s most influencial psychiatrist, and a CIA contractor for MKULTRA. He experimented on how to wipe the human mind clean and then program it using electroshock therapy, LSD, sensory deprivation, and depatterning...the use of a programmed message repeated continuously for weeks and months to break down the human mind. His participation in experiments on children in the US were never made public. The wife of a Canadian MP was able to fight back and won in court decades after the fact.\n\n\nChapter 4A MKULTRA 1960-1970\\\\\\&amp;#039;s\n\nThe MKULTRA torch is passed to Richard Helms, Dr. Stephen Aldrich, and the methodology changes from using LSD and torture to the use of radio frequency radiation and microwave technology in place of LSD.\n\nChapter 4B Project Pandora\n\nThe USSR begins to microwave the US embassy and the US ambassador and other embassy employees eventually die from the attacks. Dr. Henry Kissinger secretly gives them hazard pay.\n\n\nChapter 5A MKULTRA Cults\n\nNSA General Michael Aquino begins forming and infiltrating cults and other closed systems with the formation of the Church of Satan in 1966. This psychological warfare operation that now spans several generations is an infiltration operation/counterinsurgency aimed at subverting Constitutional authority in the United States and other nations.\n\nChapter 5B MKULTRA Cults and SRA\n\nThe script for this segment borrows heavily from the heroic work of Alex Constantine, but he is not associated with the production in any way. More detail on cults started or infiltrated by the intelligence community in their destabilization campaign. The use of sexual blackmail against powerful political, industrial, media personalities secures perpetual funding for MKULTRA operations and political cover for their crimes.\nThe books are free at myspace.com/marsboy683 (blog)\n\nChapter 5C False Memory Syndrome Foundation and SRA\n\nThe False Memory Syndrome Foundation was created and staffed by CIA psychiatrists such as Dr. Martin T. Orne, a founding member of the FMSF and a CIA funded researcher into experimental psychiatry at the Univ. of Penn. Ralph Underwager is the world authority on FMS, and has claimed that most women molested as children said the experience was good for them. The executive directors of the FMSF are Paul and Shirley Eberlie, who ran the tabloid FINGER in the 1970\\\\\\&amp;#039;s which delved into S&amp;M, child/adult sex, and sex acts involving excrement. Their daughter has accused them of abusing her as a child. The FMSF was set up as a cover for CIA sponsored mind control experiments outside of the laboratory. It is staffed and led by pedophiles and CIA psychiatrists to discredit victims of SRA as they come forward. The author of much of this material is Alex Constantine. I acknowledge his heroic work and though he is not associated with this production, has inspired me, and it is from him I draw much of the research. Please read his books. The books with supporting info are free at myspace.com/marsboy683 (blog)\n\n\nChapter 6 The Trojan Horse\n\nThe Nazi Trojan Horse and the current INSCOM/NSA Trojan Horse operation using remote viewing as a screen for non-lethal psychotronic weapons development. Cults and other closed systems are used to continue MKULTRA mind control techniques.\n\n\nChapter 7 Greenham Common Microwave Attacks\n\nThe peace campers at Greenham Common England attacked with directed energy weapons beginning in 1984. The DOD uses the DOJ to hide development programs of microwave and radio frequency weapons that include human experimentation on US citizens under the guise of non-lethal weapons and \\\\\\&quot;crowd control\\\\\\&quot;.\n\n\nChapter 8 Cointelpro\n\nCounter-intelligence program run primarily by the FBI targeting internal dissidents using dirty war tactics to incarcerate or force a suicide. Presently continuing using non-lethal microwave weapons.\n\n\nChapter 9 CIA Blowback\n\nThe ability to destabilize foreign elected governments at will has led to the same ability here at home. Decades of dirty wars to topple governments hostile to US corporate interestshas led to danger at home and abroad.\n\nChapter 9B CIA Drug Running\n\nTwo cases that illustrate that the intelligence services have been financing operations using heroin and cocaine sales since the end of WWII.\nThe Golden Triangle and Iran Contra are two stops along the road of consolidation of the drug trade under US intelligence agencies that would have made Andrew Carnegie proud. Since the fall of the Taliban, heroin production in Afghanistan is now nearly 700 metric tons, enough for 120% of world demand. Follow the money...\nThe books with supporting info are free at myspace.com/marsboy683 (blog)\n\n\nChapter 10A: MKULTRA Scientist\n\nThe scientific work of Andre Puharich, Allen Fry, and Michael Persinger is proof of the existance of microwave weapons designed to remotely influence the human nervous system.\n\nChapter 10B Russian Mind Control\n\nMy two books with supporting info are at myspace.com/marsboy683 (blog) USSR directed energy weapons and mind control program. Dr. Igor Smirnov sells his mind control patent to the remote viewing company Psy-Tech. Please see this film from the beginning...\nyoutube.com/marsboy683 click playlist, click Monarch, click play all video, 2hrs.\nPsychotechnologies Inc. is run by Lt. Col. John B. Alexander, NSA General Michael Aquino, Maj. General Albert Stubblebine, all individuals connected to non-lethal psychotronic weapons developments programs and remote viewing at INSCOM and Los Alamos Laboratories.\n\nChapter 10C HAARP\n\nHigh Frequency Active Auroral Research Project HAARP. The Navy and Air Force have constructed a radio frequency radiation weapon that is everything Star Wars was supposed to be, and more.\n\n\nSee entire 2hr movie youtube.com/marsboy683 click PLAYLIST, click MONARCH, click PLAY ALL VIDEOS.\nThe books with supporting info are free at myspace.com/marsboy683 (blog)\nBuy the books/DVDs at customflix, amazon, theconnextion, lulu.com See the links at MonarchNewPhoenix.org /com\n\nTech specs (of first part):\n\nGeneral #0 \nFormat : AVI \nFormat/Info : Audio Video Interleave \nFormat/Family : RIFF \nFile size : 41.7 MiB \nPlayTime : 9mn 26s \nBit rate : 610 Kbps \nStreamSize : 1.12 MiB \n\nVideo #0 \nCodec : DivX 5 \nCodec/Family : MPEG-4 \nBit rate : 508 Kbps \nWidth : 320 pixels \nHeight : 240 pixels \nAspect ratio : 4/3 \nFrame rate : 25.000 fps \nResolution : 8 bits \nChroma : 4:2:0 \nInterlacement : Progressive \nBits/(Pixel*Frame) : 0.261 \nStreamSize : 34.3 MiB \nWriting library : SUPER(C) \n\nAudio #0 \nCodec : MPEG-2 Audio layer 3 \nBit rate : 94 Kbps \nBit rate mode : CBR \nChannel(s) : 2 channels \nSampling rate : 22 KHz \nResolution : 16 bits \nStreamSize : 6.31 MiB \n\nTotal runtime: 9mn 26s + 7mn 42s + 6mn 36s + 5mn 19s + 6mn 41s + 5mn 44s + 5mn 8s +\n\t       4mn 33s + 10mn 23s + 8mn 1s + 10mn 1s + 7mn 33s + 10mn 18s + 6mn 55s +\n\t       8mn 44s + 6mn 4s + 8mn 49s + 6mn 58s + 10mn 27s = 2h 25mn 22s\n\n===============================================================================\nOur leaders lie, cheat, steal and kill virtually with impunity. Find out why @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:bfc1d1a6ea817665aeb39fe72fd6aeaa7cfd38e7","amp;dn":"Marshall+Thomas+-+Monarch+-+Mind+Control+Programs+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfc1d1a6ea817665aeb39fe72fd6aeaa7cfd38e7","infoHashBuffer":{"type":"Buffer","data":[191,193,209,166,234,129,118,101,174,179,159,231,47,214,174,170,124,253,56,231]},"announce":[],"urlList":[]}}