{"title":"You got asperger, kid!","uid":3875766,"size":7495808,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c0e8e432c2d68a871b68da5bfdca25db3bfbb662&amp;dn=You+got+asperger%2C+kid%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smartskallen","files":1,"time":1194379978,"description":"You Got Asperger's\nYou got Asperger's, this ain't a barbecue.\nIt's your whole afternoon though, lost down a rabbit hole,\nlooking for a timepiece, wonder when your date's at,\nwonder if she'll visit you at all today ? relax.\n\nWonder how many ribbons to expect in her hair ?\nto deflect talk of triplets in respect for the pair\nor to stare at the bow made of four different colors ?\ndidn't notice someone talking to you: there were others\nin the room, out in the gloom of the periphery.\nTo shift your focus for a moment is to give the ribbons liberty,\nand that's to suggest they make escape.\n\nThis is a secret from the future: can't rewind like a tape.\nGot to make the best and the most of each moment as it happens,\ngot to keep your eyes on those bows, got to trap in\nyour vision all four of them 'cause this is a first:\nshe might have noticed last time that you like ribbons that are hers.\n\nYou Got Asperger's\n\nAnd sometimes you wish you didn't. Sometimes it slips your mind.\nBut when she's supposed to visit isn't one of those times,\nand you're on one of those lines of thought that you encounter\nwhen you'd rather your surroundings were quieter instead of louder\nso that you could focus on other than a clock tick.\n\nYou don't want to talk shit but the one who made the clock made the cog stick.\nMinutes are violent noise,\nobliterating what you thought of as silent poise .\nMiles of boys before you done got crushed\nout on a girl like that, her hair flush\n\nwith ribbons on all occasions and every day.\nIf only making study of the bow could stem its getaway.\nLetter A S P E R G E R S:\nwonder whether she's so confident with alphabets\nthat she'd do it backwards skipping alternate letters.\nIf you offer demonstration, would she consider that clever?\n\nThis bitter endeavor: trying to predict a reaction.\nYou know you're supposed to try to give the notion traction\nbut it don't do nothing 'cept make the clock tick.\nIt don't even do that. Yo, you got Asperger's, kid.\n\nAnd I feel for you, son. I know love is hard.\nCan't even write down all the answers on the back of a card.\nFrom the back and the far end of a cafeteria line\nyou seem to catch sight of a ribbon. Fabric shines,\n\nand you abandon your tray, leave it clatter on the floor.\nYou haven't planned it this way. You can't look at her no more.\nYou don't know what her eyes are like, whether she ever smiles,\nwhether anything other than how she wears her hair beguiles.\n\nAnd while some apron ladies holler at you,\nyou clutch your left ear and stand still like a statue.\nYou could count cut corn on the floor without subtracting\nmisplaced fish sticks like Dustin Hoffman overacting.\n\nAin't this already a scene in need of a fast forward?\nWhy won't the lunch people hush, do they court discord?\nYou think you see a flash of color fleeing; it could be worse:\nyou could have known how many ribbons there are, if they were hers. &lt;a href=&quot;\nhttp://frontalot.com/index.php/?page=lyrics&amp;lyricid=42&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://frontalot.com/index.php/?page=lyrics&amp;lyricid=42&lt;/a&gt;","torrent":{"xt":"urn:btih:c0e8e432c2d68a871b68da5bfdca25db3bfbb662","amp;dn":"You+got+asperger%2C+kid%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e8e432c2d68a871b68da5bfdca25db3bfbb662","infoHashBuffer":{"type":"Buffer","data":[192,232,228,50,194,214,138,135,27,104,218,91,253,202,37,219,59,251,182,98]},"announce":[],"urlList":[]}}