{"title":"[marc77] Grandizer 01 [HQ][Arabic]","uid":3766308,"size":154630740,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c10dc6ef1f30684f9cf0724895081e4eff29c6b6&amp;dn=%5Bmarc77%5D+Grandizer+01+%5BHQ%5D%5BArabic%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Grandizer","files":1,"time":1186559629,"description":"Grandizer [High Quality][Arabic] by marc77. Like the demo I released earlier this is a new version of Grandizer in Arabic using the French DVD\\&amp;#039;s as the video source. I did not edit anything from the originals although note that the French versions are slightly edited themselves but the edits are insignificant. I wish I had the original Japanese versions to work with but they are out of my affordability range so I had to go with the French ones.\n\nEach episode was re-synced by hand. Please understand that the syncing process is slow and tedious so I will be releasing them one at a time as I get them done. I have a very limited seeding ability. At best my connection will only seed at around 20-30k please, if you like this work, seed it or send it to someone who can seed it properly to help get it to everyone who wants it.\n\nDisclaimer: The work I am doing here is meant to be free for Arabic viewers. You may not resell or profit from these videos in any way and that includes selling them on ebay or your website, or anywhere else for any more than $1 per DVD (since DVD\\&amp;#039;s cost less than $0.25 cents now). If I find (or get any reports that state) anyone selling them for profit I will stop all work and not distribute any new episodes. Furthermore if anyone is caught selling them they will be reported to various authorities and/or I will spread word of their blatant theft all over the internet on Arabic sites.\n\nLastly please support this anime by buying some of the Go Nagai\\&amp;#039;s work. Most of his work is in Japanese but by buying legal products you support the author so he can continue making more animation that we can then dub or subtitle later. He has already stated that he would start working on new Mazinger &amp; Grandizer animes soon and I would love nothing more than to see modernized versions of my favorite animes.\n\nThank you for your time and enjoy.\n\nmarc77\n\n\n\nPS. I am searching for English subs for Grandizer. If anyone knows how to get them please leave a message here with some information.","torrent":{"xt":"urn:btih:c10dc6ef1f30684f9cf0724895081e4eff29c6b6","amp;dn":"%5Bmarc77%5D+Grandizer+01+%5BHQ%5D%5BArabic%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c10dc6ef1f30684f9cf0724895081e4eff29c6b6","infoHashBuffer":{"type":"Buffer","data":[193,13,198,239,31,48,104,79,156,240,114,72,149,8,30,78,255,41,198,182]},"announce":[],"urlList":[]}}