{"title":"UnHackMe 4.6 Build 285","uid":3945351,"size":7873684,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c19a229951fcfdbcd4ef45266aaf6f3205e7ab9a&amp;dn=UnHackMe+4.6+Build+285&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":5,"time":1198430770,"description":"UnHackMe - First BootWatch AntiRootkit! Now it is the must have tool for you!\nUnHackMe is specially designed to detect and remove Rootkits (a new generation of Trojan programs - invisible Trojans). A rootkit is a program that a hacker uses to mask intrusion and obtain administrator-level access to a computer or computer network. The intruder installs a rootkit on a computer using a user action or by exploiting a known vulnerability or cracking a password. The rootkit installs a backdoor giving the hacker a full control of the computer. It hides their files, registry keys, and process names, and network connections from your eyes.\n\nYour antivirus could not detect such programs because they use compression and encryption of its files. The sample software is Hacker Defender rootkit. UnHackMe allows you to detect and remove Rootkits.\n\nSupported Windows NT4/2000/XP(64)/2003(64)/Vista. Compatible with all known antiviral software. \n\nWhat&amp;#039;s new in version 4.6:\n1. Updated UnHackMe for removal modern rootkits.\n2. Added additional options for user safety: &quot;Safe deleting&quot; at virus scan. If this option is active, &quot;Virus Scan&quot; renames the file by adding the &quot;.del&quot; extension, stopping it to be able to cause any damage. &quot;System Restore&quot; option may be changed directly from UnHackMe main screen, before stopping a rootkit.\n3. Added an option for hiding &quot;Partizan&quot; messages during startup. The setting is available in the &quot;Options&quot;, &quot;Partizan&quot; screen.\n4. Added feature for quick disabling autorun on the fixed and flash drives (in the Reanimator, &quot;Features&quot; menu).\n5. Feature for sending reports to the Greatis Support Center (in the &quot;Advanced Check&quot; dialog).\n6. Auto shrink UnHackMe log files. It works automatically than the log file grows bigger than 2000 rows. \n\nUnHackMe tested for removal all modern rootkits: Rustock, Haxdoor, Hacktool, Elite Keylogger etc.\n\nHomepage - http://www.greatis.com/unhackme/\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:c19a229951fcfdbcd4ef45266aaf6f3205e7ab9a","amp;dn":"UnHackMe+4.6+Build+285","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c19a229951fcfdbcd4ef45266aaf6f3205e7ab9a","infoHashBuffer":{"type":"Buffer","data":[193,154,34,153,81,252,253,188,212,239,69,38,106,175,111,50,5,231,171,154]},"announce":[],"urlList":[]}}