{"title":"Only Fools and Horses.Missing Episodes-OnlyMe1","uid":4000945,"size":364397771,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c1be486fde398cf7093e32c65baa9a13a329ca1d&amp;dn=Only+Fools+and+Horses.Missing+Episodes-OnlyMe1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"abqwerty","files":6,"time":1201560763,"description":"Only Fools and Horses. Missing Episodes.-Onlyme1\n\n\n\nFriend of mine AHFA, had these and Uploaded them to me. The Quality is not A1 but it&amp;#039;s for FREE.\nThis makes a full Box set all episodes all series. If you like it go and buy it.\n\n\nOnly Fools and Horses.S02E08-Christmas Trees  (08 mINS)\n\nThis is the rarest and most sort after episode ever made.\n\nBrief: Dels latest line is selling telescopic Xmas trees. Maybe a bit of advertising down the local church wouldn&amp;#039;t do any harm. Will Del understand the ethics involved? \n\nDespite knocking the price down to a mere six quid, Del Boy can&amp;#039;t shift his telescopic Christmas trees (lights, bangles, beads and baubles inclusive). He only has 149 more to sell to make a tidy profit.\nStuck for a solution the Trotters decamp to Sid&amp;#039;s burger van. Del&amp;#039;s conscience seems to get the better of him, and he tells Rodney and Grandad what a shame it is that the market traders can&amp;#039;t afford to donate a tree to the local church this year. Especially the little orphans.\nLeft to guard the trees, Rodney steals away to the church.\nThe Vicar quickly debunks Del&amp;#039;s story, and Rodders realises the tale was a scam to get an endorsement from The Church of England.\n\nOnly Fools and Horses.S03E09-Licensed to Drill\t(27 mINS)\n\nBrief: Delboy and Rodney are seen in this extremely rare episode filmed around 1984. This 27 minute episode includes Grandad.\n\n\nOnly Fools and Horses.S04E08-White Mice  (05 Mins)\n\nThis has never been rereleased since, and remains another rare episode.\n\nBrief: Part of a BBC Breakfast Time Christmas Special, this rare clip shows Del explaining how to sell some White Mice to a &amp;#039;Wally In A Hat&amp;#039;.\n\n\nOnly Fools and Horses.S05E09-Royal Variety Show\n\nExtremely rare footage.\n\nBrief:  This scene took place during the Royal Variety Performance Show.\n\nDel and Rodney along with Albert arrive at Drury Lane London thinking they are delivering dodgy goods to Chunky Lewis a nightclub owner in the West End. Unfortunately they take a wrong turn and end up walking into the middle of the Royal Variety performance. They mistake the Duchess of York (Fergie) for Chunky Lewis...bear in mind she wasn&amp;#039;t too slim in those days.\n\n\nOnly Fools and Horses.04-Comic Relief Special (Trilogy 1996)\n\nExtremely rare footage.\nTransmitted: 14.03.1997\nDuration: 10 minutes\n\nBrief: Del and Rodney discuss important issues with a touch of humour thrown in. They then make an appeal from the flat to the public. It was assumed it was the last official screening of Del and Rodney.\n\n\nAs part of the Comic Relief special, recorded after Time on our Hands, this made a special surprise for fans, where Del and Rodney unearthed jokes that dug at the roles both had played in recent years in other acting roles like Inspector Frost for David Jason.","torrent":{"xt":"urn:btih:c1be486fde398cf7093e32c65baa9a13a329ca1d","amp;dn":"Only+Fools+and+Horses.Missing+Episodes-OnlyMe1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1be486fde398cf7093e32c65baa9a13a329ca1d","infoHashBuffer":{"type":"Buffer","data":[193,190,72,111,222,57,140,247,9,62,50,198,91,170,154,19,163,41,202,29]},"announce":[],"urlList":[]}}