{"title":"Tomorrow The World - Hitleryouth Emil Goes America - US anti NAZ","uid":3348904,"size":732758016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c1e72a9b2eea0729a0a8271d0eec30c6e184c593&amp;dn=Tomorrow+The+World+-+Hitleryouth+Emil+Goes+America+-+US+anti+NAZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fudoh","files":1,"time":1119798848,"description":"tomorrow the world by leslie fenton. american anti nazi propaganda movie. an american family adopts a hitler youth. hell ensues. hilarious! \n\ndvd to xvid, 560x416, 1:22:31, 698 mb \n\nimdb says (spoilers): \n\nOne must make allowances -- it was wartime, it was propaganda, it was United Artists -- but even taking all that into account, this is a fairly ludicrous melodrama about an upper-middle-class American household that brings chaos on itself by unknowingly inviting a Hitler Youth into its home. And what a little hellraiser he turns out to be -- writing anti-Semitic epithets about his teacher and potential stepmom (Field), whacking his cousin(Carroll) with a fireplace iron, attempting to knife a playmate. Adapted by no less than Ring Lardner Jr. from a hit Broadway play, it may have had resonance at the time, if audiences were willing to overlook pedestrian direction, absurdly melodramatic music, and Homeier's undisciplined histrionics (reprising his stage role, he's sort of a Nazi Dennis the Menace). But the script, like so many at the time, takes the goodness of Americans, all Americans, so for granted that it starts to sound smug and patronizing. (It's a mighty white-bread America they're portraying, too; if that's how things really were, it looks today like an unwitting expose of America's racist past.) It also suggests that it's fairly easy to deprogram these little monsters; all it takes is a bit of lovingkindness and a birthday present. March and Moorehead (playing a repressed spinster aunt, much like she did in &quot;The Magnificent Ambersons&quot;) were as good as movie actors get, but they're playing devices here, not flesh and blood. Under the circumstances, Betty Field manages to be surprisingly interesting -- she always looks so worried, like she has a horrible secret the audience never finds out.","torrent":{"xt":"urn:btih:c1e72a9b2eea0729a0a8271d0eec30c6e184c593","amp;dn":"Tomorrow+The+World+-+Hitleryouth+Emil+Goes+America+-+US+anti+NAZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1e72a9b2eea0729a0a8271d0eec30c6e184c593","infoHashBuffer":{"type":"Buffer","data":[193,231,42,155,46,234,7,41,160,168,39,29,14,236,48,198,225,132,197,147]},"announce":[],"urlList":[]}}