{"title":"All In One ISO Managers","uid":3360734,"size":16317895,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c20658d81d918577d278176aa2e692de0bdcb79c&amp;dn=All+In+One+ISO+Managers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Kalline","files":1,"time":1122268078,"description":"AceIso 2005 v1.0 \n\nAceISO is a high performance and easy to use CD image file editor. You can create ISO files from CD-ROM/DVD or hard disk easily, make bootable CD, convert format of CD image file, Add/Delete/Rename files/folders in CD image file, extract files from CD image and burn CD image file to a CD-R. \n\nAceISO support almost all ISO image format include standard .ISO and BIN/CUE format, Nero's .NRG format and Clone CD's IMG/CCD/SUB format. \n\nWith AceISO you can create bootable ISO image file with easy. All you need to do is add a boot record to you image. \n\n\nIsoBuster Pro v1.7 \n\nIsoBuster is a highly specialized yet easy to use CD and DVD data recovery tool. It supports all CD and DVD formats and all common CD and DVD file-systems (= set of files and folders). Start up IsoBuster, Insert a CD or DVD, select the drive (if not selected already) and let IsoBuster mount the media. IsoBuster immediately shows you all the tracks and sessions located on the media, combined with all file-systems that are present. This way you get easy access, just like explorer, to all the files and folders per file-system. Instead of being limited to one file-system that the OS picks for you, you have access to &quot;the complete picture&quot;. Access data from older sessions, access data that your OS (e.g. Windows) does not see or hides from you etc. \n\n\nIso Commander v1.5 \n\nISO Commander is CD/DVD images management utility. Among utility main features are CD/DVD bootable images creation and changing, direct images editing, convention from BIN/ISO/DAO/TAO/NRG images into standard ISO file and much more. \n\nProgram features list \n* Edit image files and folders using drag'n'drop. \n* Create image from files on your hard disc drive. \n* Add to the new or existing image boot image and also change or delete it. \n* Add, delete, rename and extract files and folders from the image. \n* Convert different images formats into standard ISO format. \n* Open CD/DVD disc as image, edit it and save result in the ISO image. \n* Create CD/DVD image by one mouse click. \n\n\nISOEdit v2.1.0 \n\nISOEdit is a powerful editor for CD-ROM/DVD image file. It can process almost all CD/DVD image files, such as: .iso, .bin, .img and .cif. \nYou can add/delete/rename/extract files directly from the image. You can convert image files to the standard ISO format and you have the ability to create ISO image files from a CD/DVD-ROM. \nISOEditor is also capable of making bootable CDs. \n\n\nISOpen v3.2.5 \n\n- ISOpen can burn your data CD and DVD, AUDIO cd from your MP3, WAV, OGG, WMA. (TAO, DAO, SAO supported). \n- ISOpen can burn your CD and DVD image file (ISO, BIN, CUE, IMG, CCD, NRG, CIF, MDF, CDI, C2D, BWI, VaporCD, PDI, MD1, XA, CMI etc...) \n- You can create ISO, Bin/Cue or NRG images from your favorites CD and DVD (included CD AUDIO) \n- You can create ISO or NRG image file from files and directories located on your hard disk. \n- You can Rip Audio CD to wav or mp3 \n- You can Open, extract, convert any type of cd or dvd image file (NRG, Bin/cue Multi-session supported). \n- You can convert you AUDIO files from/to WAV, MP3, OGG, WMA \n\n\nMagic Iso Maker v4.8 Build 0139 \n\nMagicISO is a powerful and easy CD/DVD image file edit tool. It can open/create/edit/extract CD/DVD image files, and convert bin to iso and back. Make image files from CD-ROM or hard disk, and handle bootable information. \n\nIt also can convert BIN or any other format file created by CD burning software (Such as Nero-Burning ROM, Easy CD Create) or virtual CD-ROM driver software (such as Daemon-tools) to standard ISO format. \n\nMagicISO has ability to create ISO image file. You can directly add/delete/rename files or folder in CD image file(s) with MagicISO. MagicISO can handle up to 10G large sizes so that user can extract/edit/open DVD image files in ease. \n\n\nUltraISO v7.5.2 ME \n\nDuplicate Disc to CD/DVD Image \nBuild Files/Folders to One ISO File \nOrganize and Manage Efficiently \nEdit and Convert ISO File in Many Format \nMake Bootable CD/DVDs \nCreate/Edit Audio CD Image \n\nUltraISO is a ISO CD/DVD image file creating/editing/converting tool , it can directly edit the CD/DVD image file and extract files and folders from it, as well as directly make ISO files from your CD/DVD-ROM or hard disk. At the same time, you can maintain the ISO bootable information, thus creating your own bootable CD/DVDs.","torrent":{"xt":"urn:btih:c20658d81d918577d278176aa2e692de0bdcb79c","amp;dn":"All+In+One+ISO+Managers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20658d81d918577d278176aa2e692de0bdcb79c","infoHashBuffer":{"type":"Buffer","data":[194,6,88,216,29,145,133,119,210,120,23,106,162,230,146,222,11,220,183,156]},"announce":[],"urlList":[]}}