{"title":"Marie_Osmond-Magic_Of_Christmas-(2007-Country-VBR)","uid":3918178,"size":72376926,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c21b19d21f616fe382371151dee540f902cae5ec&amp;dn=Marie_Osmond-Magic_Of_Christmas-%282007-Country-VBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cheng","files":18,"time":1196616367,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51lpUEkessL._SS400_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51lpUEkessL._SS400_.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51Em%2BQ525jL._SS400_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51Em%2BQ525jL._SS400_.jpg&lt;/a&gt;\n\n-=MARIE OSMOND Biography=-\n\nAs a child and a teenager, Marie Osmond endeared herself to an entire generation. That bond with her audience not only continued, but grew stronger through the years as Marie&amp;#039;s career blossomed into hit records, network television shows, Broadway musicals, movies of the week, world-wide concert tours, a top ten New York Times best selling book author, television commercials, lecture tours and an extremely successful Marie Osmond Collector Dolls business.\n\nWith all her successes over 40 years in the entertainment industry, Marie&amp;#039;s legion of fans now spans generations. \n\nMarie was first thrust into the spotlight in 1963 on &quot;The Andy Williams Show&quot; when the host placed the three-year old on his lap and introduced her as &quot;the youngest Osmond Brother.&quot; She began to make a name for herself 10 years later when at 13 years of age she exploded onto the music charts (#1 country/#5 pop) with &quot;Paper Roses,&quot; marking the first time in country music history that a female artist debuted with a #1 record. Her first concert performance soon after was a sold-out date at Madison Square Garden alongside The Osmond Brothers, with whom she now performed, prompting the group&amp;#039;s name to be changed to The Osmonds. Barely a teenager, she garnered a gold record and Grammy nominations for 1974&amp;#039;s Best Female Country Vocal Performance and Best New Artist. \n\nAfter the Paper Roses album, she released In My Little Corner of the World (1974) and Who&amp;#039;s Sorry Now (1975). Among the many TV guest appearances she made, one featured a duet with her brother Donny of their #4 top selling pop record &quot;I&amp;#039;m Leavin&amp;#039; It All Up to You&quot; and a guest hosting role with Donny. That, in turn, led to their weekly television variety series &quot;The Donny &amp; Marie Show&quot; (1976-81). During the show&amp;#039;s run, because of her famous &quot;Marie Cut&quot; hairstyle and her stylish wardrobe and keen eye for fashion, she became recognized as a trend setter and a role model for women throughout the world.\n\nIn 1979, Marie starred in the Christmas Classic TV movie &quot;The Gift of Love&quot; with James Woods and Timothy Bottoms. Following that, she played the role of her mother Olive for the 1982 TV movie &quot;Side By Side: The Story of the Osmond Family.&quot; In 1983, she starred in the TV movie &quot;I Married Wyatt Earp&quot; with Bruce Boxleitner. She would later co-host the television series &quot;Ripley&amp;#039;s Believe It Or Not&quot; (1985) and lend her voice-over and singing talents to children&amp;#039;s videos such as &quot;The Velveteen Rabbit&quot; (1985), &quot;Rose-Petal Place: Real Friends&quot; (1987), &quot;Buster and Chauncey&amp;#039;s Silent Night&quot; (1998) and &quot;O&amp;#039; Christmas Tree&quot; (1998).\n\nIn 1985, Marie turned once again to recording country music with the album There&amp;#039;s No Stopping Your Heart, which featured two #1 country hits: the title track and &quot;Meet Me In Montana,&quot; (a duet with Dan Seals which won the Country Music Association&amp;#039;s Vocal Duo of the Year award), as well as a third hit from the album, &quot;Read My Lips&quot;, which peaked at #4 as a single. I Only Wanted You (1986) earned her a CMA Vocal Duo of the Year nomination, this time with Paul Davis for the #1 country hit &quot;You&amp;#039;re Still New to Me.&quot; &quot;Cry Just a Little&quot; also reached the Top 20. Two other albums followed; All in Love (1988) and Steppin&amp;#039; Stone (1989), as did a 1989 nomination by the Academy of Country Music as Top Female Vocalist.\n\n&quot;Marie Osmond&amp;#039;s The Magic of Christmas,&quot; a very special holiday concert tour which also featured five of her children, played in major venues across the United States and Canada in the ?80s and ?90s. She remembers it as a &quot;totally wonderful and fun time for the family&quot;, and relaunched the tour during the 2006 Christmas season, receiving standing ovations at every performance during the month long tour. \n\nShe continued her singing and acting career performing the lead role of Maria in the national touring company of Rodgers Hammerstein&amp;#039;s &quot;The Sound of Music&quot; in 1994-95 (reprising her role for a Southeast Asia tour in the summer of 1997). \n\nEver in demand, in 1995 ABC Television asked Marie to star in the sitcom &quot;Maybe This Time&quot; with Betty White.\n\nIn 1997, she made her Broadway debut as Anna in Rodgers &amp; Hammerstein&amp;#039;s &quot;The King and I,&quot; opening to rave reviews, and in the spring of 1998, she headlined the show&amp;#039;s national touring production in San Francisco and Los Angeles.\n\nThen, in the fall of 1998, Columbia Tristar Television Distribution premiered the popular daytime entertainment/talk show &quot;Donny &amp; Marie,&quot; which ran for two full seasons.\n\nTrue international icons, NBC Television invited Marie and her brother Donny to perform for the closing ceremonies of the 2002 Winter Olympics, viewed by a world-wide audience.\n\nAnd again, in 2003, Marie and Donny were teamed with the popular Ozzie Osbourne and his family for the hilarious Pepsi Twist television commercial seen world-wide and voted the most recognized commercial spot of Super Bowl XXXVII.\n\nIn August, 2003, Marie and her family received a star on Hollywood&amp;#039;s prestigious Walk of Fame. After 40 years of television, 47 gold and platinum records and selling over 100 million records world wide, the Osmonds are acclaimed as on of the most prolific entertainment families in the world.\n\nMarie&amp;#039;s highly successful career had involved her in every medium of entertainment except radio, until in 2004 she launched into a whole new experiment and vista of entertainment with her fun and informative nationally syndicated talk/music radio show &quot;Marie &amp; Friends.&quot; After her final broadcast, Marie jokingly said it was fun for her because with eight children she really enjoyed the adult conversation with her radio &quot;friends&quot; every weekday!\n\nIn August, 2006, Marie joined the Fox Television Network family as a judge on American Idol executive producer Simon Cowell&amp;#039;s newest singing competition &quot;Celebrity Duets&quot;. She had a great time working with host Wayne Brady and fellow judges rock ?n roll icon Little Richard and famed producer/songwriter David Foster, &quot;because all the people involved are so talented, quick and bright ---- and besides, I kind of miss giving my male counterpart(s) a bad time!&quot; \n\nNow, one year later, in August of 2007, Marie has been invited to join a competitive celebrity cast of ABC Network&amp;#039;s &quot;Dancing With The Stars&quot;. &quot;There are worse habits I could take up going through mid-life crisis,&quot; jokes Marie. \n\nIn addition to being an international celebrity, Marie is also a savvy businesswoman. In 1991, she launched the &quot;Marie Osmond Fine Porcelain Collector Dolls&quot; line on QVC and at Disney theme parks. It has become QVC&amp;#039;s top selling doll line, was nominated for Trendsetter of the Year in the collectibles industry and has moved into the retail and direct response markets. Marie began sculpting a number of her own dolls in 1993, and has received several Dolls of Excellence and Doll of the Year award nominations. Marie recently was honored with QVC&amp;#039;s highest recognition, the coveted Q-Star Award, as well as being the first recipient of the collectible industry&amp;#039;s highest honor, the &quot;Crystal&quot; award.\n\nRecently, Marie has expanded her business activities to include a wide range of products for the home sewing and crafting market. With national exposure on QVC Network&amp;#039;s &quot;Crafting with Marie&quot; programs, she continues to inspire consumers nationwide.\n\nBut perhaps her proudest achievement, besides motherhood, has been her role as co-founder/co-host, with John Schneider, of Children&amp;#039;s Miracle Network, a project of The Osmond Foundation. The largest annual broadcast in fundraising history, it has raised in excess of 3.4 billion dollars since 1983 for children&amp;#039;s hospitals throughout the U.S. and Canada, 100% of which has stayed in the local area in which it was raised for medical treatment, research and assistance. In 1989, the Country Music Foundation presented Marie with the prestigious Roy Acuff Award in recognition of her efforts on behalf of children. \n\nShe is the proud mother of eight beautiful children, which she considers her greatest achievement.\n\n-=Product Description=-\n\n15 songs - 2007 release.\n\n____________________________________________________________________\n\n                    ___           ___           ___\n                   /  /         /  /         /__/\n                  /  /:/_       /  /::          :\n                 /  /:/ /     /  /:/:          :\n                /  /:/ /:/_   /  /:/  :   _______:\n               /__/:/ /:/ / /__/:/ __: /__/::::::::\n                 :/:/ /:/   : /  /:/   :~~~~/\n                  ::/ /:/     :  /:/     :  ~~~\n                   :/:/       :/:/       :\n                    ::/         ::/         :\n                   __/         __/         __/\n   ____________________________________________________________________\n\n                    Marie Osmond - Magic Of Christmas\n   ____________________________________________________________________\n\n\n   Artist  : Marie Osmond\n   Album   : Magic Of Christmas\n\n   Genre   : Other\n   Label   : Hi-Fi\n\n   Source  : CDDA\n   Size    : 69,0 MB\n\n   Quality : VBRkbps\n           : 44.1kHz\n           : Joint\n   ____________________________________________________________________\n\n   Tracklist:\n   ____________________________________________________________________\n\n   01    The Christmas Song                                       03:17\n   02    When Christmas Comes This Year                           04:38\n   03    Angels We Have Heard On High/away In A Manger            04:26\n   04    Season Of Seasons                                        03:59\n   05    Christmas Lullaby                                        03:57\n   06    The Gift Of Love                                         04:36\n   07    Hark, The Herald Angels Sing/o&amp;#039; Come All Ye Faithful     04:17\n   08    The Locket                                               03:11\n   09    Christmas In The Country                                 03:32\n   10    It&amp;#039;s Christmas Once Again                                03:34\n   11    O Holy Night                                             04:42\n   12    The Secret Of Christmas                                  03:31\n   13    The Lord&amp;#039;s Prayer                                        02:54\n   14    True Love                                                03:14\n   15    Santa Claus Is Coming To Town                            03:06\n\n                                                   Total Runtime: 56:54\n   ____________________________________________________________________\n\n   Release Notes:\n   ____________________________________________________________________\n","torrent":{"xt":"urn:btih:c21b19d21f616fe382371151dee540f902cae5ec","amp;dn":"Marie_Osmond-Magic_Of_Christmas-%282007-Country-VBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c21b19d21f616fe382371151dee540f902cae5ec","infoHashBuffer":{"type":"Buffer","data":[194,27,25,210,31,97,111,227,130,55,17,81,222,229,64,249,2,202,229,236]},"announce":[],"urlList":[]}}