{"title":"Alex Britti 2008 mtv unplagget no video","uid":4010654,"size":175467453,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c3f2e321a138d29a3da57af3f67cc7e8b0acb43b&amp;dn=Alex+Britti+2008+mtv+unplagget+no+video&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"crazytoyboy","files":21,"time":1202066058,"description":"La carriera di Alex Britti ha avuto inizio nell&amp;#039;estate del 1998, quando il suo singolo Solo una volta (o tutta la vita) ÃƒÂ¨ balzato al primo posto delle classifiche italiane.\n\nNell&amp;#039;ottobre del 1998 ha pubblicato il suo primo album, It.Pop che ha venduto piÃƒÂ¹ di trecentomila copie.\n\nNel 1999 ÃƒÂ¨ approdato al Festival di Sanremo vincendo nella categoria Nuove Proposte con la canzone Oggi sono io, che qualche anno dopo ÃƒÂ¨ stata incisa anche da Mina.\n\nNel 2000 ha pubblicato il suo secondo album, La vasca, ed i suoi due singoli Una su 1.000.000 e La vasca lo hanno portato di nuovo ai primi posti delle classifiche.\n\nNel 2001 ha partecipato di nuovo al Festival di Sanremo con Sono contento, che si ÃƒÂ¨ classificata al settimo posto. Nel 2003 vi ÃƒÂ¨ tornato con 7000 caffÃƒÂ¨ (si ÃƒÂ¨ classificato secondo, subito dopo Alexia). Ha, poi, pubblicato il suo terzo album, &quot;3&quot;, che contiene anche i singoli La vita sognata e Lo zingaro felice.\n\nNel 2005 ha pubblicato il suo quarto album dal titolo &quot;Festa&quot;, in cui sono presenti tre canzoni composte in collaborazione con Maurizio Costanzo. Dall&amp;#039;album sono stati estratti tre singoli: &quot;Prendere O Lasciare&quot;, &quot;Festa&quot; e &quot;Quanto Ti Amo&quot;.\n\nNel 2006 ÃƒÂ¨ ritornato al Festival di Sanremo con &quot;...Solo con te&quot;, classificandosi terzo nella categoria uomini. Nel stesso anno dalla collaborazione con Edoardo Bennato nasce il duetto &quot;Notte di mezza estate&quot;, collaborazione che porta i due artisti a girare tutta Italia con un tour congiunto.\n\nIl 29 settembre 2007 ha registrato negli studi di Mtv Italia il secondo MTV Unplugged italiano della storia: il concerto che rivisita i successi del chitarrista in versione completamente acustica, uscirÃƒ  il 1 febbraio 2008 in un cofanetto a prezzo speciale Cd+Dvd, e, inoltre verrÃƒ  trasmesso su Mtv. Nel concerto, ÃƒÂ¨ presente anche un brano giÃƒ  dell&amp;#039;album &quot;La vasca&quot;(2000,la track 8): &quot;Milano&quot; , primo singolo estratto dall&amp;#039;album che verrÃƒ  programmato dalle radio e da Mtv stesso a partire da Gennaio 2008.\n\n","torrent":{"xt":"urn:btih:c3f2e321a138d29a3da57af3f67cc7e8b0acb43b","amp;dn":"Alex+Britti+2008+mtv+unplagget+no+video","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3f2e321a138d29a3da57af3f67cc7e8b0acb43b","infoHashBuffer":{"type":"Buffer","data":[195,242,227,33,161,56,210,154,61,165,122,243,246,124,199,232,176,172,180,59]},"announce":[],"urlList":[]}}