{"title":"Indie Classic!: Buffalo Tom - Let Me Come Over [1992]","uid":3973815,"size":60541123,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c45deeb8c2903491fe854c647ecf2b4a84f41588&amp;dn=Indie+Classic%21%3A+Buffalo+Tom+-+Let+Me+Come+Over+%5B1992%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tigerduck","files":1,"time":1200151923,"description":"While Birdbrain was a marked improvement over Buffalo Tom&amp;#039;s self-titled debut album, Let Me Come Over was truly the great leap forward for the band, sounding richer, more imaginative, and more emotionally powerful than anything they&amp;#039;d attempted in the past. Guitarist Bill Janovitz, bassist Chris Colbourn, and drummer Tom Maginnis individually displayed a greater command of their respective instruments, and collectively their interplay was certainly more confident and intricate, having traded in the muddy clamor of their first recordings for a more layered sound (complete with overdubbed acoustic guitars) that was clean, vibrant, and compelling. (Producers Paul Kolderie and Sean Slade certainly helped, bringing a clearer and better focused sound to these sessions than J Mascis drew from the band.) And while Buffalo Tom was shouting less on Let Me Come Over, they seemed to have a lot more to say; there&amp;#039;s a heart and soul to the lovelorn &quot;Taillights Fade&quot; and the yearning &quot;Velvet Roof&quot; that digs a good bit deeper than their previous work (and is also a lot easier to sort through), while even hard rockers such as &quot;Stymied&quot; and &quot;Saving Grace&quot; reflect a new maturity and seriousness of purpose. In fact, if Let Me Come Over has a flaw, it&amp;#039;s that Buffalo Tom seems to display a bit less joie de vivre than one might have expected, though after gaining this much in the way of both skills and smarts, you can&amp;#039;t blame them for wanting to show them off a bit.\n\nTracklist:\n1.\tStaples\n2.\tTaillights Fade\n3.\tMountains Of Your Head\n4.\tMineral\n5.\tDarl\n6.\tLarry\n7.\tVelvet Roof\n8.\tI&amp;#039;m Not There\n9.\tStymied\n10.\tPorchlight\n11.\tFrozen Lake\n12.\tSaving Grace\n13.\tCrutch\n\nGood music NEVER gets old!\nEnjoy!\n/Duck\t","torrent":{"xt":"urn:btih:c45deeb8c2903491fe854c647ecf2b4a84f41588","amp;dn":"Indie+Classic%21%3A+Buffalo+Tom+-+Let+Me+Come+Over+%5B1992%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45deeb8c2903491fe854c647ecf2b4a84f41588","infoHashBuffer":{"type":"Buffer","data":[196,93,238,184,194,144,52,145,254,133,76,100,126,207,43,74,132,244,21,136]},"announce":[],"urlList":[]}}