{"title":"The Burning Crusade US (Mac and PC)","uid":3974610,"size":2201638485,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c4c8fa7583780ebc8f1c8bae6af89245f8d67f0b&amp;dn=The+Burning+Crusade+US+%28Mac+and+PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JulTiNing","files":18,"time":1200190964,"description":"This is the add-on only, you will need a US version of the original WoW client, available for free at https://signup.worldofwarcraft.com/trial/10dayfreetrial.htm, or you can find it in one of the torrents here.\n\nFrom Blizzard:\nSeveral years have passed since the Burning Legion&amp;#039;s defeat at Mount Hyjal and the races of Azeroth have continued to rebuild their once shattered lives. With renewed strength, the heroes of the Horde and Alliance have begun to explore new lands and broken through the Dark Portal to investigate the realms beyond the known world. Will these heroes find friends or foes? What dangers and rewards lie in wait beyond the Dark Portal? And what will they do when they discover that the demons they thought vanquished have returned to renew their terrible Burning Crusade?\n\nWorld of Warcraft: The Burning Crusade is the exciting new expansion to Blizzard&amp;#039;s award-winning massively multiplayer online role-playing game. It expands the game by tremendous bounds, adding new races, lands, Battlegrounds, professions and items, and more.\n\nFeatures:\n\n# An increase in the level cap to 70\n# Two new playable races: the Blood Elves and the Draenei\n# Arena-based Player vs. Player Ladder System\n# New Battleground: Eye of the Storm\n# 3 New Cities, The Exodar, Shattrath and Silvermoon\n# The entire new continent of Outland, reachable through the Dark Portal\n# Many new high-level dungeons to explore in Azeroth, Outland, and elsewhere\n# Selectable Dungeon Difficulty Setting\n# New flying mounts in Outland\n# Many new and dangerous monsters, including epic world bosses\n# Hundreds of new quests\n# Hundreds of new items\n# A new profession: Jewelcrafting\n# Socketed items \n\nSimply run Installer.exe for PC or Installer.app for Mac users.\n\nGAME WILL NOT RUN ON OFFICIAL BLIZZARD SERVERS WITHOUT A PAID ACCOUNT.\nAll account information is stored server-side, meaning that there are no cracks or other ways around this.\n\nA list of private servers is available at http://www.xtremetop100.com/world-of-warcraft, choose the one that you like most.\n\nIf you enjoy this game then please support the people who made it by getting a paid account.","torrent":{"xt":"urn:btih:c4c8fa7583780ebc8f1c8bae6af89245f8d67f0b","amp;dn":"The+Burning+Crusade+US+%28Mac+and+PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4c8fa7583780ebc8f1c8bae6af89245f8d67f0b","infoHashBuffer":{"type":"Buffer","data":[196,200,250,117,131,120,14,188,143,28,139,174,106,248,146,69,248,214,127,11]},"announce":[],"urlList":[]}}