{"title":"WMWifiRouter_v0.91","uid":4009317,"size":137518,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:c5781199b8fe24b122d870b3ddfb4de478854748&amp;dn=WMWifiRouter_v0.91&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MeOminG","files":2,"time":1201992684,"description":"WMWifiRouter v0.91\n\nSize: 126 KB\nDate: January 15, 2008 (Updated)\nType: Freeware\nRequirements:\n\nWindows Mobile 5.0 / WM6\n\n\nAuthor: Chainfire\nHome: http://www.jongma.org/WMWifiRouter/\nForum: http://forum.xda-developers.com/showthread.php?t=357152\n\t\n\nDescription:\nWMWifiRouter is a tool that turns your Windows Mobile device into almost an Access Point. Almost, because it uses an Ad-Hoc (computer-to-computer) connection instead of infrastructure mode. It&amp;#039;s purpose is the same though: allow your WiFi-enabled devices to use your WM device&amp;#039;s data connection to connect to the internet.\n\nBase requirements:\n- Windows Mobile 5 - SmartPhone Edition or PocketPC (with phone functionality) Edition.\n- Windows Mobile 6 - Standard or Professional (NOT Classic!).\n- A WiFi connection on your device.\n- A (cellular) data connection on your device.\n- Internet Connection Sharing (ICS) installed (and working) on your device ( \\Windows\\IntShrui.exe ) - if you do not have this installed, see the FAQ section.\n\nInstallation:\nDownload the ZIP to install it on your phone through your desktop. Note that you must turn WiFi to ON before you start the installation. The installer will create an Ad-Hoc network called &quot;WMWifiRouter&quot; on your device. On first run, WMWifiRouter will create a backup of some important registry settings it will change during operation as well. Note that the Ad-Hoc network that it creates does not have any security set. Once you are satisfied that everything is working correctly, you should add WEP-based encryption through your control panel.\n\nIf you are using a version that doesn&amp;#039;t have the installer yet (v0.84 and older) you should first fully remove WMWifiRouter from your device. You can remove the shortcut inside WMWifiRouter itself through the options menu, and you can then just delete the EXE file. Remove the Ad-Hoc network you made and you&amp;#039;re all set.\n\nUninstallation:\nWiFi should be turned on for uninstallation as well.\n\nUsage:\nWMWifiRouter is very simple to operate (if everything goes well). After installation just start the program, press &quot;Connect&quot;, wait until the screen gives you a fully green icon and then you can connect your other WiFi-enabled devices to the &quot;WMWifiRouter&quot; network. Once you are connected, for most devices you can just press the power button to turn off the screen and other power using components of your device, while it remains functional as a WiFi router.\n\nNOTICE: If you have a Titan / Mogul or other device that has a hardware WiFi switch, turn this to the on position before starting WMWifiRouter.\n\nNOTICE: Obviously, using WMWifiRouter to tether over WiFi uses your phone&amp;#039;s data connection, so you should make sure you have good data plan, or you will be charged extra!","torrent":{"xt":"urn:btih:c5781199b8fe24b122d870b3ddfb4de478854748","amp;dn":"WMWifiRouter_v0.91","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5781199b8fe24b122d870b3ddfb4de478854748","infoHashBuffer":{"type":"Buffer","data":[197,120,17,153,184,254,36,177,34,216,112,179,221,251,77,228,120,133,71,72]},"announce":[],"urlList":[]}}