{"title":"Islam - Empire of Faith  [2000]","uid":3355647,"size":751052618,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c60b9cffae9efb9098213ad47531ab8b681f116d&amp;dn=Islam+-+Empire+of+Faith++%5B2000%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"reichert","files":4,"time":1121252029,"description":"Islam - Empire of Faith [2000]\n\nBetween the fall of Rome and the European voyages of discovery, few events were more significant than the rise of Islam. Within a few centuries, the Islamic empires blossomed, projecting their power from Africa to the East Indies, and from Spain to India. Inspired by the words of the Prophet Muhammed, and led by caliphs and sultans, this political and religious expansion remains unequaled in speed, geographic size and endurance. \n\nIslam - Empire of Faith is narrated by the actor Ben Kingsley (http://us.imdb.com/name/nm0001426/). \n\n*coincidently &quot;Sir Ben Kingsley&quot; is also the actor in Steven Spielberg's &quot;Schindler's List&quot; (1993) (http://us.imdb.com/title/tt0108052/) playing Itzhak Stern, one of the lead actor. May be this give you to think about if Jewish make a film about the Islam - Empire of Faith....\n\nThe three-hour program tells the spectacular story of the great sweep of Islamic power and faith during its first 1,000 years from the birth of the Prophet Muhammed to the peak of the Ottoman Empire under the reign of Suleyman the Magnificent. Historical re-enactments and a remarkable exposition of Islamic art, artifacts and architecture are combined with interviews of scholars from around the world to recount the rise and importance of early Islamic civilization. Increasingly, scholars and historians are recognizing the profound impact that Islamic civilization has had on Western culture and the course of world history.","torrent":{"xt":"urn:btih:c60b9cffae9efb9098213ad47531ab8b681f116d","amp;dn":"Islam+-+Empire+of+Faith++%5B2000%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c60b9cffae9efb9098213ad47531ab8b681f116d","infoHashBuffer":{"type":"Buffer","data":[198,11,156,255,174,158,251,144,152,33,58,212,117,49,171,139,104,31,17,109]},"announce":[],"urlList":[]}}