{"title":"[Kung Fu] Wong Fei Hung Tsi Sam, Siwong Tsangba (1993)  - DVD/Rm","uid":3776170,"size":509651701,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c616a255c33d0fe6885ddc21c382b2329d146229&amp;dn=%5BKung+Fu%5D+Wong+Fei+Hung+Tsi+Sam%2C+Siwong+Tsangba+%281993%29++-+DVD%2FRm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":7,"time":1187371015,"description":"Wong Fei Hung Tsi Sam: Siwong Tsangba aka Once Upon A Time In China 3 (1993)\n\nAvg. Rating:  \t\n  4.2 / 5 (based on 5 ratings).\n\nPlot:\tJet Li returns as Wong Fei Hung for the third installment in the OUATIC series.\n\nOverview:\tJet Li returns as Wong Fei Hung for the third installment in the OUATIC series. The Dowager Empress of China has decided to hold a lion-dance contest to stir things up between the various western powers. However, it stirs things up among the various indigenous martial arts schools even more. Wong Fei Hung comes to Beijing to visit his dad, only to find he has been assaulted by the villanous Chiu, the head of a rival school, who is determined to win the contest through intimidation and thuggery. Wong also meets up with his fiancee Aunt Yee (Rosamund Kwan), who has in turn met up with Tomansky, a Russian friend from her school days who is now part of the envoy to China. Tomansky gives her a movie camera, which sends Wong into fits of jealousy. However, the camera later accidentally captures footage showing evidence of the Russain as part of a plot to assassinate President Li, the empresses&amp;#039; right-hand man. It&amp;#039;s up to Wong to enter the lion-dance competition, defeat Chiu and his gang, and prevent the assassination.\n\nCast: \tJet Li Lian-Jie  ||  Max Mok Siu-Chung  ||  Rosamund Kwan Chi-Lam  ||  Lau Shun  ||  Mo Shao Min  ||  Xiong Xin-Xin (Hung Yan-Yan) \n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:c616a255c33d0fe6885ddc21c382b2329d146229","amp;dn":"%5BKung+Fu%5D+Wong+Fei+Hung+Tsi+Sam%2C+Siwong+Tsangba+%281993%29++-+DVD%2FRm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c616a255c33d0fe6885ddc21c382b2329d146229","infoHashBuffer":{"type":"Buffer","data":[198,22,162,85,195,61,15,230,136,93,220,33,195,130,178,50,157,20,98,41]},"announce":[],"urlList":[]}}