{"title":"Dj Feel Live at Revolution Club (Feel the Trance) MegaPack #1","uid":3995503,"size":2602606006,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6512111b5a09eb4e1ca964f5950030364ab5d0b&amp;dn=Dj+Feel+Live+at+Revolution+Club+%28Feel+the+Trance%29+MegaPack+%231&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ratibord","files":38,"time":1201292429,"description":"Genre: Trance\nRls Date: 2006\nMP3\nQuality: 192 kbps\nTime: 32:02:12\n\nTrackList :\n\nPart 1\n01. Above &amp; Beyond - Hope (Album) Anjunabeats\n02. Leonid Rudenko - Summerfish (Original Vocal Mix) CD-R\n03. Depeche Mode - Martyr (Paul van Dyk Lounge Vonyc Mix) Mute\n04. Mark Norman pres. Celine - Colour My Eyes (Global Experience Remix) Black-Hole\n05. Headstrong feat. Tiff Lacey - The Truth (David West Remix) Sola\n06. Andy Moor vs. Orkidea - Year Zero (Andy Moor First Light Mix) Ave\n07. Above &amp; Beyond - Stealing Time (Album) Anjunabeats\n08. Aurosonic - Missing You (Original Mix) CD-R\n09. Andrew Bennett feat. Rico Soarez - Light Of Hope (Original Mix)\n10. Jerry Ropero - The Strom (Original Mix) Kingdome Kome Cutz\n11. Black pearl - Bounty Island (DJ Shah Remix) ASOT\n\nPart 2\n01. Fragma - Radio Waves (Original Mix)\n02. Armin van Buuren feat. Gabriel &amp; Dresden - Zocalo (Original Mix) Armind\n03. Cara Dillon vs. 2 Devine - Black Is The Colour (2 Devine Mix) Anjunabeats\n04. Paul van Dyk feat. Wayne Jackson - The Other Side (Deep Dish Remix) Vandit\n05. Far &amp; Away - Solstice (Original Mix) Innov8\n06. Karen Overton - Your Loving Arms (Club Mix) Supra\n07. DJ Shah feat. Laruso - Tenessee (Original Mix) Black-Hole\n08. DJ Tatana feat. Sarah Veith - Silence (Original Mix) White\n09. Emphased Reality - Realsphere (Original Mix) Innov8\n10. Andain - Beautiful Things (Gabriel &amp; Dresden Remix) Black-Hole\n\nPart 3\n01. Aalto - 5 (Original Mix) Anjunabeats\n02. Darude - Sandtorm (Kamyter Remix) Insolent\n03. Feel &amp; Igor T vs. Above &amp; Beyond - Cant Sleep This Summer (In Progress Vocal Masup) CD-R\n04. Mike Foyle - Shipwrecked (John O Callaghan Remix) Armind\n05. Armin van buuren - Control Freak (Sander van Doorn Remix) Armind\n06. Marco V - Any Better Or ... (Original Mix) In Charge\n07. Ron van Den Beuken - Timeless (Ron van Den Beuken Remix) Spinnin\n08. Carl B feat. Breaking Benjamin - Diary Of Jane (Sean Tyas Rework) White\n09. Paul van Dyk feat. Hemstock &amp; Jennings - Nothing But You (PvD Club Mix) Vandit\n10. Feel vs. Late Night Alumni - Empty Streets (Feel Remix) CD-R\n11. Nic Chagal - Monday Bar (Original Mix) High Contrast\n\nPart 4\n01. Giuseppe Ottavianni - Throught Your Eyes (Thomas Bronzaer Remix) Vandit\n02. Beam - On Your Mind (Sean Tyas Remix) Beam Traxx\n03. BT - Somnambulist (Mark Norman Remix) Black-Hole\n04. Filterfunk - SOS (Sander van Doorn Remix) Spinnin\n05. Tiesto - Pirates Of The Carribian (Orchestral Mix) CD-R\n06. Dallas Superstars - Fine Day (Original Mix) 16 inch\n07. Paul van Dyk feat. Vega 4 - Time Of Our Lives (PvD Club Mix) Vandit\n08. Ferry Corsten feat. Guru - Junk (Flashover Mix) Flashover\n09. Ronski Speed - The Space We Are (John O Callaghan Remix) Euphonic\n10. Alex MORPH feat. Rank 1 - Life Less Ordinary (Original Mix) Ministry of Sound\n\nPart 5\n01. Lange feat. G Emery - Another You Another Me (Original Mix) Vandit\n02. Cedric Gervais - Spirit In My Life (Second Sun Remix) White\n03. Above &amp; Beyond - Alone Tonight (Original Mix) Anjunabeats\n04. Armin van Buuren - Communication Part 3 Armind\n05. System F - Out Of The Blue (Original Mix) Tsunami\n06. Veracocha - Carte Blanche (Kenny Hayes Remix) Positiva\n07. Airscape - Sosei (F&amp;W Remix) ID&amp;T\n08. Mr Sam feat. Kirsty Hawkshaw - Split (Aly &amp; Fila Remix) Black-Hole\n09. Tim Hornsby - Protect You (Original Mix) ASOT\n10. Supermode - Tell Me Why (Bobina Remix) Ministry of Sound\n11. Above &amp; Beyond - Far From In Love (Original Mix) Anjunabeats\n\nPart 6\n01. Paul van Dyk - Another Way (PvD Mix Session 2) Vandit\n02. Gabriel &amp; Dresden - Trackin Treasure Down (Original Mix) Organized Nature\n03. DJ Shog feat. Aven - Surrounded By Your Love - White\n04. Alex MORPH &amp; Woody van Eyden - Heavenly (Extended Mix) Fenology\n05. Armin van Buuren feat Racoon - Love You More (Original Mix) Armind\n06. Perasma - Swing 2 Harmony (Deserves An Effort Vocal Remix)\n07. Above &amp; Beyond - Air For Life (Original Mix) Anjunabeats\n08. Armin van Buuren - Serenity (12 mix) Armind\n09. Carrie Skipper - Time Goes By (Super 8 Remix) Anjunabeats\n10. Vadim Zhukov - Goodbye - CD-R","torrent":{"xt":"urn:btih:c6512111b5a09eb4e1ca964f5950030364ab5d0b","amp;dn":"Dj+Feel+Live+at+Revolution+Club+%28Feel+the+Trance%29+MegaPack+%231","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6512111b5a09eb4e1ca964f5950030364ab5d0b","infoHashBuffer":{"type":"Buffer","data":[198,81,33,17,181,160,158,180,225,202,150,79,89,80,3,3,100,171,93,11]},"announce":[],"urlList":[]}}