{"title":"Paycheck.avi","uid":3889727,"size":735492096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c749ec6b98ec493ffc77744d7faf316b7e393605&amp;dn=Paycheck.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Surge87","files":1,"time":1194992374,"description":"Michael Jennings is a reverse engineer and what he does is technical jobs for certain companies and as soon as he is done, his memory of the work he has done is wiped out. Now the longest he has been contracted is 2 months. But now billionaire, James Rethrick offers him a job that would last 2 years, maybe 3, and he promises that he will probably earn 8 figures. Michael agrees. Before beginning he turns in all of his personal effects. And when the job is done, his memory is erased and he learns he made over 90 million dollars over the three years. When he goes to claim it and his personal effects, he discovers that prior to the erasure of his memory he waived his rights to the money he earned and that the items that were given to him were not the ones he gave when he began. Later he is arrested by the FBI who say that he committed some act of treason and murder. It&amp;#039;s while he is in custody that he escapes using some the items that he was given. He later meets with a friend who gives him some information that helps him understand what is going on. And at the same time Rethrick for some reason wants him so he is being pursued by Rethrick&amp;#039;s people.","torrent":{"xt":"urn:btih:c749ec6b98ec493ffc77744d7faf316b7e393605","amp;dn":"Paycheck.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c749ec6b98ec493ffc77744d7faf316b7e393605","infoHashBuffer":{"type":"Buffer","data":[199,73,236,107,152,236,73,63,252,119,116,77,127,175,49,107,126,57,54,5]},"announce":[],"urlList":[]}}