{"title":"Coast to Coast Radio Program! Commercial Free! Feb 1st thru Feb ","uid":4019711,"size":439988695,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c7b63c225c5b2adf3f887bd803068c4f6baff462&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+1st+thru+Feb+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":40,"time":1202602207,"description":"Here we are again, another eight broadcasts of the greatest late night radio program ever, Coast to Coast! I hope you all enjoy and spread the knowledge. Seed and inform others. Thanks in advance to all the seeders. Until next week my friends. Stokeman Out......\n\nFriday February 1st, 2008\nNight of Open Lines\nFilling in for George, Ian Punnett hosted an evening of Open Lines. Jeremy in Santa Rosa, California shared his theory about &amp;#039;the antichrist&amp;#039; possibly being aliens. Darrell from Indiana talked about the housing bubble and foreclosures. Darrell said he...\nHost: Ian Punnett\nGuest(s): Open Lines\n\nSaturday February 2nd, 2008\nProgrammed Reality\nElectrical engineer and scientific truth seeker Jim Elvidge discussed evidence that shows we could be living in a programmed reality, in which &quot;everything [we] perceive is under program control or is generated by some computational mechanism.&quot;\nHost: Ian Punnett\nGuest(s): Jim Elvidge, Gregg McBride\n\nSunday February 3rd, 2008\nAncient Astronaut Theory\nThe publisher of Legendary Times, Giorgio Tsoukalos spoke about evidence for the Ancient Astronaut theory. Working with such notables as Erich Von Daniken, he has conducted scientific investigations at a variety of ancient sites. There are a number...\nHost: George Noory\nGuest(s): Giorgio Tsoukalos, Mary Ann Winkowksi\n\nMonday February 4th, 2008\nPsi Research\nProf. Robert M. Schoch discussed his latest work studying parapsychology and the paranormal. He looked at credible psychical research from the late 1800&amp;#039;s through the 1930s, as well as more modern studies, and came to the conclusion there is solid evidence... \nHost: George Noory\nGuest(s): Robert M. Schoch, Lisa Williams\n\nTuesday February 5th, 2008\nWeather Modification\nAuthor and lecturer Jerry E. Smith discussed his investigation into weather modification, touching on such topics as HAARP, contrails, chemtrails, and global warming. There is a long history of weather modification-- attempts to induce artificial... \nHost: George Noory\nGuest(s): Jerry E. Smith, Oliver von Kemenczky, Ted Davis, Jerome Corsi\n\nWednesday February 6th, 2008\nNew Technolgy &amp; Geopolitics\nAppearing during the first three hours, &amp;#039;Historian of the future&amp;#039; Charles Ostman discussed coming technologies and how they affect geopolitics. An important growth area will be zero gravity environments in space, which can be used to manufacture materials...\nHost: George Noory\nGuest(s): Charles Ostman\n\nThursday February 7th, 2008\nDowsing &amp; Remote Viewing for Gain\nRemote viewing and dowsing expert Paul Smith discussed ESP techniques, and how people can use them to tap into future outcomes for financial gain. With remote viewing, you know where a target is, but you don&amp;#039;t what it is-- dowsing is the reverse, where... \nHost: George Noory\nGuest(s): Paul H. Smith, Terry Jamison, Linda Jamison\n\nFriday February 8th, 2008\nMoments of Evil &amp; More\nDuring Open Lines George offered a special hotline for callers who wanted to share what drove them to a moment of evil. Steven in Wisconsin believes he may have been possessed by demons during a period in his life when he was obsessed with mutilating... \nHost: George Noory\nGuest(s): Open Lines, Cassandra Peterson","torrent":{"xt":"urn:btih:c7b63c225c5b2adf3f887bd803068c4f6baff462","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+1st+thru+Feb+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7b63c225c5b2adf3f887bd803068c4f6baff462","infoHashBuffer":{"type":"Buffer","data":[199,182,60,34,92,91,42,223,63,136,123,216,3,6,140,79,107,175,244,98]},"announce":[],"urlList":[]}}