{"title":"Led Zeppelin - Mothership - Lossless (FLAC)","uid":3901995,"size":976253491,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c804f97615c0e4c88cd86709978e1cd7e7feaf8a&amp;dn=Led+Zeppelin+-+Mothership+-+Lossless+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jxn22","files":24,"time":1195613290,"description":"The new remaster deserves a listen in full, lossless quality.\n\nLineage:\nMothership CD -&gt; AIFF -&gt; FLAC 6 (using xACT)\n\nRipped and Uploaded by jxn22\n\nReview from allmusic:\n\nLed Zeppelin&amp;#039;s reunion for an Ahmet Ertegun tribute concert in November 2007 (pushed back a couple of weeks due to a finger injury Jimmy Page sustained during rehearsals) seemed like a spur of the moment thing -- but how spontaneous could it have been if it just happened to coincide with the release of an expanded The Song Remains the Same on both CD and DVD, the debut of their catalog as digital downloads, and the new two-disc compilation Mothership as a sampler of the whole shebang? Considering this full-scale, multi-prong assault -- which also included a new album by Robert Plant, after all -- it was probably not all that spontaneous. Such a precise attack suits this most mythic of classic rock groups, who always benefited from an enormous sense of scale. Weighing in at two discs and 24 tracks, Mothership has a sense of scale that the previous round of compilations -- the two-part Early Days &amp; Latter Days, delivered in 1999 and 2000 respectively -- lacked, not just because it pushes these two phases together but because it is heavy on the heavy epics, emphasizing Zeppelin&amp;#039;s sheer sonic ballast over either their lighter or more idiosyncratic moments. This effects the second disc more than the first, as the band started out heavy and expanded outward, and while it would have been nice if &quot;Fool in the Rain&quot; represented In Through the Out Door instead of &quot;In the Evening,&quot; this is a minor quibble as Mothership hits the obvious high points without seeming perfunctory. And that, along with Page&amp;#039;s new remastering, is the real selling point behind Mothership: as a compilation it is both gripping listening and a good introduction to this very album-oriented band, which is what makes it a welcome addition to their catalog.\n\n\n-----\n\nDOOF\n&lt;---","torrent":{"xt":"urn:btih:c804f97615c0e4c88cd86709978e1cd7e7feaf8a","amp;dn":"Led+Zeppelin+-+Mothership+-+Lossless+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c804f97615c0e4c88cd86709978e1cd7e7feaf8a","infoHashBuffer":{"type":"Buffer","data":[200,4,249,118,21,192,228,200,140,216,103,9,151,142,28,215,231,254,175,138]},"announce":[],"urlList":[]}}