{"title":"Canned Heat - Friends in the Can","uid":3351947,"size":90873425,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c88327360e36d770246b8a859f794005b7ef1800&amp;dn=Canned+Heat+-+Friends+in+the+Can&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BOMM2","files":20,"time":1120442533,"description":"Canned Heat - Friends in the Can\n\nRUF 1066CD\n(p) 2003\n\n29. april 2005\n\n01. Same Old Games [2:55]\n02. Bad Trouble [4:48]\n03. Black Coffee [4:17]\n04. Getaway [4:44]\n05. It don't matter [4:25]\n06. Let's Work Together [2:50]\n07. 1,2,3 Here We Go Again [6:17]\n08. That Fat Cat [4:15]\n09. Home To You [5:26]\n10. Never Get Out Of These Blues Alive [6:42]\n11. Little Wheel [3:47]\n12. Silence [1:03]\n13. Let's Work Together (Bonus) [2:47]\n14. Getaway (Bonus) [3:57]\n\n\nAt the end of 1999, this musical unit was formed to continue the Canned Heat legacy. It is generally thought that it usually takes at least two to three years for a band to reach their first musical peak. Now having played together for three years throughout the world, the camaraderie and musical growth has brought this band to a level worthy of recording.\n\nThis record also brings together a number of Canned Heat's musical friends from the past and present to join them in the creation of their first record of the 21st century. This musical collaboration celebrates 36 years of Canned Heat music and also pays tribute to the band's major, musical influence... --- John Lee Hooker. ST\n\nCanned Heat met John Lee Hooker in an airport in 1969. Soon after, Skip Taylor arranged to have John Lee and the Heat record their now classic album, &quot;Hooker 'n Heat&quot;. After touring together, including their renowned performance at Carnegie Hall in New York, they reunited for two more albums. In 1981, they recorded an album again entitled &quot;Hooker 'n Heat&quot; in Venice, California and in 1989, Fito de la Parra, Larry Taylor and Henry Vestine played on John Lee's million seller, &quot;The Healer&quot;. &quot;Little Wheel&quot;, the track heard here, is from those sessions: that was the last time Canned Heat and John Lee would record together. John Lee and Fito stayed in touch through the years developing a close friendship. Every once in a while, John Lee would call to ask Fito to play drums with him and his Coast to Coast Blues Band. As the blues gods would have it, the last four gigs Fito played with John Lee in 2001, were John Lee's last performances. The &quot;King of the Boogie&quot; is gone, but his main disciples continue his legacy.\n\nTaj Mahal first connected with Canned Heat in the late 60's by filling in for Bob &quot;The Bear&quot; Hite whenever Bob was ill. Taj first became aware of John Lee Hooker when he heard &quot;Boogie Chillin&quot; as a teenager in Massachusetts. Taj says his favorite John Lee song is &quot;Big Legs, Tight Skirt&quot;! Over the years, Taj and John Lee became good friends. The song, &quot;Never Get Out of These Blues Alive&quot; written by John Lee, brings Taj, Canned Heat and Hooker all together for some musical magic.\n\n------------------------------------------------------------\n\nEAC extraction logfile from 29. April 2005, 10:34 for CD\nCanned Heat / Friends in the Can\n\nUsed drive  : PLEXTOR DVDR   PX-712A   Adapter: 1  ID: 0\n\nUsed output format : (LAME MP3 Encoder) 192 kBit/s\n","torrent":{"xt":"urn:btih:c88327360e36d770246b8a859f794005b7ef1800","amp;dn":"Canned+Heat+-+Friends+in+the+Can","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c88327360e36d770246b8a859f794005b7ef1800","infoHashBuffer":{"type":"Buffer","data":[200,131,39,54,14,54,215,112,36,107,138,133,159,121,64,5,183,239,24,0]},"announce":[],"urlList":[]}}