{"title":"THE_PIANO_TEACHER_DVDRIP_FRENCH_SUBENG_LGLuX.mp4","uid":4010609,"size":737348801,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8d74c9530809f03656a263d92efc9f6758f7411&amp;dn=THE_PIANO_TEACHER_DVDRIP_FRENCH_SUBENG_LGLuX.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LGLuX","files":1,"time":1202063831,"description":"Movie:    The Piano Teacher (La Pianiste)\nDirector: Michael Haneke\nIMDB:    &lt;a href=&quot; http://german.imdb.com/title/tt0254686/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://german.imdb.com/title/tt0254686/&lt;/a&gt;\nCodec:    H.264\nLanguage: French\nSub:      English (Hard Subs)\nChapters: Yes\n\n\n\n\n********Ok People , i was looking all over for this DVD in a synchronised version but then i got told the movie had never been synchronised , so all i got was a canadian DVD with Hard english subs , they are on the file now but well like i said they are Hard (Sorry to all of you who speak french)****************************************\n\n\nIn the first twenty minutes we are swept away by several powerfully portrayed emotions: a suffocating and overbearing mother has a violent argument with her live-in 40yr old daughter; a piano teacher (and professor of music)&amp;#039;s love for her pupils expressed in unswerving critical appraisal; the joy that music can inspire both in the listener and the performer. Within this short space of time our senses have been assaulted convincingly with very real characters. We are also swept away by powerfully performed music and shown the difference between great and mediocre performance with a lot of attention to nuance. Such material alone would have been the basis for an outstanding film of widespread appeal. But the trend in French cinema being what it is, it goes deeper, exploring the repressed sexuality of the teacher, the expression of sexual freedom and subsequent breakdown within a context of passionate attraction, and the inevitable cycle of real abuse. We are drawn to her suffering and, at least initially, wonder how much suffering may be related to the accomplishment of genius, particularly in the composers she admires. The Piano Teacher contains graphic dialogue and depictions of sex and brutality in scenes that some people might rather not watch. The scenes are essential to the dilemmas which the film seeks to raise and so can hardly be called gratuitous. A great film it may be, but mainstream viewing it is not.\n\n\nEnjoy\n\nLGLuX","torrent":{"xt":"urn:btih:c8d74c9530809f03656a263d92efc9f6758f7411","amp;dn":"THE_PIANO_TEACHER_DVDRIP_FRENCH_SUBENG_LGLuX.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8d74c9530809f03656a263d92efc9f6758f7411","infoHashBuffer":{"type":"Buffer","data":[200,215,76,149,48,128,159,3,101,106,38,61,146,239,201,246,117,143,116,17]},"announce":[],"urlList":[]}}