{"title":"Poltergeist 1 2 3 Dutch subs","uid":4005121,"size":4674279099,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c9348985a40997f9e744f4686e6f4c6ee253898d&amp;dn=Poltergeist+1+2+3+Dutch+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ahotrod","files":18,"time":1201791350,"description":"POLTERGEIST DEEL 1 2 + 3            \n\n\n\n\n\n-------------------------------------------------\n\nOmschrijving\n\nDEEL 1\n\nVerenigde Staten\nHorror / Thriller\n114 minuten\n\ngeregisseerd door Tobe Hooper\nmet Craig T. Nelson, JoBeth Williams en Heather O'Rourke\n\nHet rustige leven van de familie Feeling wordt verstoord door geesten.\n Op het eerste gezicht lijken de geesten vriendelijk te zijn:\n ze verplaatsen objecten als amusement voor het gezin.\nMaar dan worden ze gemeen en beginnen ze het gezin te terroriseren.\nZe gaan zelfs zover dat ze hun dochter kidnappen.\nHaar vader roept de hulp in van klopgeest specialisten.\n\nDEEL 2  The Other Side\n\nVerenigde Staten\nHorror / Thriller\n87 minuten\n\ngeregisseerd door Brian Gibson\nmet JoBeth Williams, Craig T. Nelson en Heather O'Rourke\n\nHet huis van de familie Freeling is verdwenen door de gebeurtenissen rond een klopgeest,\n maar de verzekering wil niet betalen.\nDaarom wonen ze nu bij haar moeder, maar de geesten zijn op zoek naar de familie.\nOmdat de geesten via de TV naar binnen kwamen, komt er nu geen TV meer in huis.\nMaar ze hebben het nog steeds op de dochter gemunt.\nWat wil 'de andere kant' (het dodenrijk) van haar ?\n\nDEEL 3\n\nVerenigde Staten\nHorror / Thriller\n98 minuten\n\ngeregisseerd door Gary Sherman\nmet Tom Skerritt, Nancy Allen en Heather O'Rourke\n\nCarol Anne lijdt zwaar onder de problemen die zij heeft gehad met de geestenwereld.\nZe trekt nu in bij haar oom en tante en gaat naar een speciale school.\nDe psychiater van de school denkt dat ze aan massa-hypnose doet.\nEr zit echter nog steeds een geest achter haar aan en dit keer moeten de spiegels het  ontgelden.\n Gelukkig staat ze nog steeds in contact met het medium Tangina.\n\n-----------------------------------------------------------------------------------------\nPART 1\n\nThe film centers on the Freeling family, a typical middle class family living in the peaceful\n Cuesta Verde Estates. The father, Steve , has fallen asleep in front of the television, and the dog saunters around the house\nrevealing the other family members ? Steve's wife Diane ,\n sixteen-year-old daughter Dana , eight-year-old son Robbie ,\n and five-year-old Carol Ann . Soon strange things begin to happen around\n the house; the pet canary dies, mysterious storms occur, and Carol Ann is summoned to the TV set,\n where a strange shaft of green light hits her and causes the room to shake\n (&quot;They're he-e-ere!&quot;). As curious events continue, Carol Ann is repeatedly drawn to the television,\n where she begins to talk to &quot;the TV people.&quot; Soon Carol Ann is sucked into a closet, disappearing\n from this reality plane. Unable to find his daughter, Steve consults Dr. Lesh ,\n a para-psychologist from a nearby college. Lesh finds that paranormal phenomena is so strong in\n the Freelong household she is unable to deal with it and sends for clairvoyant and professional exorcist\n Tangina (Zelda Rubinstein) to examine the house in hopes of finding Carol Ann. Tangina makes a horrifying\n discovery: Carol Ann is alive and in the house, but is being held on another spectral plane.\n\nPART 2\n\nOne of the more effectively spooky and financially successful horror films of the '80s got an inevitable sequel\n with this effects-heavy installment. The Freeling family is trying to grapple with the devastation wrought\n by the ghosts and ghouls that destroyed their lives. The insurance company doesn't believe their story about\n what happened to their house, so Steve , Diane and their kids, Carol Anne and Robbie , have been reduced to\n living in the home of Diane's mother, Jess .\n Unfortunately for the Freelings, however, their new residence, just like their last, is situated on a haunted\n patch of unholy ground. A century before, the mad cult leader Kane (Julian Beck) slaughtered his followers nearby,\n and his evil spirit has returned in an effort to kidnap Carol Anne. When the Freelings realize what's happening,\n they call upon the psychic medium Tangina Barrons (Zelda Rubinstein) to help them again, and they also receive\n aid from a kindly Native American spiritualist, Taylor\n\nPART 3\n\nEvil spirits follow a young girl from the suburbs to the city in the second follow-up to the blockbuster horror\n film Poltergeist.\nCarol Anne Freeling is now 12 years old and living with Patricia and Bruce Gardner,\n her aunt and uncle, in a high-rise apartment building in downtown Chicago. Carol Anne attends a school for gifted\n children, where the staff psychologist Dr. Seaton (Richard Fine) attributes her past troubles with noisy ghosts\n to mass delusions and hypnotic suggestions. However, Carol Anne isn't so sure that the explanation is that simple,\n especially since she still sees threatening apparitions in the mirrors of her apartment.\nParticularly troubling is the ghost of the wicked Reverend Kane , who is eager for Carol Anne to join him and his\n followers in the unknown world on the other side of the light.\n\nEnjoy this 3 great movies\n\n-----------------------------------------------------------------------------------------\n\n\n[b]INFO[/b]\n\nTITEL........&gt;==&gt;.POLTERGEIST DEEL 1,2,3\nFORMAAT......&gt;==&gt;.DVD\nMENU ........&gt;==&gt;.YES SELF MADE\nEXTRAS.......&gt;==&gt;.NO\nSOUND........&gt;==&gt;.AC3 2.1 (STEREO)\nLANGUAGE.....&gt;==&gt;.ENGLISH\nSUBTITEL.....&gt;==&gt;.DUTCH SELECTABLE\nTIME.........&gt;==&gt;.288 MIN\nASPECT RATIO &gt;==&gt;.16:9\nCOVER........&gt;==&gt;.YES\nIMDB.........&gt;==&gt;.[1] tt0084516 [2] tt0091778 [3] tt0095889 ]\n \n\n-------------------------------------------------\nVideo Attribute :\n  Video compression mode : MPEG-2\n  TV system : 625/50 (PAL)\n  Aspect Ratio : 16:9\n  Display Mode : Only Letterbox\n  Source picture resolution : 352x576\n  Frame Rate : 25.00\n  Source picture letterboxed : Not letterboxed\n  Bitrate : 7.77Mbps\n\nAudio Attribute : \n  Audio Coding mode : Dolby Digital\n  Sampling Rate : 48kHz\n  Audio application mode : Surround\n  Number of Audio channels : 2\n  Bitrate : 192 Kbps\n  Number of Audio streams : 1\n\n","torrent":{"xt":"urn:btih:c9348985a40997f9e744f4686e6f4c6ee253898d","amp;dn":"Poltergeist+1+2+3+Dutch+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9348985a40997f9e744f4686e6f4c6ee253898d","infoHashBuffer":{"type":"Buffer","data":[201,52,137,133,164,9,151,249,231,68,244,104,110,111,76,110,226,83,137,141]},"announce":[],"urlList":[]}}