{"title":"[Kung Fu] Flash Point (Donnie Yen, 2007) CN - DVD/Rmvb","uid":3776190,"size":382139573,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c98dea84b1fc3aaca844f1f6a2d8f402af746e6d&amp;dn=%5BKung+Fu%5D+Flash+Point+%28Donnie+Yen%2C+2007%29+CN+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1187371669,"description":"Flash Point (Donnie Yen, 2007)\n\nIn Flash Point, Donnie Yen is the man - and don&amp;#039;t you forget it. The action star is at his most powerful and preening in Flash Point, the third collaboration between Yen and director Wilson Yip. Unlike their previous films, SPL and Dragon Tiger Gate, Flash Point is a stripped-down action film, losing any extra flab (e.g., intricate storytelling or character history) for what amounts to an eighty-seven minute freight train of Donnie Yen goodness, starting with muscular posing and ending with an extended finale designed for Yen to apply maximum damage to his foes and his environment. Meanwhile, there&amp;#039;s no attempt to wow us with complex emotions or narrative dexterity - basically, this movie is a straight gunshot to the heart, and does nothing fancy to subtract from its simplistic aims. The result could probably not be called a good film, but for its intended audience, Flash Point is like a dose of crack. If you&amp;#039;re an action addict, then this movie will satiate your needs. And at least it&amp;#039;s not pretentious.\n\nJuly 2007\n\n-- Flash Point: Donnie Yen Defines the Art of Practical Combat Onscreen --\n\nI heard that the concept of mixed martial arts is implemented in the upcoming summer movie Flash Point.\nDonnie Yen: Mixed martial arts, a combat sport that has become popular in the West in the recent years, is an effective fighting system that employs a vast array of different martial arts techniques. Each contestant possesses a variety of martial arts techniques such as Jujitsu, boxing, Muay Thai, wrestling, etc. I believe this is the most authentic type of combat. I have been researching, studying and learning it. I introduced some of it in SPL - Brazilian Ju-jitsu.  &lt;a href=&quot;\nhttp://www.wu-jing.org/News/M04/2007-07-Donnie-Yen-on-Flash-Point-Pratical-Combat.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wu-jing.org/News/M04/2007-07-Donnie-Yen-on-Flash-Point-Pratical-Combat.php&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:c98dea84b1fc3aaca844f1f6a2d8f402af746e6d","amp;dn":"%5BKung+Fu%5D+Flash+Point+%28Donnie+Yen%2C+2007%29+CN+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c98dea84b1fc3aaca844f1f6a2d8f402af746e6d","infoHashBuffer":{"type":"Buffer","data":[201,141,234,132,177,252,58,172,168,68,241,246,162,216,244,2,175,116,110,109]},"announce":[],"urlList":[]}}