{"title":"Love Outside Andromeda","uid":4020194,"size":154289701,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9cdc7fabda19600776fb5e5394941feeb382940&amp;dn=Love+Outside+Andromeda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"OzzyBilby","files":34,"time":1202631493,"description":"NAME: Love Outside Andromeda\nGENRES: Rock / Alternative / Indie\nBITRATE:  VBR - 164-320\nINCLUDES: Longing Was a Safe Place To Hide [Album], Self Titled [Album], Something White and Sigmund [EP]\nSIZE: 147 MB\n\nURLS:\nhttp://www.loveoutsideandromeda.com/\n\nDESCRIPTION:\n\nLove Outside Andromeda is a rock band from Melbourne, Australia.\n\n\nLove Outside Andromeda formed in 2000 as &quot;Andromeda&quot;, the brainchild of Sianna Lee - an ambitious bedroom guitarist with a knack for confessional-style song writing. With her high school friend/guitar whiz Jamie Slocombe, and her bass- playing brother Jesse Lee, the band played its first gig with drumming duties provided by Sianna and Jesse&amp;#039;s father. As fate would have it, drummer-to-be Joe Hammond was in the audience.\n\nSince then, the band has stirred audiences with its brand of lushly arranged guitar- based rock. Its members bring varied musical strands to the band, each searching for &amp;#039;the sound&amp;#039; for Sianna &amp;#039;s acoustic- spun ideas. Her full yet articulate acoustic sound morphs into the siren-like maelstrom that is Love Outside Andromeda. Classic rock, metal and folk musics are taken apart as they contextualise Sianna&amp;#039;s varied lyrical concerns - from whispered confessional to vitriolic denunciation. There is also a strong emphasis upon uncommon time signatures; 6/8, 7/4 and 2+3+3/8 meters have both added a fragility to slower and mellower orchestrations, and a preference towards 5/4 and 3+3+2+2/8 meters gives their faster or heavier songs a unique quality among their peers.\n\nTheir independently released debut EP Umabel (2001) received national and local radio support, and led to live- to- air performances for Triple J, Triple R and Fly TV. Their second EP Something White &amp; Sigmund was featured as part of Triple J&amp;#039;s &amp;#039;Next Wave&amp;#039; project and enjoyed extensive rotation in 2003, including a prized place in Triple J&amp;#039;s Hottest 100 at #65, as well as airplay on UK radio BBC 6, and U.S. college radio. The latter part of 2003 saw the band on the road for its first national tour.\n\n2004 comprised a name change to Love Outside Andromeda (to avoid confusion with their Swedish prog- metal namesakes), and the completion of the band&amp;#039;s first full-length album at the hands of tone- producer extraordinaire Shane O&amp;#039;Mara. The self-titled album features radio faves Something White and Sigmund, Boxcutter Baby, Gonna Try to be a Girl, Tongue Like A Tether and Made of Broken Glass.\n\nIn late 2005, Bound by Hurt Dissolved first surfaced on Triple J, the first single from their forthcoming second album. The album, Longing Was A Safe Place to Hide, was initially due for release in early 2006, but suffered from numerous delays. The single Measuring Tape was released exclusively on iTunes in July 2006, and the album eventually hit shelves in September.","torrent":{"xt":"urn:btih:c9cdc7fabda19600776fb5e5394941feeb382940","amp;dn":"Love+Outside+Andromeda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9cdc7fabda19600776fb5e5394941feeb382940","infoHashBuffer":{"type":"Buffer","data":[201,205,199,250,189,161,150,0,119,111,181,229,57,73,65,254,235,56,41,64]},"announce":[],"urlList":[]}}