{"title":"VA-In_Search_Of_Sunrise_6_Ibiza__Mixed_By_Tiesto-2CD-2007-TGX_ww","uid":3779726,"size":240618372,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca52539ff2a250a2d6c4f2c6d8406f74722ecd3b&amp;dn=VA-In_Search_Of_Sunrise_6_Ibiza__Mixed_By_Tiesto-2CD-2007-TGX_ww&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"misiek2007","files":9,"time":1187664638,"description":"Artist ............ : VA\nTitle ............. : In Search Of Sunrise 6 Ibiza (Mixed by Tiesto)\n\nGenre ............. : Trance\nLabel ............. : Black Hole Recordings\nCatalog Number .... : Songbird CD 10\n\nSource ............ : CD\nQuality ........... : 206kbps avg / 44.1KHz / Joint Stereo\nPlaytime .......... : 02:34:50  (229.MB)\nRelease Date ...... : 2007-08-21\n\n\n[Track List]\n\nDisc 1/2\n--------\n1. Es Vedra - La Hacienda                                              2:27\n2. Glenn Morrison - Contact                                            3:27\n3. Andy Duguid Feat Leah - Don&amp;#039;t Belong                                5:26\n4. Solaris Heights - Vice (Sydenham Dub)                               6:11\n5. Global Experience - Madras                                          4:56\n6. Leonid Rudenko - Summerfish (Scandall Sunset On Ibiza Mix)          5:40\n7. Clear View Feat Jessica - Tell Me                                   4:27\n8. The Veil Kings - Searching For Truth                                5:40\n9. Ohmna - The Sun&amp;#039;ll Shine (Sunrise Mix)                              6:54\n10.Moonbeam - See The Difference Inside (Inside Mix)                   5:25\n11.Allure Feat Julie Thompson - Somewhere Inside Of Me                 8:01\n12.Taxigirl - High Glow                                                7:01\n13.Reeves Feat Alanah - Lonely                                         5:03\n14.Imogen Heap - Hide And Seek (Tiesto&amp;#039;s In Search Of Sunrise Remix)   7:26\n\nDisc 2/2\n--------\n1. Steve Forte Rio - A New Dawn                                        2:36\n2. Nic Chagall - What You Need (NC&amp;#039;s In Love With Prog Mix)            5:57\n3. Marc Marzenit - Trozitos De Navidad (Primavera Remix)               4:58\n4. John Dahlback - Don&amp;#039;t Speak                                         3:38\n5. Deadmau5 - Arguru                                                   5:20\n6. First State Feat Anita Kelsey - Falling                             7:45\n7. Jonas Steur Feat Jennifer Rene - Fall To Pieces                     6:32\n8. JES - Imagination (Tiesto Remix)                                    6:17\n9. Tom Cloud - Mercury Room                                            7:09\n10.Marcus Schossow - Chase My Rabbit                                   6:17\n11.Maor Levi - Reflect                                                 6:31\n12.Progression - Different Day, Different Light                        4:13\n13.Jedidja - Dancing Water                                             7:56\n14.D&amp;#039;Alt Vila - Breathing                                              1:37\n\n\n[Release Notes]\nAnd just when we thought there wouldnt be as big a release in Trance music this\nyear as the Elements Of Life album, we get word another biggie is on it&amp;#039;s way :)\n\nThe in In Search Of Sunrise series has been one of Tiesto&amp;#039;s most succesful\nseries since day one. Although most fans have been raving over the first five\ninstallments, the last two didn&amp;#039;t seem to have as much of an impact as\nthe first three, which were declared instant classics back then\n\nAlready Tiesto has been severely shaking up the community this year by doing a\nload of new remixes and productions which were tried and tested over the last\nfew months in his Club Life shows on Radio 538 and ofcourse on the road with a\nvast community of die hard fans keeping track of his every move\n\nFor In Search Of Sunrise 6, Tiesto flies over to Ibiza, the epitome of what the\nseries is all about!!\n\nWe start of on a shore with a light breeze through our hair standing in\nthe breakers... Ambient sounds of Es Vedra - La Hacienda, are making their way\nover the waves to us. A beautiful intro which is then followed by the actual\ntune on which La Hacienda obviously was based, Glenn Morrison - Contact,\nfrom Sander Kleinenberg&amp;#039;s LMR imprint.\n\nContact, co-produced with Deadmau5, does a great job of introducing the laidback\nproggy sound which we all know and love. After we made Contact we have rising\nstar Andy Duguid, from Chris Lake&amp;#039;s label Rising Music, with Don&amp;#039;t Belong,\na first of many new exclusive tunes. An incredible lush vocal and a happy summer\nmelody comes to the shore\n\nTiesto shows again he doesnt focus on the established Trance labels, with his\nnext pick Solaris Heights - Vice in the Jerome Sydenham Dub, from Renaissance\nAfter that is the new DJ Shah, Madras, under his Global Experience guise, which\nhas just been released on the Exclusive Beatport ISOS Sampler 1. Madras has that\nwarm summer feel and some Punjabi vocal chants. Leonid Rudenko&amp;#039;s Summerfish has\nbeen on Tiesto&amp;#039;s tracklists for a while already and is definitely an obvious\nchoice. After Summerfish we come to the first Tiesto (co-)production of the\nalbum (and there&amp;#039;s quite a few (6x) :)\nThis time Tiesto has dusted off his old guise Clear View and teams up with\nMax Graham and Jessica Jacobs for a superb vocal track. Very energetic and it\ntotally lives up to the good name Clear View still has.\n\nNext, The Veil Kings is another new exclusive track Tiesto has been playing alot\nOld friend Roberto Scilatti, from Loop Control fame, has been brought back from\nthe dead to create a truly magikal track once again with Eliano Daviti\nThen we have Ohmna with a bit of a harder feel for the first time, directly\nfollowed by Moonbeam&amp;#039;s newest track which is simply stunning. Amazing production\nwith equally amazing vocals!\nSomewhere Inside Of Me is another new production by Tiesto&amp;#039;s hands, who teams up\nwith Julie Thompson on the vocals once again. This time its not your typical\nAllure sound but that doesn&amp;#039;t matter with a great track like this!\n\nTaxigirl is the third new track by Tiesto, with Jes on the vocals, this sounds\nlike another piece of magic.\nAndy Duguid has another one in store for us on Disc 1 right now with Lonely!\nHe has really done an amazing job on this track also, featuring the same\nvocalist as Don&amp;#039;t Belong, Gita Bakradze\n\nFinishing up Disc 1 is Tijs&amp;#039; amazing remix of Hide &amp; Seek by Imogen Heap\nAlbeit a somewhat older vocal to use for a remix, this one really has the ISOS\nfeel written all over it and totally deserves to be named Tiesto&amp;#039;s In Search Of\nSunrise Remix\nAgain stunning production quality and perfect use of the vocals.\n\nDisc 2 starts of with Steve Forte Rio doing a perfect little intro track which\nis followed by Nic Chagall&amp;#039;s own remix of his What You Need. We notice Disc 2\nstarts off with creating a different feel than Disc 1. Marc Marzenit is next,\nalso in his own, Primavera Remix. After this is the amazing, but a tad old,\ntrack Don&amp;#039;t Speak from John Dahlback.\n\nIt seems Joel Zimmerman, or Deadmau5 as he&amp;#039;s more commonly known, has quickly\ndeveloped himself to be one of Tiesto&amp;#039;s good friends\nTiesto has been pumping out quite alot of productions lately by the Canadian\nwho again did some awesome work on Arguru. This pretty much finishes up the\nlittle techhouse section on Disc 2 because we return again to the amazing minds\nof Ralph Barendse and Sander Van Dien with their First State guise, and who have\nbeen busy producing a First State album also!\nJonas Steur is up next with his beautiful and trancy Fall To Pieces featuring\nbeautiful Jennifer Rene on the vox.\n\nTiesto&amp;#039;s remix of JES - Imagination was ofcourse a sure pick for ISOS6, as he\nwas playing it loads and featured it several times on Club Life\nWe&amp;#039;re pretty sure Tiesto likes the next one by Tom Cloud coz of its resemblance\nto Leama - Requiem For A Dream but that doesn&amp;#039;t matter at all. Awesome track!\n\nMarcus Schossow - Chase My Rabbit was probably the only name that was leaked\nbefore the tracklist came online. A great melodic proggy track :)\nWe thought Reflect was a bit old for ISOS6 and are pretty sure Maor Levi himself\ndidn&amp;#039;t really believe being featured on ISOS! Great track nonetheless which is\nthen followed by Progression&amp;#039;s title track from their debut artist album\nAnd we agree with Tijs, we think that&amp;#039;s the best track on that album also!\n\nThen with a mix which is not really perfect we have Tiesto&amp;#039;s last production\nof the album. Modest as he is Jedidja is Hebrew for &amp;#039;loved by God&amp;#039; ;)\nAgain a superb production, with some similar sounds which we&amp;#039;ve heard before\nin his Madonna - Die Another Day Remix!!\nAnd then finishing up Disc 2, D&amp;#039;Alt Vila - Breathing, again by Roberto Scilatti\nand Eliano Daviti, is an ambient outro for Jedidja - Dancing Water\n\n\nNow for finishing up this HUGE nfo :)\nAs you might have guessed already... with ISOS6, Tijs Verwest is back in top form!!\nHonestly we also thought Tiesto would never reach the level of ISOS1, 2 or 3 again,\nbut with Disc 1 he probably has!\nOut in 1 month, Sept 17th... be SURE to pick it up","torrent":{"xt":"urn:btih:ca52539ff2a250a2d6c4f2c6d8406f74722ecd3b","amp;dn":"VA-In_Search_Of_Sunrise_6_Ibiza__Mixed_By_Tiesto-2CD-2007-TGX_ww","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca52539ff2a250a2d6c4f2c6d8406f74722ecd3b","infoHashBuffer":{"type":"Buffer","data":[202,82,83,159,242,162,80,162,214,196,242,198,216,64,111,116,114,46,205,59]},"announce":[],"urlList":[]}}