{"title":"What is Forensic Medicine_An Interview in Hindi","uid":4011282,"size":287886854,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:caa9f3ed93f08b2fbadc900492584c3eba66f593&amp;dn=What+is+Forensic+Medicine_An+Interview+in+Hindi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"funnyguy1234","files":3,"time":1202104646,"description":"What is Forensic Medicine - Crime Reporter Manoj Raghuvanshi interviews Professor Anil Aggrawal, MAMC, New Delhi, India\n\nWhat is Forensic Medicine? What is Forensic Science? How do the two differ? How can a youngster take a career in Forensic Medicine or Forensic Science. What are the adventures of being a real life Sherlock Holmes? How does it feel to deal with dead bodies during the dead of night? How can we converse with the dead? Is it correct that dead men tell tales? How?\n\nThese are some of the many questions eager youngsters want to know today. Professor Anil Aggrawal, a leading forensic pathologist from New Delhi, India, who runs his own internet journal of forensic medicine and a number of related newsgroups at (http://geradts.com/anil/), answers these and a number of other related questions in a free-wheeling interview with the celebrated crime reporter Manoj Raghuvanshi.\n\nAlthough the CD would be useful for virtually anyone wanting to know about Forensic Medicine, I would imagine, the CD would be most useful to youngsters wanting to know about forensic medicine, and how to start a career in it.\n\nThere is a caveat though. The interview is in Hindi, and only those viewers can understand it, who can understand Hindi. There are no subtitles as well. Please keep this fact in mind before downloading.\n\n","torrent":{"xt":"urn:btih:caa9f3ed93f08b2fbadc900492584c3eba66f593","amp;dn":"What+is+Forensic+Medicine_An+Interview+in+Hindi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa9f3ed93f08b2fbadc900492584c3eba66f593","infoHashBuffer":{"type":"Buffer","data":[202,169,243,237,147,240,139,47,186,220,144,4,146,88,76,62,186,102,245,147]},"announce":[],"urlList":[]}}