{"title":"Xbox - RLT - Splinter Cell Pandora Tommarrow","uid":3368647,"size":2569687991,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:cc675eb4e2fd7b1be3ea3d71214086ee9b575fda&amp;dn=Xbox+-+RLT+-+Splinter+Cell+Pandora+Tommarrow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shady78","files":1,"time":1123801543,"description":"NTSC\nENGLISH\n\n\nLINK:\nhttp://www.xbox.com/en-US/splintercellpandoratomorrow/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=\n\n\n \nIn Tom Clancy?s Splinter Cell&amp;reg;: Pandora Tomorrow?, you play Sam Fisher, a cold-blooded stealth soldier waging a one-man war against an Indonesian terrorist network.\n \n  Features  \n \n \n\nBelieve the story: Inspired by the world of Tom Clancy, Pandora Tomorrow features a story line so real you can feel it. Tension-filled stealth action springs from a compelling and original plot that?s so realistic it could?ve been ripped from the headlines by scriptwriter JT Petty, who penned the original Tom Clancy?s Splinter Cell. \nUnderstand the characters: In this sequel, favorite characters like Sam Fisher and Irving Lambert return, unveiling even more about their personal histories in this character-driven story line. The cast of new antagonists includes the highly dangerous Suhadi Sodano, an Indonesian guerilla leader whose beliefs are sound, but whose methods are barbaric. And, then, there is Norman Soth, a CIA-trained mercenary. Is he deep under cover or a traitor working for the enemy? You?ll also encounter Douglas Shetland, the director of a private military corporation and an old acquaintance of Sam. And, there?s so much more to discover ? \nImmerse yourself: Revolutionary lighting, shadowing, animation, physics, and sound effects are pushed to the limit to create a universe so tightly woven that the line between reality and gaming starts to blur. High-resolution cinematics, amazing sound design, and top-quality voice-overs give Pandora Tomorrow a unique movie-production quality. \nShow off your moves: Now, more than ever, Sam relies on his moves. In this sequel to the original Splinter Cell, circumstances demand that Sam use his agility and athleticism to avoid detection and death. In fact, the level design demands them. Use a half-split jump to reach a ledge. Zip line across an open courtyard. Grapple along the side of a building, and SWAT-turn to bypass open doors unseen. \nStrap on the gear: Based on prototypes currently in development and gadgets out on the field, Sam Fisher?s high tech gadgets and tools will have you well-prepared for some intense stealth action. \nChallenge your friends: Enjoy evolutionary multiplayer gameplay online. \n \n \n \nGame Information  \n \n \nPublisher\nUbisoft \n\nDeveloper\nUbisoft \n\nStreet Date\nMarch 2004 \n\nPrice\n$49.99 \n\n \nRating\nTeen\n\n \n\n \nGame Features  \n \n \n  Players 1-4 \n  Memory Unit 463 Blocks \n  In-game Dolby&amp;reg; Digital \n  Communicator Headset \n  Content Download \n  Online Multiplayer \n  Voice \n  Friends \n  Scoreboard","torrent":{"xt":"urn:btih:cc675eb4e2fd7b1be3ea3d71214086ee9b575fda","amp;dn":"Xbox+-+RLT+-+Splinter+Cell+Pandora+Tommarrow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc675eb4e2fd7b1be3ea3d71214086ee9b575fda","infoHashBuffer":{"type":"Buffer","data":[204,103,94,180,226,253,123,27,227,234,61,113,33,64,134,238,155,87,95,218]},"announce":[],"urlList":[]}}