{"title":"Las Days","uid":3749168,"size":4475856896,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ccc32847ffa16ad5df13b988d718b83ab9881a1f&amp;dn=Las+Days&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dvdclon","files":14,"time":1185090880,"description":"Blake es un artista introspectivo que sufre el peso de la fama, las obligaciones personales y un profundo sentimiento de aislamiento. Llevado por los impresionantes ÃƒÂ¡rboles, Blake se adentra en el denso bosque donde encuentra un manantial de agua. A la maÃƒÂ±ana siguiente vuelve a su casa, una elegante pero descuidada mansiÃƒÂ³n. Mucha gente le anda buscando -sus amigos, quienes sÃƒÂ³lo lo quieren cuando necesitan algo, los directivos de su casa de discos, incluso un detective privado-, sin embargo ÃƒÂ©l no quiere ser encontrado. En la bruma de sus ÃƒÂºltimas horas, Blake busca la inspiraciÃƒÂ³n en el bosque para su ÃƒÂºltima canciÃƒÂ³n. Finalmente encontrarÃƒÂ¡ una soluciÃƒÂ³n a su atormentada existencia... Inspirada en los ÃƒÂºltimos dÃƒÂ­as de la vida del famoso cantante del grupo &quot;Nirvana&quot; y abanderado del movimiento &quot;grunge&quot; Kurt Cobain, &quot;Last Days&quot; relata la desesperaciÃƒÂ³n y soledad del cantante a pesar de su gran ÃƒÂ©xito, su inmenso paisaje creativo, sus relaciones ÃƒÂ­ntimas y su depresiÃƒÂ³n psicolÃƒÂ³gica que le llevÃƒÂ³ a encaÃƒÂ±onar una pistola en su cabeza y disparar.","torrent":{"xt":"urn:btih:ccc32847ffa16ad5df13b988d718b83ab9881a1f","amp;dn":"Las+Days","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccc32847ffa16ad5df13b988d718b83ab9881a1f","infoHashBuffer":{"type":"Buffer","data":[204,195,40,71,255,161,106,213,223,19,185,136,215,24,184,58,185,136,26,31]},"announce":[],"urlList":[]}}