{"title":"Recover My Files 3.9.8.5813[eNJoY-iT]","uid":3890952,"size":6871124,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cd329dbab8557adb590a6709b5d06166640cef07&amp;dn=Recover+My+Files+3.9.8.5813%5BeNJoY-iT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sunblock","files":1,"time":1195038491,"description":"Recover My Files ? data recovery software will recover deleted files emptied from the Windows Recycle Bin, or lost due to the format of a hard drive, virus infection, unexpected system shutdown or software failure. &quot;Recover My Files combines simplicity of use and speed with the most powerful data recovery engine on the market, together with a unique capability of ?on-the-fly? viewing while the search is being conducted.&quot; Recover My Files ? is fast and easy. No technical or data recovery software skill is required. Use Recover My Files ? to perform hard drive data recovery, or recover deleted files from floppy disk, zip drive, compact flash, smart media or other removable media. \n\nRecover My Files ? is compatible with Windows XP and works with FAT 12, FAT 16, FAT 32 and NTFS file-systems. When a file is deleted from a Windows Operating System the contents of the file is rarely destroyed. If the Windows reference information remains intact, Recover My Files ? reconstructs the link to the deleted file to enable data recovery. Even if the reference information itself has been destroyed, our data recovery software scans the storage media at a low level to locate ?Lost Files? by their internal file structure. This allows Recover My Files ? to locate and recover files that other data recovery software programs could never know exist. \n\n","torrent":{"xt":"urn:btih:cd329dbab8557adb590a6709b5d06166640cef07","amp;dn":"Recover+My+Files+3.9.8.5813%5BeNJoY-iT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd329dbab8557adb590a6709b5d06166640cef07","infoHashBuffer":{"type":"Buffer","data":[205,50,157,186,184,85,122,219,89,10,103,9,181,208,97,102,100,12,239,7]},"announce":[],"urlList":[]}}