{"title":"HAIRSPRAY - ENG/SPA","uid":3940420,"size":4634181726,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cd64336861d66d10ac51e4048c0f2956f4641ba1&amp;dn=HAIRSPRAY+-+ENG%2FSPA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"arrobar","files":18,"time":1198095516,"description":"ORIGINAL TITLE: Hairspray\nYEAR: 2007 \nRUNNING TIME: \t107 min.\nCOUNTRY: \tUnited States\nDIRECTOR: \tAdam Shankman\nSCREENWRITER: \tLeslie Dixon (Play: Mark O&amp;#039;Donnell. Remake: John Waters)\nCOMPOSER: \tMarc Shaiman\nCINEMATOGRAPHER: \tBojan Bazelli\nCAST: \tJohn Travolta, Queen Latifah, Michelle Pfeiffer, Christopher Walken, Nikki Blonsky, James Marsden, Amanda Bynes, Zac Efron, Brittany Snow, Elijah Kelley, Allison Janney, Nikki Blonsky\nSTUDIO/PRODUCER: \tNew Line Cinema\nOFFICIAL WEB: \nGENRE: \tComedy / Musical\nSYNOPSIS/PLOT: \tFrom the New Line Cinema website: ?From cult classic film to hit Broadway musical to major motion picture, Hairspray is a true New Line franchise,? commented Bob Shaye and Michael Lynne, New Line Co-Chairmen and Co-CEOs. ?John and Queen Latifah will bring new sensibilities to the characters of Edna Turnblad and Motormouth Maybelle, and introduce this innovative musical comedy to new audiences.?\n\nZadan and Meron said: &quot;It&amp;#039;s long been a desire of ours to work with John Travolta and to have the opportunity to produce his return to movie musicals after three decades...it&amp;#039;s a dream come true. And having worked so successfully with Queen Latifah on Chicago, we were looking for the perfect vehicle to re-team... Hairspray presented us with a wonderful opportunity to collaborate once again with our multi-talented friend.&quot;\n\nHairspray is originally based on the 1988 John Waters comedy about star-struck teenagers on a local Baltimore dance show. The new version of the film will be based on New Line&amp;#039;s hit Broadway adaptation of the film which debuted in 2002, and went on to win eight Tony Awards including Best Musical, Best Score, Best Book and Best Director.\n\nMarc Shaiman (Sleepless in Seattle) and Scott Wittman will contribute new songs to their existing Tony Award winning score. Shaiman will also serve as the film&amp;#039;s music supervisor and will compose the music score for the film as well as produce its songs. Wittman and Shaiman will also serve as executive producers on the film. The new screenplay for Hairspray is written by Leslie Dixon (Freaky Friday, Outrageous Fortune).\n\nEmmerich is overseeing the project along with New Line&amp;#039;s Executive VP of Production Mark Kaufman, and Creative Executives Michael Disco and Daryl Freimark.\n\nTravolta burst into the dance musical world thirty years ago with Saturday Night Fever and packed a one-two punch the following year with the release of Grease , the most successful movie musical of all time. Travolta was nominated for Oscars for Fever and Pulp Fiction. He is represented by the William Morris Agency and attorneys Mike Ossi and Howard Butler.\n\nHairspray reunites Latifah with producers Zadan and Meron (she earned an Oscar and Golden Globe nomination for her work in Chicago) and director Shankman (she starred in his blockbuster Bringing Down The House).\n\n\n--- THE DVD --- \n\n\nSYSTEM: PAL\n\nAUDIO: Spanish Dolby Digital 5.1, English Dolby Digital 5.1\n\nSUBTITLES: Spanish, English\n\nIMAGE: 2.35:1 16/9\n\nFORMAT: DVD9 =&gt; DVD5\n\nCOMPRESSION:DVDFAB DECRYPTER + DVDREMAKE PRO + DVDREBUILDER PRO + HC 2 PASS\n\nLOG REBUILDER:\n\nCitar\n- Reduction Level for DVD-5: 67,5%\n- Overall Bitrate : 3.645Kbs\n- Space for Video : 3.312.440KB\n- HIGH/LOW/TYPICAL Bitrates: 5.058/1.638/3.645 Kbs\n\n\nIn Spain this dvd doesn&amp;#039;t bring spanish menu.\n\nVisit www.dvdquorum.com the best Spanish site for DVD&amp;#039;S.\n\nPREMIERE QUORUM TEAM","torrent":{"xt":"urn:btih:cd64336861d66d10ac51e4048c0f2956f4641ba1","amp;dn":"HAIRSPRAY+-+ENG%2FSPA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd64336861d66d10ac51e4048c0f2956f4641ba1","infoHashBuffer":{"type":"Buffer","data":[205,100,51,104,97,214,109,16,172,81,228,4,140,15,41,86,244,100,27,161]},"announce":[],"urlList":[]}}