{"title":"shuffle demons greatest hits","uid":4013445,"size":174765930,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cdf24226a78862604ca8bea4eeafdb693b9a9292&amp;dn=shuffle+demons+greatest+hits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"milina","files":17,"time":1202228835,"description":"ful album vbr nothing below 260\ngenre jazz/other\nreview taken from cdbaby.\nplz seed when done and enjoy\n\nWhat do you get when you cross 3 amazing saxophonists dressed in wacky clothes, a crazy dancing drummer and a killer upright bass player, have them sing songs about Buses, Roaches and Hockey and spend 1/2 their time playing in the audience? The Shuffle Demons, that&amp;#039;s what!!! They were a band that captured the imagination of a generation with their antics and amazing no holds barred playing and stopped traffic on a regular basis. And now they&amp;#039;re back!! \n\n20 years later the Shuffle Demons return to form with a greatest hits album, a DVD and a whole lot of demonic attitude. So get ready to sway in your seat, jump to your feet and dance to the Demon beat! But who are these debonair ruffians, these satirical streetniks of stage, screen, and sidewalk... these Cartoon Hepcats with the cracked conviction of 5 Harpo Marxes? And is it really 20 years since the Demons first took the Spadina Bus??\n\nThis is the legend of the Shuffle Demons. Beginning in September 1984 with veteran street sax player Demon Richard Underhill pleasing the pedestrian multitudes at the corner of Yonge and Bloor in Toronto, the Shuffle Demons quickly evolved into an immensely popular group.\n\nDrawing hordes of hipsters to their street gigs with their wild playing and exotic wardrobe, the original Demons (Mike Murley, Dave Parker, Rich Underhill, Stich Wynston, and Jim Vivian) next took their caustic collection of musical majesties and travesties inside and began pleasing bunches of boppers in Canadian clubs and at Jazz Festivals. Inspired by these fashion assassins and their original street hits &amp;#039;Spadina Bus&amp;#039;, &amp;#039;The Shuffle Monster&amp;#039;, &amp;#039;What do you Want?, and &amp;#039;Out of My House. Roach,&amp;#039; large delirious audiences began experiencing the early stages of shuffle rapture.\n\nThen things got really crazy! &amp;#039;Spadina Bus&amp;#039; became a MuchMusic hit, and was quickly followed by the hilarious &amp;#039;Out of My House, Roach&amp;#039;. The Demons caught fire, sold more independent albums than anyone up to that point, were nominated for a Juno, won 5 CASBY Awards, toured like mad and released their 2nd album (Bop Rap) which featured a very popular rendition of &amp;#039;Hockey Night in Canada Theme.&amp;#039; More touring and more albums followed and soon the Shuffle Demons were playing to packed houses around the world with a new line -up featuring Perry White and George Koller.\n\nThe Shuffle Demons released 6 albums and 7 videos in their 13 year career. They played 1000s of shows at every major jazz and folk festival in Canada during 15 Canadian tours. They toured Europe 15 times playing from Estonia to Italy, from the Netherlands to Norway, from Switzerland to Sweden, from Germany to Belgium. And all the while they kept audiences excited, dancing and smiling as they built up a solid fan base that to this day will never forget the music and the antics...stopping traffic with the famous &amp;#039;Spadina Bus&amp;#039; walk around, playing a Mingus tune and really meaning it, thrashing around the stage in crazy interpretive dance, delivering the classic poem &amp;#039;What do you Want.&amp;#039; DON&amp;#039;T MISS THE RETURN OF THE SHUFFLE DEMONS!\n\nFACTS &amp; Estimates\n3 saxes, bass, drums, one goatee, 20 years later, 6 albums, 5 Casby&amp;#039;s, 2 Toronto Musician Awards, 1 Juno nomination, 7 videos, 700,000 km, 3800 concerts, 6500 conga lines, 1 cockroach, 12 Beer my dear,100,000 rubles, 1 Spadina Bus\n18 countries, Canada, US, Cuba, Belgium, Germany, The Netherlands, England, France, Spain, Scotland, Estonia, Lithuania, Finland, Luxembourg, Norway, Sweden, Italy, DDR, 15 European tours, 20 Canadian tour- nobody else like them!!!!!\n\nThe Shuffle Demons&amp;#039; Streetniks \nPosted: 2003-02-27 \n\nBy Trevor MacLaren www.allaboutjazz.com\n\nThe Shuffle Demons \nIndependent \n1986 \n\nIn the mid to late eighties popular jazz was traveling through some pretty murky waters. In the eyes of many young people, jazz had taken on the stodgy air that afflicts Baroque, Classical and Romantic era music. Many no longer saw jazz as music of the people, but instead music of pompous intellectuals. With many of the genre&amp;#039;s best performers taking on the guise of adult contemporary smooth layered in drum machines and synths, it was damn scary.\n\nWhile most people were convinced that comatose grooves such as Kenny G&amp;#039;s &quot;Songbird&quot; passed for great jazz, a force had emerged. Five garishly dressed -pajamas?- young men resembling fifties-era beatniks laid out great chops while singing about a Toronto bus run, &quot;Spadina Bus&quot;. Although they looked goofy and sang songs such as &quot;Get out of My House, Roach&quot; and &quot;The Puker,&quot; they were amazing players who translated their love of jazz into some of the most original music of the eighties.\n\n&quot;For many young Canadians glued to video station MuchMusic, it was an exciting first foray into bop, free and fusion.&quot;\n\nWith their debut Streetniks, Toronto&amp;#039;s The Shuffle Demons changed the way a whole new generation looked at jazz, in much the same way DJ Spooky has in the nineties. Led by Mike Murley (now with Metalwood), Rich Underhill and Dave Parker on saxes, the group was rounded out with Stich Wynston on percussion and Jim Vivian on bass. The Demons built a huge following on the street corners of Toronto, leading to both a video of &quot;Spadina Bus&quot; and the release of the independent Streetniks. They mixed a quirky groove with fun rap style lyrics (which they called bop rap), blazing solos and a sound that remained every bit true to the pioneers of be-bop.\n\nAlthough aimed at a jazz audience, Streetniks gathered a new group of listeners through their hipster/clown style. With the thumping bass opening of &quot;Spadina Bus,&quot; which recalls layouts by both Mingus and Carter, followed by a downbeat that leads into a horn chop that etches itself into your brain. It is hard to imagine even today that serious playing like this will lead to lyrics such as &quot;I reached deep down in my pocket to try and find some coin/ But much to chagrin all I found was my groin&quot;. Even though Dizzy was certainly the clown prince of bop, he would never have spilled such words before an audience.\n\nBut the proof is in the music. The solo on second single &quot;Get Out of My house, Roach&quot; is brilliant: a slap in the face chunk of be and free-bop that send shivers down one&amp;#039;s spine. But what makes this bizarre is that it became a hit single on MuchMusic&amp;#039;s video singles chart! The idea that people who were listening to synthetic divas such as Madonna would groove to skillfully played jazz with ripping free solos is still hard to imagine. Opening with squeaks and squeals that owe influence far more to Ornette Coleman and Albert Ayler than the be-bop pioneers. A track every bit different as possible from &quot;Spadina Bus&quot; proved to all critics that the Demons had more depth than being a novelty act.\n\nAlthough they would never reach the success of Streekniks again, the Demons&amp;#039; other records held a tightly glued cult following that still exists. Even today their mixture of contemporary styles with bop is still fresh. The ideas and originality laid out on Streetniks still lie unmatched seventeen years later.\n\nMessage from demon Rich:\n\nThe Shuffle Demons were always about the convergence of top notch musicianship and crowd pleasing antics, combining jazz, bop rap, free jazz, poetry and performance art into a musically compelling and visually stimulating show.\n\nThe Demons played 1000s of sold out shows in Canada, traversing the country no less than 15 times from 1986-1997, building up a solid fan base that to this day will never forget the music and the antics...stopping traffic with the famous &amp;#039;Spadina Bus &amp;#039; walk around, playing a Mingus tune and really meaning it, thrashing around the stage in crazy interpretive dance, delivering the classic poem &amp;#039;What do you Want.&amp;#039;\n\nWhat I enjoyed the most about the Shuffle Demons was that each show was unique, and each fan and band member felt like they were part of something special. Our interactions with the crowd during our walk arounds and our no holds barred performances really captured the imagination of a whole generation of concert goers, and spawned many a jazz career","torrent":{"xt":"urn:btih:cdf24226a78862604ca8bea4eeafdb693b9a9292","amp;dn":"shuffle+demons+greatest+hits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdf24226a78862604ca8bea4eeafdb693b9a9292","infoHashBuffer":{"type":"Buffer","data":[205,242,66,38,167,136,98,96,76,168,190,164,238,175,219,105,59,154,146,146]},"announce":[],"urlList":[]}}