{"title":"The Descent - Scary As Hell Edition","uid":3758149,"size":741072845,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce6ff95b980871f086c4905d66bb2ec6091580f5&amp;dn=The+Descent+-+Scary+As+Hell+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"3Raz0r","files":3,"time":1185835870,"description":"THE DESCENT - SCARY AS HELL EDITION\n\nThis is my second fanedit.\nIt is my take on the rather great horror movie THE DESCENT.\n\nDetails:\n82 minutes, NTSC\nenglish\n\n\nWhat was done?\n-Sarah is not hallucinating:\nSarah is a the traumatized psycho of the group. In a terrible car accident her kid and \n\nhusband get killed, while she was driving. When the other girls take her on the caving tour \n\nshe is still not cured. During the movie she has lots of hallucinations and in the grand \n\nfinale she is living in her hallucination, celebrating the birthday of her daughter.\nAll of this is gone. She is traumatized, yes, but we don&amp;#039;t see why and we never experience \n\nany of her hallucinations. Removing these scenes made Sarah more a member of the group and \n\nless the focus of it all. Also it spares the audience from the rather dragging and long \n\nbeginning and it makes the single ending more possible. Removing the hallucinations keeps \n\nthe entire movie in reality.\n\n-Juno is a hero\nJuno is the heroine of the group, the fighter, the leader with great physical skills and a \n\nbit of a lack in social skills. She is responsible for the group getting lost in the cave \n\nand she also by accident kills one of the girls. For this she has to pay a great price. \n\nSarah hits her with a climbing hammer, so she cannot run away from the crawlers and is \n\ndestined to die.\nThis killing by revenge was for me the reason for this fanedit. It was an accident. Juno is \n\na good guy and she saved more lives than each of the other girls. Killing her like that was \n\ntotally unnecessary and it felt unfair to me. Yes, she walks away from the dying Beth, \n\nalthough Beth asks her to stay, but still, she is in panic and it is all too much. Her \n\nreaction is maybe not nice, but very understandable.\nSince I don&amp;#039;t want to spoil it all, I will just say: I changed a lot, so Juno can be a hero \n\nin the end.\n\n-One ending is enough\nYes, it simply is. The second ending felt completely senseless to me and rather confused me \n\nthan making me think: &quot;oh brilliant.&quot; Now I think I do get the intention of the director, \n\nbut it did not work for me, so I changed it to one single ending.\n\nWhat was not done?\nI didn&amp;#039;t touch the monsters, although my first intention was to reduce their scenes. But \n\nwith the entire movie in reality, they are just scary, disgusting and cool, even in the \n\nscene, when one crawler sits on Sarah and doesn&amp;#039;t realize that she is alive.\nThe monsters appear late, but they do quite intense then.\n\nSo finally you get a horror movie, which was improved in my opinion. The original is great, \n\nbut this one is for sure scarier.\n\nEnjoy.\n\nMore about fanedits:\nwww.fanedit.org\n\nYou must own the original movie to legally watch this.\n\nThis will be released as high quality DVD later on on Rapidshare, available through \n\nwww.fanedit.org.\n\nWho am I?\nI am 3Raz0r, I like horror movies and I dig fanedits.","torrent":{"xt":"urn:btih:ce6ff95b980871f086c4905d66bb2ec6091580f5","amp;dn":"The+Descent+-+Scary+As+Hell+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce6ff95b980871f086c4905d66bb2ec6091580f5","infoHashBuffer":{"type":"Buffer","data":[206,111,249,91,152,8,113,240,134,196,144,93,102,187,46,198,9,21,128,245]},"announce":[],"urlList":[]}}