{"title":"godzilla.mothra.and.king.ghidorah.2001.dvdrip.xvid.fragment","uid":3361357,"size":732935663,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d0313d0470406c1ce5dd5f9ad1d6eabebc9becb9&amp;dn=godzilla.mothra.and.king.ghidorah.2001.dvdrip.xvid.fragment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bloedprop","files":2,"time":1122387257,"description":"This dvdrip has the original Japanese audio and english subtitles.\n\nJapanese titel: Gojira, Mosura, Kingu Gidor&amp;acirc;: Daikaij&amp;ucirc; s&amp;ocirc;k&amp;ocirc;geki\n\n\nDirected by Shusuke Kaneko\n\nPlot:\nStrange incidents occur when an American submarine has been destroyed by a mysterious force at sea off the shores of Guam. Only Admiral Tachibana was certain that behind the disaster was none other than the destructive King of the Monsters, Godzilla! 50 years after his attack on Tokyo in 1954, Godzilla has mysteriously returned to life to destroy Japan, and General Tachibana, whose parents died in the monster's destructive wake, was prepared for his return to protect Japan from yet another tragic disaster, but is dismissed by the overly confident Japanese government, who underestimate Godzilla's power. But to further prove Tachibana's claim, his daughter Yuri, who works for the TV news program &quot;Digital Q,&quot; investigates strange phenomena in three separate areas in Japan (two of which involve the deaths of immoral youths), and meets a mysterious old man named Isayama, who proclaims that aside from his infamous nuclear origins, Godzilla is an accumulation of vengeful souls (of both Japanese and non-Japanese) abandoned to die in the Pacific War, and thus, mere weapons cannot kill him. While Tachibana has now been vindicated by the government, Isayama awakens the Three Sacred Guardian Beasts of Yamato, which protected Japan in its ancient past, and were then put into hibernation in the aforementioned three areas of Japan. The three monsters, King Ghidorah (sky), Mothra (water) and Baragon (earth), fight the ravaging Godzilla, while Tachibana also prepares to go into battle against his old radioactive nemesis ...\n\n\n-bloedprop-","torrent":{"xt":"urn:btih:d0313d0470406c1ce5dd5f9ad1d6eabebc9becb9","amp;dn":"godzilla.mothra.and.king.ghidorah.2001.dvdrip.xvid.fragment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0313d0470406c1ce5dd5f9ad1d6eabebc9becb9","infoHashBuffer":{"type":"Buffer","data":[208,49,61,4,112,64,108,28,229,221,95,154,209,214,234,190,188,155,236,185]},"announce":[],"urlList":[]}}