{"title":"FS2004 - Aero Files - Texture Booster Pack FS9","uid":3775380,"size":10653664,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d1c2ac3726f0d9dec40d3cfc9a7188d13343a0b6&amp;dn=FS2004+-+Aero+Files+-+Texture+Booster+Pack+FS9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"4X-AXG","files":1,"time":1187303200,"description":"Aero Files Texture Booster Pack FS9 is a high quality texture enhancement for Microsoft Flight Simulator 9 (only) which will improve your Flight-Sim experience.\n\nSince the release of Texture Booster Pack FSX there was a strong demand for a FS9 version of this product. Texture Booster Pack FSX is a bestseller on one of the flight sim sites that the FSX version of this product is listed on.\n\nThe FS9 version is just as breathtaking with a few changes to fit FS9.\n\nTexture Booster Pack improves your FS9: Taxiways, Runways, Runway lighting,  Aprons, Taxiway-markings, Runway snow effects, Runway &amp; Taxiway Wet look, Runway lights &amp; water bump map on all worldwide oceans, rivers &amp; Lakes, even the sun has been improved greatly. \n\nTexture Booster Pack is easy to use and has no Performance hit on your Flight Sim &amp; will improve your enjoyment of FS9 wherever you choose to start your flight.\n\nA new version for buildings and other texture sets are on their way.\n\nYou will even be able to see cracks in the runways (where available) with much more detail than the default FS9 textures.\n\nThis texture set is simply just breathtaking. As soon as you start playing you will notice more details in the textures compared to the default textures in FS9.\n\nThese textures will help on computers which have a problem with FPS as long as you meed the standards of FS9.","torrent":{"xt":"urn:btih:d1c2ac3726f0d9dec40d3cfc9a7188d13343a0b6","amp;dn":"FS2004+-+Aero+Files+-+Texture+Booster+Pack+FS9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1c2ac3726f0d9dec40d3cfc9a7188d13343a0b6","infoHashBuffer":{"type":"Buffer","data":[209,194,172,55,38,240,217,222,196,13,60,252,154,113,136,209,51,67,160,182]},"announce":[],"urlList":[]}}