{"title":"Subtle - Yell &amp; Ice [2007] MP3 160kbps","uid":4006381,"size":50095405,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d21fa190ce6126599cbb9837d0502eabf2435954&amp;dn=Subtle+-+Yell+%26+Ice+%5B2007%5D+MP3+160kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dkords","files":9,"time":1201849995,"description":"Review\tby Marisa Brown\n\nIn 2006 avant hip-hop group Subtle, led by the ever-enigmatic Doseone, issued Wishingbone, a collection of remixes and remakes of song off their 2004 album, A New White. In 2006 Subtle also released the fantastic For Hero: For Fool, an abstract piece that tells the tale of Hour Hero Yes, a kind of middle-class Everyman looking for answers, direction, and perhaps salvation in our very postmodern world. And like A New White, this record was followed up by its own set of revisions, the &quot;limited-edition mini album&quot; Yell &amp; Ice. Not so much remixes as re-imaginings, the nine songs on Yell &amp; Ice play with the same generally esoteric (at least in absolute comprehension) themes found on the full-length, but twist and pull them around, bringing in outside vocalists (Chris Adams of Bracken, Tunde Adebimpe of TV on the Radio, Markus Acher from the Notwist, Yoni Wolf of Why?, and Dan Boeckner of Wolf Parade) to add, amend, and contribute their own views as Doseone harmonizes whiningly in the background. &quot;I have found the bloody key that lets the loud out,&quot; Acher repeats on &quot;The Pit Within Pits,&quot; while Adebimpe repeats the question &quot;Did you dig through instead unflinching?&quot; as the dark, empty percussion of &quot;Deathful&quot; draws out to a unnerving close. It&amp;#039;s beat-heavy, mechanized, industrial-inspired stuff, full of coughing synths and stuttering programming -- so much so that even the beatboxing of &quot;Sinking Pinks&quot; sounds inhuman. Yell &amp; Ice is otherworldly, a catholic yet cryptic, intelligent, and enlightening album demanding that the listener not only pay attention, but dance, too. ","torrent":{"xt":"urn:btih:d21fa190ce6126599cbb9837d0502eabf2435954","amp;dn":"Subtle+-+Yell+%26+Ice+%5B2007%5D+MP3+160kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d21fa190ce6126599cbb9837d0502eabf2435954","infoHashBuffer":{"type":"Buffer","data":[210,31,161,144,206,97,38,89,156,187,152,55,208,80,46,171,242,67,89,84]},"announce":[],"urlList":[]}}