{"title":"Servo 2005","uid":3901150,"size":546336779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d26619d7b3d05f604ffb7e7d7c1db9a13c97bc62&amp;dn=Servo+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HawkCrave","files":13,"time":1195576335,"description":"Servo Magazine, all issues from 2005.\n\nSERVO Magazine is dedicated to the &quot;Next Generation of Robotics Experimenters&quot;, devoted 100% to robots and robotics. With an all robots - all the time focus, each monthly issue will inspire, educate, and entertain with feature articles, interviews, tutorials, DIY projects, hacks, parts sources and much more. Whether you are building your first line-follower or finishing off the perception layer in a positronic brain, SERVO Magazine delivers the sharp technical tools you need to stay on the cutting edge. Advances in robotics are dynamic and as important as those of computers in the 80s and 90s. \n\nJust as with computers, hobbyists are a driving force in their evolution. SERVO is there to take you inside this fascinating world of science and technology. Whether you want a front row seat or to jump in with your soldering iron and C compiler - SERVO Magazine is your ticket in the door. A definite must-read for anyone interested in building or learning about robots!\n\nFeatures &amp; Project Articles\n\nTopics are diverse and range from programmable logic, stepping motor basics, radio communication basics for robots, autonomous operation, closed loop systems, voice recognition, adding vision, bit banging, to product and book reviews, and build-it-yourself bots and systems projects. Events such as DARPA, robot soccer championships, FIRST, ComBots, underwater robot challenges, just to name a few are covered, as well.\t","torrent":{"xt":"urn:btih:d26619d7b3d05f604ffb7e7d7c1db9a13c97bc62","amp;dn":"Servo+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d26619d7b3d05f604ffb7e7d7c1db9a13c97bc62","infoHashBuffer":{"type":"Buffer","data":[210,102,25,215,179,208,95,96,79,251,126,125,124,29,185,161,60,151,188,98]},"announce":[],"urlList":[]}}