{"title":"MOBILedit! 1.97","uid":3349686,"size":12226688,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d3109226a1bcde421a8328c604074dfbd1a67258&amp;dn=MOBILedit%21+1.97&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Grandolfs","files":4,"time":1119976973,"description":"MOBILedit! is an open system, bringing the ability to control the phone from your PC. After connecting the phone via cable,IrDA or Bluetooth, view the contents of the phone on the PC, do full-text searches, dial and send SMS's. With a simpleclick, backup all your data, copy them to different mobile phones and manipulate your contacts without even touching thephone. When you receive an SMS, it arrives on your PC in a similar way as an email; simply reply to it or move the SMS tothe archive. You will become much more productive as a result.\n\nFeatures: http://www.mobiledit.com/main_features.asp\n\n- unique open architecture with phone drivers and installable applications\n- communication via infrared, Bluetooth or cable\n- large quantity of mobile phones supported (virtually all)\n- file system enabling work with multimedia files stored in a phone like \n  ringtones, photos, MP3's, themes, and java applications\n- a powerful editor for phonebooks stored in phones or SIM cards\n- search and dial directly from your computer phonebook quickly\n- send SMS messages quickly from your PC\n- sort, read, and archive your SMS messages on your hard drive\n- archive and AutoBack-up will protect your data in case you lose your phone\n- play games like Chess, Backgammon and many others on your PC through your\n  mobile phone\n- all mobile phone functions will be possible to control, even those yet to\n  be developed powerful printing\n- skinnable design; new look can be downloaded from the Internet\n- complete MS Outlook and Outlook Express support\n- Using MOBILedit!, your phone will be automatically anonymously registered\n  in myphonesafe.com database, a useful\n  tool helping you to protect your mobile phone from being stolen or sold.\n\nScreens: http://www.mobiledit.com/main_screenshots.asp\n\nHistory Version 1.97\n\n- beta version of MMS plugin has been included (works with Nokia 6230,\n  3200, 6610i only)\n- MOBILedit! remembers sound scheme settings\n- other minor bug fixes\n- 2 new sound schemes has been created by our professional composer","torrent":{"xt":"urn:btih:d3109226a1bcde421a8328c604074dfbd1a67258","amp;dn":"MOBILedit%21+1.97","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3109226a1bcde421a8328c604074dfbd1a67258","infoHashBuffer":{"type":"Buffer","data":[211,16,146,38,161,188,222,66,26,131,40,198,4,7,77,251,209,166,114,88]},"announce":[],"urlList":[]}}