{"title":"Fingersmith (Episode 1 of 2) [Lesbian BBC drama]","uid":3367735,"size":3610121502,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d353edd83bf468b54ff09c46439f56168d66febd&amp;dn=Fingersmith+%28Episode+1+of+2%29+%5BLesbian+BBC+drama%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fredrika2","files":38,"time":1123629033,"description":"Fingersmith means thief, and this drama just might steal your heart. Or your mind, for that matter.\n\nFingersmith was written (Sarah Waters), wizardly teleplay-written (Peter Ransley) and produced (Gerorgina Lowe for Sally Head) by the same people as that of the series Tipping the Velvet which I have previously uploaded here at Pirate Bay. However, Fingersmith is in no way a sequel to Tipping the Velvet; it is more of a suspense drama.\n\nThe novel was released some three years ago. It is an unusually good novel that nearly won the Booker prize. It might just be a good idea to read it before you watch it, not to spoil a good read (support your local library!). \n\nThe story is set in England, circa 1860, where, of course, lesbians were considered criminals to a far greater extent than is the case today. &quot;In the dark and twisting alleyways of Dickensian London the stories of two very different young women collide with terrifying consequences&quot; as it says on the dvd package.\n\nCast and production is first-class quality. The only minor objection I would have is that the editor (Bryan Oates) makes quite a few glitches (jump-cuts).\n\nA word of warning, though: There are no subtitles and the sometimes whispery and very British language/dialogue might be a little difficult to catch up with, especially for non-English. But with dvd, it is of course very easy to replay a few missed words.\n\nAs usual, I will upload the first part only to begin with, to make download faster for you. Also you will be able to decide whether you will want to use more bandwith by downloading part two. Furthermore, it might still be possible to download the behind-the-scenes clip for preview evaluation at this address:\n\nhttp://thepiratebay.se/details.php?id=3367178\n\nDETAILS:\nIncluded is high-resolution full dvd cover and a desktop wallpaper-like official promotional still.\n\nFormat is uncompressed, pristine BBC full quality (PAL) DVD.\nSpoken language: English\nNo subtitles.\nDolby Digital stereo.\nAspect ratio is 16:9 anamorphic widescreen\nRunning time, each episode, is 1 hour 30 minutes.\n","torrent":{"xt":"urn:btih:d353edd83bf468b54ff09c46439f56168d66febd","amp;dn":"Fingersmith+%28Episode+1+of+2%29+%5BLesbian+BBC+drama%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d353edd83bf468b54ff09c46439f56168d66febd","infoHashBuffer":{"type":"Buffer","data":[211,83,237,216,59,244,104,181,79,240,156,70,67,159,86,22,141,102,254,189]},"announce":[],"urlList":[]}}