{"title":"Roggero Deodatos CANNIBAL HOLOCAUST [Divx5.0] (Viv4U@RavishU)","uid":3882653,"size":921901516,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d3d260dab66ba0800fc9a6554a4dfd94981c3f02&amp;dn=Roggero+Deodatos+CANNIBAL+HOLOCAUST+%5BDivx5.0%5D+%28Viv4U%40RavishU%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chrystelle","files":6,"time":1194741762,"description":"Cannibal holocaust is a truly charged viewing experience; in all its 20 years of existence no other non mondo film (until maybe Men behind the sun) had such a reputation to shock, even today it is believed by some at the UKs trading standards to be an actual snuff film. CH is not the goriest film ever made, but in terms of themes and narrative its still the cruellest, most fascinatingly harsh piece of filmaking in the horror genre. Ive seen all the Traces of death, the men behind the sun films, and the Guinea pigs and I still think this is king. It is simply so well made, acted, atmospheric and the brilliant score by Riz Ortalani sets the scene so well. The fake documentary style never slips up. But perhaps the most unsettling thing about CH is that it is an exploitation film, and the scenes of animal cruelty (and even human) unsettle because they are being shown to promote a response...should you look away or not?Like I said Cannibal Holocaust is a truly unique experience, not some Gory novelty like Cannibal Ferox, and in this time of increased media coverage of true life atrocity maybe its pertinent? Maybe its just nasty cruelty, maybe it even dissapoints you...you just have to see it to gauge you\\&amp;#039;re own response. For me at least its a classic. (User Comment/Courtesy IMDB)","torrent":{"xt":"urn:btih:d3d260dab66ba0800fc9a6554a4dfd94981c3f02","amp;dn":"Roggero+Deodatos+CANNIBAL+HOLOCAUST+%5BDivx5.0%5D+%28Viv4U%40RavishU%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3d260dab66ba0800fc9a6554a4dfd94981c3f02","infoHashBuffer":{"type":"Buffer","data":[211,210,96,218,182,107,160,128,15,201,166,85,74,77,253,148,152,28,63,2]},"announce":[],"urlList":[]}}