{"title":"BRANDED (1965) 1-3 [retr0tv]","uid":3969080,"size":941920303,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d5ca7bb53a1c985564863b66c26212b04014fd9f&amp;dn=BRANDED+%281965%29+1-3+%5Bretr0tv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"flixer","files":4,"time":1199903371,"description":"BRANDED followed the life of Jason McCord (Chuck Connors), former Captain in the U.S. Cavalry. Court martialled for cowardice under fire during the Battle of Bitter Creek from which McCord was the only survivor, McCord knows he is innocent but refuses to pin the blame where it belongs, his commanding officer, General Reed, who died in the battle.\n\n1. SURVIVAL   (1/24/1965)\nJason McCord comes to the aid of a man, Jed Colbee, who he finds on foot and near death in the desert.\n  Guest star: Alex Cord (Jed Colbee), Robert Carricart (Navajo), Valerie Szabo (Jessie Colbee), Janet De Gore (Sally), Harry Harvey, Sr. (Stable Owner)\n\n2. THE VINDICATOR  (1/31/1965)\n&quot;What happened at &amp;#039;Bitter Creek&amp;#039;?&quot; That&amp;#039;s what Ned Travis - a newspaper reporter from the New York Herald wants to know. His editor sent him west to do a story on Jason McCord. He searches out the widow of Lt. John Pritchett who was third in command and served under McCord.\n  Guest star: John Marley (Ritter), Charles Thompson (Telegrapher), Claude Akins (Ned Travis), Harry Carey Jr. (Lt. John Pritchett), John Litel (General James Reed), June Lockhart (Sue Pritchett), Johnny Jensen (Johnny), John Pickard (I) (Sergeant), Robert Random (Soldier)\n\n3. THE TEST  (2/7/1965)\nWhile on his way to Sioux Falls. Jason unintentionally involves a Catholic priest in a deadly encounter with four drunken Comanches.\n  Guest star: Jason Evers (Father Durant), Jay Silverheels (Wild Horse), Joe De Santis (Indian Chief), Michael Kemp (Bold Eagle), John War Eagle (Medicine Man), Alberto Monte (Indian)\n\nXviD/640x480/23.97fps\nMP3/48kHz/118kbps/22min\n\nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:d5ca7bb53a1c985564863b66c26212b04014fd9f","amp;dn":"BRANDED+%281965%29+1-3+%5Bretr0tv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5ca7bb53a1c985564863b66c26212b04014fd9f","infoHashBuffer":{"type":"Buffer","data":[213,202,123,181,58,28,152,85,100,134,59,102,194,98,18,176,64,20,253,159]},"announce":[],"urlList":[]}}