{"title":"Xilioft DVD Creator 3.0.32.1105","uid":3923137,"size":15305006,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d5e6312c8728a61cd9a3b830ab3fca0735e41d13&amp;dn=Xilioft+DVD+Creator+3.0.32.1105&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eqspartan","files":2,"time":1196926315,"description":"Create Downloaded movies to DVDs.  Very easy to use.\n\nXilisoft DVD Creator 3.0.32.1105\n\n\nXilisoft DVD Creator provides a simple, fast way to convert popular video formats such as convert AVI to DVD, WMV, ASF, DivX, Xvid, 3GP, MP4, MPEG to DVD and burn DVD movie which is playable on home DVD player with the perfect quality. \nXilisoft DVD Creator allows you to specify NTSC or PAL format, adjust 4:3 or 16:9 video aspect, and either burn DVD movie disc or ISO file. The DVD Creator, i.e. DVD maker, is also DVD menu maker which provides so many brilliant DVD menus for your DVD authoring, supports DVD-R, DVD+R, DVD-RW and DVD+RW. No DVD maker supports so comprehensive video formats like Xilisoft DVD Creator! So easy to use and fast than ever before, just one click to burn DVD movie or convert AVI to DVD, MPEG to DVD! \n\nThere has been no DVD burner supporting so comprehensive video formats including AVI, MPEG, WMV, DivX, Xvid, VOB, 3GP, MP4, etc., which means that the Internet will become storehouse of your home theater! And compared with other application, Xilisoft DVD Creator has more features attracting your eyes.\n\nSuper fast converting speed!\n? Offer multithreading and batch conversion; \n? Fully support Intel? Pentium D Dual-Core Processor and AMD Athlon? 64 X 2 Dual-Core Processor; \n? Provide &gt;200% converting speed, so fast beyond your imagination. \n? Burn DVD movie disc with DVD title Menu, own DVD menu maker; \n? Support all popular video and audio formats; \n? Encoders and decoders are built-in. \n\nFeatures :\n? Convert AVI to DVD, WMV, DV, DivX, Xvid, VOB, 3GP, 3G2, MP4, MPEG to DVD; \n? Burn AVI to DVD, WMV, DV, DivX, Xvid, VOB, 3GP, 3G2, MP4, MPEG to DVD, DVD maker; \n? DVD Creator is the easiest, fastest way to burn DVD movie disc with DVD menu maker; \n? High-Quality and fastest converting engine inside; \n? Support multiple Bitrate and Frame Rate, you can get best quality video with TV screen; \n? Allow you to specify NTSC or PAL format, adjust 4:3 or 16:9 video aspect; \n? Burn DVD movie disc, ISO file, or DVD folder; \n? DVD Creator as DVD maker provides so many brilliant DVD menus for DVD authoring; \n? Supported device types include DVD-R, DVD+R, DVD-RW, DVD+RW. \n\nHomepage - http://xilisoft.com/dvd-creator.html","torrent":{"xt":"urn:btih:d5e6312c8728a61cd9a3b830ab3fca0735e41d13","amp;dn":"Xilioft+DVD+Creator+3.0.32.1105","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5e6312c8728a61cd9a3b830ab3fca0735e41d13","infoHashBuffer":{"type":"Buffer","data":[213,230,49,44,135,40,166,28,217,163,184,48,171,63,202,7,53,228,29,19]},"announce":[],"urlList":[]}}