{"title":"Finally Everything","uid":3877731,"size":48495918,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d70bd00ca5f69c05bcc8948c43a3f5c3df16a029&amp;dn=Finally+Everything&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"finallyeverything","files":13,"time":1194487093,"description":"Finally Everything.\n\nHi Thanks for downloading our music. We want to reach as many people as possible!\n\nWe come from Bristol England, and would love your feed back and thoughts. We are on myspace &amp; facebook etc.\n\nLook forward to hearing from you, we will put more music out soon hopefully or come and see us!\n\nMatt \nFinally Everything. \n\n\n\n\n\nInfo:\n\\\\\\\\\\\\\\&quot;BEAUTIFUL, DRAMATIC, EUPHORIC, EMPATHETIC, ROCK\\\\\\\\\\\\\\&quot;. \nThe band quickly got together in 2006 after many hours of discussing music and guitars in work time. Many songs became stronger and more dynamic through the initial practice sessions, with the band quickly gelling. With emphasis on beautifully crafted rock songs with smooth and strong vocals and innovative guitar lines supported by powerhouse drumming and raging rhythms. The band has proven they will seduce &amp; draw you in before blowing the roof off and your socks. Finally Everything are set to become you new favourite band, &amp; until recent one of the best kept secrets in the south west. Big things will happen for this group, there is no doubting that. For those that see the bands first shows, they will always be able to say they were there when it started and say Finally Everything was here. The band may throw in some covers for their audience, as new bands do, which will be a selection of artists that have influenced their unique style\n","torrent":{"xt":"urn:btih:d70bd00ca5f69c05bcc8948c43a3f5c3df16a029","amp;dn":"Finally+Everything","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d70bd00ca5f69c05bcc8948c43a3f5c3df16a029","infoHashBuffer":{"type":"Buffer","data":[215,11,208,12,165,246,156,5,188,200,148,140,67,163,245,195,223,22,160,41]},"announce":[],"urlList":[]}}