{"title":"O-Hum - Nahal-e Heyrat album","uid":3751542,"size":48601580,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d74bb20ab07d1030e2a573c49fc7c746ce317e7a&amp;dn=O-Hum+-+Nahal-e+Heyrat+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DJ Boozehound","files":11,"time":1185300651,"description":"O-Hum means &quot;Illusions&quot; in Persian. The band formed in 1999 by Shahram Sharbaf [Singer\\Songwriter] with Shahrokh Izadkhah [Guitar] and Babak Riahipour [Bass]. O-Hum&amp;#039;s music is a combination of Western Rock style mixed with Persian traditional Music and Instruments, with Shahram singing lyrics from the great 14th century Iranian Poet &quot;Hafez&quot;. O-Hum signed a record deal with a music label in Iran and recorded the first album &quot;Nahal-e Heyrat&quot; in summer of 1999. Soon the record company took the album to the Ministry of Culture [Ershad] to get release permission. Ershad rejected the album quickly, believing the album was too western and out of their standards. After many failed efforts to get the permission, record company canceled their deal with O-Hum and handed back &quot;Nahal-e Heyrat&quot; to the band. in January of 2001 O-Hum launched its official website &quot;O-Hum.com&quot; and put the whole album track downloads online for free. O-Hum&amp;#039;s music started to spread around so fast and in a short time Iranian young generation got to be familiar with this Iranian rock back singing Hafez poetry. O-Hum also received a huge feedback and application from abroad and as many believe, became the pioneers of Iranian modern rock movement. During this period the band tried many times to get the release permission or play concerts which all of them ended up being canceled by Ershad. In March 2001 O-Hum played its first concert held privately in Russian orthodox church in Tehran and played &quot;Nahal-e Heyrat&quot; to the excited audiences. In January 2002 the band went to studio to record their two new singles called &amp;#039;Hafez in Love&quot;; two songs which later became the last songs O-Hum recorded with its original lineup. &quot;Hafez in Love&quot; and &quot;The Way of Love&quot; were released in March 2002 through O-Hum.com and soon became so popular with fans and listeners around the world [Only in first week of &quot;Hafez in Love&quot; release, singles were downloaded more than 15,000 times].\n\nIn spring 2002 Babak and then Shahrokh decided to leave the band due to their personal reasons: Shahrokh moved to Vancouver\\Canada, and Babak was preparing himself to start a family. Shahram moved to Canada and stayed there for a short period and then returned to Tehran to continue O-Hum as a solo project. After a couple of months of rehearsing and organizing the live band, O-Hum traveled to Germany in spring of 2003 to play concerts in Berlin, Hamburg and Rostock. The band received a huge appreciation and feedback from the fans and Germany Medias; and Shahram was more encouraged to keep playing O-Hum music. O-Hum gigs in Germany also started a new chapter in Iranian underground music; giving Iranian rock bands more confident about how they could appear on international music scene. The band also played a couple of shows after returning to Tehran [Including UNAIDS 2004 charity show in December 2004], and at the same time Shahram had started working on O-Hum&amp;#039;s second album which got delayed due to different matters a few times.\n\nIn winter of 2004 Shahram began the final recording sessions with songs he had written in last two years. The new album &quot;ALOODEH&quot; finished in summer of 2005 and &quot;Bamahang Productions&quot; , an Iranian record label in Canada, signed up with Shahram to release the album in North America and Europe. &quot;ALOODEH&quot; will be released 20 December 2005 by Bamahang Co. and due to heavy request from the fans, the advance ordering for album has already started. At this moment Shahram is living in Tehran preparing to rehears with his new live lineup for upcoming gigs, and has started writing new material for O-Hum&amp;#039; third album. \n\n\nNahal-e Heyrat\nAlbum\\1999\n\nLyrics from The Great HAFEZ \nMusic by Shahram Sharbaf  \n\nProduced, Engineered and Mixed by Shahram Sharbaf \nRecorded at Shahram&amp;#039;s Home Studio\\Tehran. Additional Editing by Shahrokh Izadkhah  \n\nAlbum Sleeve Design by Zartosht Soltani  [Zmandesign] \n\n\nMusicians  \nShahram Sharbaf Vocals, Guitar, Synthesizer, Programming \nShahrokh Izadkhah Guitar,Traditional instruments, Synthesizer \nBabak Riahipour Bass \nReza Abayee Kamanche, Gheychak \nNima Mohandesan Tar \nAli Rahimi Daf \nMoni Safikhani Accoustic Guitar, Backing Vocal \n \n  \nTrack List  \n11. Darvish  \n12. Ala Ya Ayyohal Saghi     \n13. Dar Deyre Moghan     \n14. Nahal-e Heyrat  \n15. In Sham-e Delafrooz    \n16. Goftam Gham-e to Daram   \n17. Eybe Rendan Makon!\n18. Dideh darya Konam  \n19. Cho Baad... \n10. Afsoon ","torrent":{"xt":"urn:btih:d74bb20ab07d1030e2a573c49fc7c746ce317e7a","amp;dn":"O-Hum+-+Nahal-e+Heyrat+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d74bb20ab07d1030e2a573c49fc7c746ce317e7a","infoHashBuffer":{"type":"Buffer","data":[215,75,178,10,176,125,16,48,226,165,115,196,159,199,199,70,206,49,126,122]},"announce":[],"urlList":[]}}