{"title":"Frank Zappa's 200 Motels ","uid":3946703,"size":414085678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d75c269f135bc90462bd2c64ab9192e9fcad5259&amp;dn=Frank+Zappa%5C%27s+200+Motels+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"st2580smile","files":1,"time":1198528320,"description":"Less a movie than a purposely crude series of musical vignettes and inside jokes for die-hard fans, Frank Zappa informs viewers in the opening scene that &quot;Touring can make you crazy, ladies and gentlemen, and that is what 200 Motels is all about.&quot; The rest of the plot-less production is filled with more self-reflexive reminders, as the close-up eye and tape recorder signal that Zappa is watching everything his bandmembers are doing. Reasonably, the Mothers of Invention make up the cast, notably Jimmy Carl Black, who repeatedly remarks how he just wants to quit the band and go play real music, have a beer, and get laid. The character of Jeff, played by Martin Lickert, was written for bassist Jeff Simmons, who actually did quit the band just prior to shooting. Other cast members include real-life groupies appearing in some bizarre nudity sequences, along with the Who&amp;#039;s drummer Keith Moon as the Hot Nun who overdoses on drugs. Ringo Starr appears as Larry the Dwarf and lends some humorous narration, but that does not clarify any of the proceedings. The action supposedly takes place in Centerville, which is really a kind of poorly dressed set guarded by soldiers. The scenes are randomly assembled and interspersed with performances, including the songs &quot;Lonesome Cowboy Burt,&quot; &quot;Magic Fingers,&quot; and &quot;Strictly Genteel.&quot;\n\nCAST:\n\nThe Mothers of Invention  - Themselves  \nTheodore Bikel  - Rance Muhammitz  \nRingo Starr  - Larry the Dwarf  \nJanet Ferguson    \nLucy Offerall  - Groupies  \nPamela Miller  - Interviewer  \nGeorge Duke  - Member of Mothers of Invention  \nHoward Kaylan  - Member of Mothers of Invention  \nKeith Moon  - The Hot Nun  \nTony Palmer    \nDon Preston  - Member of Mothers of Invention  \nRoyal Philharmonic Orchestra    \nMark Volman  - Member of Mothers of Invention  \nFrank Zappa  - Himself  \n","torrent":{"xt":"urn:btih:d75c269f135bc90462bd2c64ab9192e9fcad5259","amp;dn":"Frank+Zappa%5C%27s+200+Motels+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d75c269f135bc90462bd2c64ab9192e9fcad5259","infoHashBuffer":{"type":"Buffer","data":[215,92,38,159,19,91,201,4,98,189,44,100,171,145,146,233,252,173,82,89]},"announce":[],"urlList":[]}}