{"title":"Planetes Vol.3","uid":3904596,"size":910467072,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:d7c17c8de6aad4d2bc9b847231eaa0c423e9007f&amp;dn=Planetes+Vol.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alejandrobeta","files":5,"time":1195764458,"description":"Situado en el 2075, el acceso al espacio se ha convertido en algo habitual para buena parte de la poblacion, la Humanidad a colonizado la Luna y Marte en busca de nuevos recursos, y se esta preparando la primera incursion en el sistema Joviano. Pero las ocupaciones de los protagonistas ( Hachimaki, Yuri y Fee ) son mucho mas mundanas: La recogida de basura espacial, un problema que empieza a ser un tema preocupante ya hoy dia y que en el futuro que presenta esta serie se ha convertido en una verdadera amenaza para la navegacion.\n\nPlanetes se basa en la recreacion realista del espacio tal y como lo conocemos....no hay alienigenas invasores, ni lasers destructivos, ni naves que vayan mas rapido que la luz, un viaje a otro planeta requiere meses, las leyes de la fisica existen, no hay sonidos en el espacio, los adultos tiene problemas de adultos, y los astronautas veteranos pueden morir de cancer por estar tanto tiempo expuestos a radiacion. En definitiva, y aunque es inevitable que en ocasiones caiga en situaciones algo rocambolescas propias de las series de anime, se aleja por completo de los mundos de fantasia de otras producciones de este genero ( como podria ser Macross o Harlock, entre otras ) presentando un hipotetico futuro cercano que podria perfectamente hacerse realidad\n\nCompuesta de 26 capitulos, los primeros 16 son historias cortas mientras que en los ultimos 10 se desarrolla una trama mas continua. En ocasiones se nota que la historia esta alargada un poco mas de lo necesario, normal si tenemos en cuenta que el manga original en que se basa solo tiene 4 tomos, pero aun asi es una fantastica produccion animada muy cuidada en todos sus aspectos y absolutamente recomendable para cualquiera interesado en el espacio...una vision realista, cuidada y sobretodo muy humana. Como la vida misma.\n","torrent":{"xt":"urn:btih:d7c17c8de6aad4d2bc9b847231eaa0c423e9007f","amp;dn":"Planetes+Vol.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7c17c8de6aad4d2bc9b847231eaa0c423e9007f","infoHashBuffer":{"type":"Buffer","data":[215,193,124,141,230,170,212,210,188,155,132,114,49,234,160,196,35,233,0,127]},"announce":[],"urlList":[]}}