{"title":"Xbox - RLT - Mortal Kombat Deadly Alliance","uid":3371673,"size":1295384396,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d886decb88dbf13832f36f06c4f39b70296fec11&amp;dn=Xbox+-+RLT+-+Mortal+Kombat+Deadly+Alliance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"shady78","files":1,"time":1124413088,"description":"NTSC\nENGLISH\n100% Retail\n\n\nLINK:\nhttp://www.xbox.com/en-us/mortalkombatdeadlyalliance/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=mortalkombatdeadlyalliance\n\n\nMortal Kombat: Deadly Alliance enters the 21st Century with an all-new fighting system, brutal fatalities and an intense storyline that pushes the limits of the next-generation consoles. Mortal Kombat: Deadly Alliance begins the next chapter in the battle of good versus evil as two powerful sorcerers?Shang Tsung and Quan Chi?join forces to deliver unrivaled fighting action in their quest for supreme mortality.\n\nPlayers engage in hand-to-hand and special-weapon combat, executing secret moves and combinations with new fatalities and deadly body blows. Lethal new warriors are added to the mix along with the return of Mortal Kombat classics Scorpion, Rayden, Sub-Zero, and Sonya. Hyper-realistic, Mortal Kombat: Deadly Alliance features the progressive demise of opponents while utilizing three unique fighting styles for each warrior, creating unlimited fighting possibilities.\n\n\n\nFeatures  \n \n \n\nCompletely NEW Fighting System. Each warrior has three unique fighting styles including hand-to-hand and deadly-weapon combat adding a whole new strategy to Mortal Kombat fighting. \nFull 3D movement with extremely realistic fighting effects. Ripped clothing, bruises, sweat-dripping and blood. \nBrutal Fatalities. A Mortal Kombat favorite. They're back with gruesome and bloody detail first time seen on next-generation systems. \nCharacter-specific &quot;special attacks&quot; such as Scorpion's deadly spear move. \nNew and old favorite characters. Returning: Johnny Cage, Kung Lao, Raiden, Sonya, Scorpion and more. New: Female Sub-Zero, Moloch, Mavado and more. Over 20 total characters! \nOminous and exquisitely detailed, interactive environments. More than 20 fighting environments in all! \nMultiple Play Modes: Arcade Mode, VS Mode, Expanded Practice Mode, Test Your Might and Test Your Sight\n\nDVD content:\n\nThe &quot;Making of Mortal Kombat Deadly Alliance&quot;\nHistory of Mortal Kombat \nExclusive Mortal Kombat Deadly Alliance video and song by heavy rock sensation Adema \n \n \nGame Information  \n \n \nPublisher\nMidway Home Entertainment Inc. \n\nDeveloper\nMidway \n\nStreet Date\nNovember 2002 \n\nPrice\n$19.99 \n\n \nRating\nMature\n\n \n \n \n \n \n \n","torrent":{"xt":"urn:btih:d886decb88dbf13832f36f06c4f39b70296fec11","amp;dn":"Xbox+-+RLT+-+Mortal+Kombat+Deadly+Alliance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d886decb88dbf13832f36f06c4f39b70296fec11","infoHashBuffer":{"type":"Buffer","data":[216,134,222,203,136,219,241,56,50,243,111,6,196,243,155,112,41,111,236,17]},"announce":[],"urlList":[]}}