{"title":"Blackwater Najaf","uid":3364966,"size":134304012,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dad06d899de5b491ce6f7a2c3ed71070435cfc07&amp;dn=Blackwater+Najaf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"double tap","files":2,"time":1123103640,"description":"The 5 man BW crew that was assinged tto CPA Najaf were coming under heavy small arms and mortor fire, the city was being taken over by insurgents. The Police stations and hospitals were taken by as well, after a day of fighting off hundreds of insurgents the city had been completly overran, with the CPA in the heart of the city and no way out.\n\nthe Team called up to Baghdad and reported the situation. they said they needed immediate extract which Gen Sanchez also denined due to the fact the city had been overran and they were no US troops there, only contractors. Well Ambassador Bremer was pissed at sanchez and I remember being on office watch during the massive arguments! ambassador bremer and our Baghdad TM Leader got together and Bremer said &quot;I dont want another Bridge hanging! Get those boys out of there by any means nessassary!&quot; so 12 of us 6pilots and 6 gunners loaded as much as we could in 3 MD530 little birds and headed 70 miles south. we flew in the first day and blind (no comms, and no intel on the heat) to try a resupply, land find out was was going on and then head back, rearm and get ready to go again. Well that night all hell broke lose and we flew back in. Over 1000 insurgents (reported by the F18 pilots) had taken the city and now wanted the CPA after a day of intense fighting by 11 BW guys, airstrikes, a handfull of Marines and 1 sniper we were able to hold them off. After it DIED down and gunships and SF guys finnally started to roll in the battle was soon over and we the CPA was saved.","torrent":{"xt":"urn:btih:dad06d899de5b491ce6f7a2c3ed71070435cfc07","amp;dn":"Blackwater+Najaf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dad06d899de5b491ce6f7a2c3ed71070435cfc07","infoHashBuffer":{"type":"Buffer","data":[218,208,109,137,157,229,180,145,206,111,122,44,62,215,16,112,67,92,252,7]},"announce":[],"urlList":[]}}