{"title":"L.L.Bean-Guide to Canoeing-Ken Stone (1985)","uid":4004542,"size":527206934,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:dbfcf1aaae88ec86d602ab63f3d22facd68ad939&amp;dn=L.L.Bean-Guide+to+Canoeing-Ken+Stone+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xofokim","files":1,"time":1201747731,"description":"From the L.L.Bean Outdoor Video Library - A Guide to Canoeing\n\nFrom fast whitewater action to the beauty of wilderness touring, the L.L.Bean Video Guide to Canoeing offers a complete course in this rewarding sport. Beginning with the fundamentals of flatwater cruising, instructor Ken Stone covers the basic paddling strokes that power the canoe. Ken then applies these lessons to whitewater situations, showing how to modify your stroke for fastwater runs. Also are covered reading a river for safe passage, correct equipment, choosing a canoe that is right for your needs, general water safety and river rescue. Meant to be replayed and reviewed, this course allows you to analyze the subtle, precise movements of a renown expert, helping you to improve your own technique.\n\nShot entirely on the beautiful rivers in the wilderness that surround Maine&amp;#039;s highest peak, Mt Katahdin, this guide will be an exiting and a valuable addition to any video library.\n\nKen Stone\nKen is recognized as one of America&amp;#039;s premier canoeist and an expert instructor. A Maine native, he has been avidly involved in the sport for over 16 years (1985). Ken twice took top honors as the National Master&amp;#039;s Canoe champion and currently is the coach of the U.S. Whitewater Slalom team. A complete canoeist, Ken also designs and builds boats and is active as a New England representative to the American Canoe Association.\n\nISBN 0-13-539057-5\nFriendship II Productions (1985)\n\nDetails:\nOriginal VHS Tape RIP with QuickTime Pro \nModerate quality\nH.264, 320x240, AAC Stereo\n1 hour 41 minutes\n\nThe quality is just okay in this small size. I&amp;#039;m working on a 640x480 size, but the original filming is just not the greatest quality.\nI wish this would be re-released by L.L.Bean on DVD as it is an exceptional well-made guide to learn about this great sport. If someone knows about a better digital copy, I&amp;#039;d like to hear about it.","torrent":{"xt":"urn:btih:dbfcf1aaae88ec86d602ab63f3d22facd68ad939","amp;dn":"L.L.Bean-Guide+to+Canoeing-Ken+Stone+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbfcf1aaae88ec86d602ab63f3d22facd68ad939","infoHashBuffer":{"type":"Buffer","data":[219,252,241,170,174,136,236,134,214,2,171,99,243,210,47,172,214,138,217,57]},"announce":[],"urlList":[]}}