{"title":"Electric Light Orchestra - 1971 - Electric Light Orchestra (FLAC","uid":3992617,"size":275786651,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dcb529c8e278f9cab1c65cd22b9c36f40afbb792&amp;dn=Electric+Light+Orchestra+-+1971+-+Electric+Light+Orchestra+%28FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"norsee","files":11,"time":1201129104,"description":"FLAC 775-968 kbps\nRip from 2006 remaster CD\n\nTrack listing\n10538 Overture (Lynne) ? 5:32\nLook at Me Now (Wood) ? 3:17\nNellie Takes Her Bow (Lynne) ? 5:59\nThe Battle of Marston Moor (July 2nd 1644) (Wood) ? 6:03\nFirst Movement (Jumping Biz) (Wood) ? 3:00\nMr. Radio (Lynne) ? 5:04\nManhattan Rumble (49th Street Massacre) (Lynne) ? 4:22\nQueen of the Hours (Lynne) ? 3:22\nWhisper in The Night (Wood) ? 4:50\n\nBonus tracks\nBattle of Marston Moor (Alternate take) (Wood) ? 1:00\nNellie Takes Her Bow (Alternate Mix) (Lynne) ? 6:02\nMr. Radio (Take 9) (Lynne) ? 5:19\n10538 Overture (Alternate mix) (Lynne) ? 5:46\n\nThe Electric Light Orchestra is the debut LP by Electric Light Orchestra released in 1971. In the US the album is better known by the title No Answer.\n\nIt was released in the US in 1972 under the title No Answer due to a misunderstood telephone message left for a United Artists Records executive asking about the album name[1]. The album is centred around the core trio of Roy Wood, Jeff Lynne, and Bev Bevan who were the remaining members of rock group The Move. The Move were still releasing singles in the UK at the same time as this project was undertaken, but interest was soon to be abandoned in Wood&amp;#039;s former band. The sound is unique on this recording in comparison to the more slickly-produced ELO albums of the subsequent Jeff Lynne years, incorporating many wind instruments and replacing guitar parts with heavy, &quot;sawing&quot; cello riffs, giving this recording an experimental &quot;Baroque-and-roll&quot; feel; indeed, &quot;The Battle of Marston Moor&quot; is the most baroque-influenced track on the album. On this track, Roy Wood, in addition to playing virtually all the instruments, had to provide the percussion as well because Bev Bevan, normally the groups percussionist and drummer, refused to play on the track due to his low opinion of it. However, the overall musical connection to The Beatles (it had been stated by the bandmembers that ELO was formed to &quot;pick up where The Beatles left off...&quot;) is quite apparent in this album; tracks such as &quot;10538 Overture&quot; and &quot;Mr. Radio&quot; were strongly influenced by such Beatles tracks as &quot;I Am The Walrus&quot; and &quot;Strawberry Fields Forever.&quot; Despite the experimental nature of the album (or perhaps because of it) it charted on both sides of the Atlantic. The more mainstream &quot;10538 Overture&quot; became a top ten hit in the UK, later sampled by Paul Weller on his hit song &quot;The Changingman&quot; in 1995.\n\nThe original LP was mixed in Quadrophonic sound but was only released in this format in South America. Many of these &quot;quad&quot; tracks appeared on a later double-CD release entitled Early ELO, 1971-1974 (available only as an import in the U.S.). The original album art was designed by Hipgnosis and the photographs of the band on the back of the album cover, dressed in seventeenth century period costume, were taken at the Banqueting House in Whitehall, adding to the Baroque flavor and emphasis on Stuart England found on the record. &quot;Mr. Radio&quot; was intended to be the second single from the album, but was subsequently withdrawn. The edited single version made its first appearance on the 2005 compilation album Harvest Showdown instead.","torrent":{"xt":"urn:btih:dcb529c8e278f9cab1c65cd22b9c36f40afbb792","amp;dn":"Electric+Light+Orchestra+-+1971+-+Electric+Light+Orchestra+%28FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcb529c8e278f9cab1c65cd22b9c36f40afbb792","infoHashBuffer":{"type":"Buffer","data":[220,181,41,200,226,120,249,202,177,198,92,210,43,156,54,244,10,251,183,146]},"announce":[],"urlList":[]}}