{"title":"Bit.Defender.Professional v.9.0","uid":3371195,"size":17165748,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:de3f57a3093a57f05c0a1fbd91bf5bac537082d6&amp;dn=Bit.Defender.Professional+v.9.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KilJaden","files":3,"time":1124314456,"description":"Information:\n--------------------------------------------------------------------------------\n\nAntivirus\n\nThe mission of the Antivirus module is to ensure detection and removal of all \nviruses in the wild. BitDefender Antivirus uses robust scan engines, certified \nby ICSA Labs, Virus Bulletin, Checkmark, CheckVir and T&amp;Uuml;V.\n\nHeuristics in Virtual Environment\nHeuristics in Virtual Environment (HiVE) emulates a virtual \ncomputer-inside-a-computer where pieces of software are run in order to check \nfor potential malware behavior. This BitDefender proprietary technology \nrepresents a new security layer that keeps the operating system safe from \nunknown viruses by detecting malicious pieces of code for which signatures have \nnot been released yet.\n\nPermanent Antivirus Protection\nThe new and improved BitDefender scanning engines will scan and disinfect \ninfected files on access, minimizing data loss. Infected documents can now be \nrecovered, instead of being deleted.\n\nPeer-2-Peer Applications Protection\nFilters against viruses that spread via instant messaging and file sharing \nsoftware applications.\n\nInnovative Behavior Blocking\nBlocks malicious applications based on behavior analysis. The method ensures \nproactive protection against newborn viruses, Trojans, Internet worms and other \npotentially malicious codes. The file system, registry and Internet activity are \nconstantly monitored.\n\nFull E-mail Protection\nBitDefender runs on the POP3/SMTP protocol level, filtering incoming and \noutgoing e-mail messages, regardless of the e-mail client used ( MS Outlook, MS \nOutlook Express, Netscape, Eudora, Pegasus, The Bat, etc.), without any \nadditional configuration.\n\n\n--------------------------------------------------------------------------------\n\nFirewall\n\nThe firewall module protects your data and your privacy by filtering the \nincoming and outgoing traffic, controlling cookies, blocking malicious scripts \nand ?XXX-dialer? type programs.\n\nInternet Traffic Control\nDefine exactly which incoming or outgoing connections to permit/deny. Define \nrules regarding specific protocols, ports, applications and/or remote addresses.\n\nActive Content Control\nProactively blocks any potentially malicious application such as: ActiveX, Java \nApplets or Java Scripts type codes.\n\nDial Control\nA configurable anti-dialer prevents malicious applications from running up a \nhuge telephone bill at your expense.\n\nCookie Control\nThe firewall filters incoming and outgoing cookie type files, keeping your \nidentity and preferences confidential when you're browsing the Internet.\n--------------------------------------------------------------------------------\n\n\nAntispam\n\nQuite simply put, the BitDefender antispam module deals with the problem of \nspam, so you don't have to.\n\nAnti-Phishing\nStay clear of malicious e-mails trying to trick you into giving away your bank \naccount info with BitDefender's new phishing detector.\n\nSelf-learning Bayesian Filter\nThe advanced, self-learning Bayesian filter lets you classify messages as &quot;Spam&quot; \nor &quot;Ham&quot;, with a single click in the BitDefender antispam toolbar. The filter \nwill learn after just a few iterations, and you'll find yourself having to make \nfewer and fewer decisions as time goes by. Each tag you assign will improve the \nfilter's accuracy. Your filter sensitivity settings can be as high or as low as \nyou like.\n\nHeuristic, URL, White List/Blacklist, Charset and Image Filters\nFive types of filters further refine your control over e-mail. The heuristic \nfilter checks mail for characteristics of spam. The White List/Blacklist filter \nwill reject mail from known spammer addresses and let your friends' mail \nthrough, the URL filter blocks mail containing malicious links while the charset \nfilter blocks mail written with ?strange? characters. The image filter can \ndecide whether images embedded in e-mails are specific to spam.\n\nHassle-Free\nYou'll only be notified of the arrival of legitimate messages. Spam will collect \nsilently in your &quot;Junk&quot; folder, to be examined or discarded at your leisure.\n\nCompatibility and Outlook(tm) integration\nBitDefender antispam is compatible with all e-mail clients. The BitDefender \nantispam toolbar in Microsoft Outlook and Outlook Express allows users to filter \nmail and contacts without exiting Outlook.\n\n","torrent":{"xt":"urn:btih:de3f57a3093a57f05c0a1fbd91bf5bac537082d6","amp;dn":"Bit.Defender.Professional+v.9.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de3f57a3093a57f05c0a1fbd91bf5bac537082d6","infoHashBuffer":{"type":"Buffer","data":[222,63,87,163,9,58,87,240,92,10,31,189,145,191,91,172,83,112,130,214]},"announce":[],"urlList":[]}}