{"title":"Gospel Gangstaz","uid":3362690,"size":266894764,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df76911352e5eb33b344b50af5ba3a06cc20b2d0&amp;dn=Gospel+Gangstaz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DVP","files":43,"time":1122648009,"description":"The group was founded by Mr. Solo, a former gang member, when he turned his life over to Jesus after almost dying from gunshot wounds. He credits his mother to planting the early seeds of God in his life as she would always pray for him. Mr. Solo grew up in South Central Los Angeles with Chille' Baby, who started going to church with Mr. Solo and evantually came to know Christ also. Mr. Solo and Chille' Baby met the third member of their group at church when Tik Tokk also made the decision to follow Christ. The union of the three was quite miraculous as Mr. Solo and Chille' Baby were both former Crips while Tik Tokk was a Blood, (the two gangs are intense rivals).\n\nThe GOSPEL GANGSTAZ are role models. &quot;we don't consider ourselves above anybody. But God has given us insight to see the truth. We understand their pain, and they know we know the real. I gotta make music for my homies. I believe in bringing the church to people, not just bringing people to church&quot;, Tik Tokk stated.\n\n&quot;The GOSPEL GANGSTAZ stand in a position to help, because we have seen how the gospel of Christ is real. Our lives were changed from selling crack, drive-by shootings, car-jacking and illicit sex, to a life of peace, joy and happiness because of Christ. We want to go back to the hood and let our light shine&quot;, says Solo.\n\n&quot;We are real G'z with our own war stories and our own battle marks. We survived and now we must fight for our brothers and sisters that are trapped in a world of violence and poverty, adds Chille'.","torrent":{"xt":"urn:btih:df76911352e5eb33b344b50af5ba3a06cc20b2d0","amp;dn":"Gospel+Gangstaz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df76911352e5eb33b344b50af5ba3a06cc20b2d0","infoHashBuffer":{"type":"Buffer","data":[223,118,145,19,82,229,235,51,179,68,181,10,245,186,58,6,204,32,178,208]},"announce":[],"urlList":[]}}