{"title":"psych 13th floor eles receive all u can hold wav","uid":3352987,"size":808742033,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dfe502fc479ad02ab11a0d29fae92724a3ec15ff&amp;dn=psych+13th+floor+eles+receive+all+u+can+hold+wav&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"guthlac2","files":28,"time":1120680221,"description":"Won't accept flac files so I'll try wav. No art from guthlac2\n            13th Floor Elevators\n\n         &quot;RECEIVE ALL YOU CAN HOLD&quot;\n                      \n\n               length:  76:26\n\n\n\n          Demos:\n\n01. Everybody Needs Somebody To Love   3:45\n02. Monkey Island                      2:28\n03. Monkey Island (slightly truncated) 2:25\n04. Through The Rhythm                 3:16\n05. Roller Coaster                     3:48\n06. Fire Engine                        2:37\n\n\n          KAZZ-FM, Austin TX, 16 March 1966:\n\n07. The Word                           3:15\n08. Monkey Island                      2:48\n09. Roller Coaster                     5:08\n10. DJ patter                          1:34\n11. I'm Down                           5:29\n12. DJ patter                          1:15\n13. Gloria                             7:40\n14. DJ patter                          1:33\n15. Miss Me                            1:18\n\n\n          Int. Artists 1966 rough session tapes:\n\n16. chatter                            1:14\n17. Monkey Island                      2:50\n18. chatter                            0:17\n19. Roller Coaster                     5:12\n20. chatter                            0:55\n21. Fire Engine                        3:28\n22. bits                               0:57\n23. Through The Rhythm                 3:18\n24. Tried To Hide                      2:56\n25. false starts                       0:43\n26. Don't Fall Down                    3:08\n27. You Don't Know                     3:07\n\n\n     DEMOS\nTracks 1 and 2 are from the &quot;demos&quot; cassette. Tracks 3-6 are of\nthe same era but in much better quality. These were sourced\nfrom clean vinyl and processed to remove stray ticks and pops.\nThey have never appeared on CD and as such are a major find.\n\nTrack 3 is the same performance of &quot;Monkey Island&quot;, but it was\ntruncated on the LP. The differing sound quality made it\nimpractical to splice them together, and so both can be found\nhere.\n\n\n     KAZZ\nTracks 7 through 15 are the KAZZ show. These have been presented\npreviously by the Roky CD Club on &quot;Reverberation In The Round&quot;\nbut taken from a vinyl source. That tape was edited and the\nsongs out of sequence, although the processing may have been more\nsuccessful overall. (The vinyl boot may have come from cleaner\ntapes, although none seem to be in circulation.) This new version\nis intended to contrast the previous one, not to replace it. The\nspeed is correct, and digital artifacts kept to a bare minimum.\n\nHalf the enjoyment is in the DJ patter, most of which is missing\nfrom &quot;Reverberation In The Round&quot;. The announcer sounds as if he\nhad come of age in the swing band era. Presumably he despised the\ngarage rock scene but, consummate professional that he was, we\nwill never know for sure.\n\n\n\n     SESSIONS\nMuch of tracks 16 through 27 overlap with the &quot;Ortman tape&quot; heard\non &quot;High Baptismal Flow&quot;, and the quality is comparable to that.\nHowever several songs on each are not found on the other. Since\nthis tape came directly from International Artists, it is worth\npreserving in its entirety here.\n\n\n\n\n\n\n     THE CASSETTE\nWith the exception of tracks #3 through #7, all of these were\nrecovered from reference cassettes found with a stash of\nInternational Artists multitrack master tapes (as well as the\nreel-to-reel deck upon which &quot;Easter Everywhere&quot; was recorded),\npurchased at a garage sale in the Southwest in 2004.\n\nThe &quot;demos&quot; cassette features a white printed label, blank except\nfor &quot;RCA Cassette Duplicating, 8206 Westpark Dr. Houston, Texas  \n77063.&quot; One side contains the KAZZ-FM show, the other is demos\nfrom January and April 1966, some of which were later used for\nthe so-called &quot;Live&quot; album. Applause was dubbed onto them, but\nthis tape contains the original mixes (albeit in mediocre\nquality).\n\nThis CD marks the first time &quot;Everybody Needs Somebody&quot; has been\nheard without the crowd overdubs, as well as the first time this\nrendition of &quot;Monkey Island&quot; has been presented in its entirety.\n\n\n\nTitles on the demo side of the cassette are as follows: \n\n1)You Can't Hurt Me Anymore\n2)I'm Gonna Love You Too\n3)Everybody Needs Somebody\n4)Monkey Island\n5)Roller Coaster\n6)Splash 1\n7)Through The Rhythm\n8)You've Got To Take That Girl\n9)Fire Engine\n10)Miss Me\n11)Tried To Hide\n\nExcept for #3, 4, 5, 7 and 9, all of these can be found in\nbetter quality on &quot;High Baptismal Flow&quot; and &quot;Psychedelic Sounds\nAlternate Mix&quot;.\n\n#3-4 were used on this disc. The other tracks can be found\non &quot;Fire In My Bones&quot;. (Since that album has been rendered\npermanently out of print, they can be heard here as well.)\n\n\nIt is believed that this is one of a small set of reference\ncassettes that International Artists would have dubbed for the\nband members to take home. (More likely the KAZZ side had been\nblank originally, but this is believed to be a low-gen copy,\npossibly 1st gen.)\n\nThe quality is what one could expect from such sources. Cassette\nwas low-end audio in the mid-1960s, and the tapes had not been\nlovingly preserved. However, the material has been restored as\nmuch as possible, and is quite listenable for what it is. There\nmay or may not be better source tapes in existence.\n\nUntil such are released, these will serve to plug most of the few\nremaining holes in the 13th Floor Elevators' ongoing discography.\n\n\n\n\n\n\n\n\nThis CD is NOT available commercially.\nThis music is NOT for sale.\nNeither is anything else from the IA stash.\nNeither are the fans who make it available to you.\n\nWe do, however, anticipate a day when The Roky Erickson &quot;Trust&quot;\nwill be up for bids on eBay.\n\n","torrent":{"xt":"urn:btih:dfe502fc479ad02ab11a0d29fae92724a3ec15ff","amp;dn":"psych+13th+floor+eles+receive+all+u+can+hold+wav","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe502fc479ad02ab11a0d29fae92724a3ec15ff","infoHashBuffer":{"type":"Buffer","data":[223,229,2,252,71,154,208,42,177,26,13,41,250,233,39,36,163,236,21,255]},"announce":[],"urlList":[]}}