{"title":"Belly dancing basics by Laura A. Cooper","uid":3362787,"size":26981396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e04e926419501fcef8a8f3b750806cf0a5e4e093&amp;dn=Belly+dancing+basics+by+Laura+A.+Cooper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RoyalMilkTea","files":1,"time":1122666937,"description":"Format: Adobe pdf\nPages: 128\nPublisher: Sterling Publishing (April 1, 2004) \nISBN: 140271078X \n\n-Introduction -- The origins and history of belly dancing from ancient civilizations to Mata Hari to the enthusiast of today. \n-Chapter 1 Getting Started --where to dance, what to wear, and selecting music. This chapter also has an introduction to Arabic rhythms. \n-Chapter 2 Preparation -- Learning the essential, proper posture and how to stretch and warm up your body before dancing \n-Chapter 3 Basic Elements -- This is where explanations are listed for nearly thirty moves and basic steps for building a belly dance routine, from hip drops to dervish turns, and traveling steps to arm movements, plus the tips and styling to give them all spice. \n-Chapter 4 Adding Mystery -- Bringing beauty and subtlety to your dance with a veil. Wearing a veil, unveiling, and dancing with the veil are all covered here. You may just develop what the author calls &quot;veilitis,&quot; a condition impelling dancers to buy multiple veils in a variety of colors limited only by your storage space! \n-Chapter 5 Drawing on Power -- Mastering the art of sword work in your dance. Read this chapter to tap your inner warrior goddess. \n-Chapter 6 Wings -- Adding spectacular drama to your steps by the use of wings. A modern addition to Belly Dance, wings recall the majesty of ancient Egyptian royalty. \n-Chapter 7 Variety: The Spice of Life -- Introducing different props, such as candles, canes, and zills. It's `how to play with fire and not get burned' plus canes and finger cymbals. \n-Chapter 8 The Oriental Fantasy -- Performance: perfecting your art by dancing for others. Building a routine, routine/show sets, dance routine examples, costuming variety and make-up, and dancer etiquette are all covered here. \n-Resources -- Contains resources for suggested further reading, shopping abroad, costumes, classes, belly dancers, and music. \n-Index -- Easy look-up in alphabetical order.\n","torrent":{"xt":"urn:btih:e04e926419501fcef8a8f3b750806cf0a5e4e093","amp;dn":"Belly+dancing+basics+by+Laura+A.+Cooper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e04e926419501fcef8a8f3b750806cf0a5e4e093","infoHashBuffer":{"type":"Buffer","data":[224,78,146,100,25,80,31,206,248,168,243,183,80,128,108,240,165,228,224,147]},"announce":[],"urlList":[]}}