{"title":"Xpand Rally [Petersonic]","uid":3997973,"size":381991355,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e14c8a93afa2a680c3787946032ff0193a01ec97&amp;dn=Xpand+Rally+%5BPetersonic%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"petersonic","files":1,"time":1201408197,"description":"Info\n\nXpand Rally is a breathtaking game that gives you the true to life experience of driving powerful rally cars amidst photorealistic sceneries. Realistic weather effects, rolling hills, and animated scenery all add to game&amp;#039;s visual perfection. Xpand Rally also features highly detailed models of modern rally cars and handling physics developed with the help of rally sport professionals which further enhance the realism of driving experience.\n\nXpand Rally combines the best elements of Rally and Rally Cross racing in one unique gaming experience.\n\nThe game offers a career mode based on time trials during both individual races and World Championship Series which will satisfy traditional Rally fans. The Rally Cross fans won&amp;#039;t be disappointed either - they can challenge several opponents in head to head racing during competitions based on real and fictitious race events.\n\nXpand Rally, as the only title on the market, brings the economy factor into a rally game. The player starts with a junk car and competes in races to earn money and acquire upgrades, repair damage, tweak performance and pay the race entry fees.\n\nAlong with the tuning-up, the car&amp;#039;s condition affects its handling. Due to accurate damage system, it is highly dependent on the player&amp;#039;s driving skills. The physical handling model is also influenced by car parts configuration and provides both authentic feel and joy of driving.\n\nThe interactive race track surroundings with enhanced game physics and the innovative approach to changing daytime and weather conditions, both influencing the car handling, are other hallmarks of Xpand Rally that distinguish it from other racing games.\n\nFor the first time among rally games Xpand Rally includes a complete set of easy-to-use editing tools enabling to create new tracks, cars or even game mods.","torrent":{"xt":"urn:btih:e14c8a93afa2a680c3787946032ff0193a01ec97","amp;dn":"Xpand+Rally+%5BPetersonic%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e14c8a93afa2a680c3787946032ff0193a01ec97","infoHashBuffer":{"type":"Buffer","data":[225,76,138,147,175,162,166,128,195,120,121,70,3,47,240,25,58,1,236,151]},"announce":[],"urlList":[]}}