{"title":"War.World.Tatical.Combat-ALiAS","uid":3365388,"size":125021889,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e2bdeb4d1a9ffd6d1478b3459f8199c0f91be5c9&amp;dn=War.World.Tatical.Combat-ALiAS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Famine.Monk","files":7,"time":1123187097,"description":"Are you ready?\n\n  First, you take a seat in the Wave Chair. Seconds, after the Tech hooks \n  you up and gets the chair on-line, its time to take a ride.\n  As the system powers up, an electro-magnetic pulse is produced by the chair\n  and washes over you like a wave of warm sunlight on a summer morning. Your \n  eyes are closed, and as the wave of warmth flows over you, colors explode \n  across your visual cortex and you are transported into a new world of \n  amazing sensations.  What has happened is that your consciousness is \n  basically copied and pasted into the matrix of your mech, as your body \n  remains safe in the Wave Chair. This process is referred to as \n  &quot;riding the wave,&quot; or &quot;the ride.&quot;  \n\n  You open your eyes and you are now a 3-meter tall \n  (give or take a meter or two), mechanized warrior.  Your arms are the arms \n  of the mech, your legs are the legs of the mech, and all the power of the\n  many tactical systems of your mech are now extensions of your own \n  consciousness and are no longer separated from you by wires, computer \n  chips or mechanical connections of any kind. The Wave Chair creates the \n  ultimate interface between warrior and machine - you are one, but without \n  the looming threat of annihilation. If your mech goes down, your \n  consciousness is swept back to your body - unharmed. There have only ever \n  been a few cases where a consciousness was lost before it could get swept \n  back.  \n\n  That is how the warriors of War World mount up. War World's primary outlet \n  for mech on mech combat (for sport and for training), is the ACN \n  (the Arena Combat Network). There are ACN arenas located throughout \n  War World - mostly inside the protected confines of the seven city-states.\n  However, there are many arenas that are not protected by the laws of the \n  city-states, where a much fiercer and deadlier form of mech combat takes \n  place; sometimes for sport, sometimes for punishment and sometimes for \n  conflict resolution. \n                  \n                         http://www.warworld.net/\n\n\n  1. Unzip, unace and run setup.exe to install the game.\n  2. Copy over the cracked executable from /Crack/.\n  3. Unlock the game using any Serial Number you like.\n     For Online Multiplayer you will need a valid serial so buy the Game.\n\n\nAlready unpacked just for you :)\n\nIf you can't make it work its not my problem learn how to read the .nfo\n\nEnjoy.\n\nF.M.","torrent":{"xt":"urn:btih:e2bdeb4d1a9ffd6d1478b3459f8199c0f91be5c9","amp;dn":"War.World.Tatical.Combat-ALiAS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2bdeb4d1a9ffd6d1478b3459f8199c0f91be5c9","infoHashBuffer":{"type":"Buffer","data":[226,189,235,77,26,159,253,109,20,120,179,69,159,129,153,192,249,27,229,201]},"announce":[],"urlList":[]}}