{"title":"Training For Utopia - Throwing a Wrench Into The American Music","uid":3359332,"size":48770059,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e2e6a3f81fc1d1586d9c6b8f3109274b5a883a5b&amp;dn=Training+For+Utopia+-+Throwing+a+Wrench+Into+The+American+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"llyenn","files":11,"time":1122013930,"description":"Track Listing\n\n1. 50,000 Screaming TFU Fans Can't Be Wrong\n2. White Boy's Burden \t\n3. The State Of Wyoming Is Worthless\n4. Burt Reynolds Vs. Godzilla \t\n5. Tennessee Midget \n6. Everything, Including The Stars, Is Falling (Baby)\n7. New York City Is Overrated \t\n8. Dead Signal 2000 \t\n9. The Art Of Killing A Copy Machine \n10. Seeing-Eye Fruit Bat\n\nReview\n\n coming across so differently on this album, people who hated the last tfu should try this out. Although seemingly less technical, the songs are still heavy and the industrial spice gives them a fresh aspect. sure, refused stunned 1998 with their gem &quot;the shape of punk to come,&quot; and i have seen more and more electronic influence creeping into the hardcore playing field, but overall..punk is still punk. however, i've recently seen sequencers and synthesizers at hardcore shows, and here is a much more integrated training for utopia, melding their past interludes into the songs themselves.\n\nthe initial track on this disc starts with buried guitar noise and repeating samples with the message, &quot;rock and roll is the music of the devil.&quot; tension builds as the guitars rage on, exploding into a metal-hardcore-industrial mutant that rocks on like nobodies business (well, maybe like bruce cambell's business). this attack continues throughout the disc, with no regression into their old style, although they do drop a beautiful little accoustic piece into the fray with &quot;everything, including the stars, is falling (baby).&quot; all in all, this is a noisey recording that works very well...although i have a major problem with the fact that it is very stereo sensitive. better have good equipment kids, 'cause tfu went low when they tossed in the techno. thematically, i really liked that the preachy side was removed completely (even though it didn't bother me on &quot;plastic..&quot;), in favor of a sonic assault on popular culture. the screams of &quot;i can't be your everything,&quot; &quot;i'm for sale,&quot; &quot;there is everything wrong with me,&quot; and &quot;i'm gonna tear this movement down&quot; are a big departure from earlier works.\n\nanother plus is the packaging. top notch layout here, with clean design, repitition, and interesting subject matter. yet, despite the glossy pop-shine to it all, it is left of center. the line drawings were taken from an old bomber handbook, and skulls are repeated along with knifes and stars. i can't tell if it is all tongue in cheek (making fun of non-christian bands designs) or if they lost their faith, or if they just pulled the stick out of the..mud.\n\neither way, i like this album. it loses points for sounding like crap on my stereo, but it is a solid release, and probably the least preachy of tooth and nail's 1999 releases. it also includes a nice touch of humor, clever song titles, and great product design.\n\nfrom http://www.fubarm.com/reviews/training.for.utopia/tfu-throwin-a-wrench.htm","torrent":{"xt":"urn:btih:e2e6a3f81fc1d1586d9c6b8f3109274b5a883a5b","amp;dn":"Training+For+Utopia+-+Throwing+a+Wrench+Into+The+American+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2e6a3f81fc1d1586d9c6b8f3109274b5a883a5b","infoHashBuffer":{"type":"Buffer","data":[226,230,163,248,31,193,209,88,109,156,107,143,49,9,39,75,90,136,58,91]},"announce":[],"urlList":[]}}