{"title":"Macbeth 3000 Bootleg Edition","uid":4020225,"size":1463984128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e391e6a63d278d8a3816865420472c3b165fa1ed&amp;dn=Macbeth+3000+Bootleg+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"spatula007","files":2,"time":1202633942,"description":"Macbeth and Macduff were agents of the dangerous kind- America and Britain&amp;#039;s finest secret weapons. But when Macbeth and his (semi-platonic) partner Banquo are confronted by three witches who prophesize their rise to power, things become unclear as to the lines of right and wrong. With the nagging of his power-hungry wife, Macbeth is forced to take the prophecy in his own hands... but there is one small problem. Macduff has been sent on his next mission- and Macbeth is the target. As tension rises and people start dying, it only becomes too clear to the agents: only one of them is walking away from this... because this time, it&amp;#039;s personal.\n\nThe first feature-length film from the independent guerrilla-filmmakers, Supergun Cinema, is a compelling mix of comedy and action. Featuring an all-original score from Harmeet Bindra, a Bond-style car chase, real physical explosions, the ghost of a dead child-molesting government employee dancing on the table, and all the butchered Shakespeare one could ever hope to glean from life, Macbeth 3000: This time, it&amp;#039;s personal, is a thrill of a ride that will cause you to spill your wine and cheese all over the couch as you die laughing and loving too much. Two hours long, and made for around $10,000 by young teens from the Toronto area, we thank everyone who has supported this project in conception through the jam-packed screenings.\n\nThis bootleg is free to share and spread like an STD. Let the glory of Macbeth 3000 be thrust upon the world through online file sharing! TALLY HO!","torrent":{"xt":"urn:btih:e391e6a63d278d8a3816865420472c3b165fa1ed","amp;dn":"Macbeth+3000+Bootleg+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e391e6a63d278d8a3816865420472c3b165fa1ed","infoHashBuffer":{"type":"Buffer","data":[227,145,230,166,61,39,141,138,56,22,134,84,32,71,44,59,22,95,161,237]},"announce":[],"urlList":[]}}