{"title":"Operation Marketgarden - Both sides of the line","uid":3769122,"size":7615754287,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e39f435feab05e3acad8f9f302af204bf760cdbe&amp;dn=Operation+Marketgarden+-+Both+sides+of+the+line&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"=michael=","files":3,"time":1186781171,"description":"Movies : Documentary : DVD Full : English\nAudio: English \nSubtitles: Dutch / Nederlands \n\nPlot: Het eerste deel van deze DVD Box heet: \\&quot;Both sides of the lines\\&quot;. In deze documentaire word teruggekkeerd met een Duitse en een Britse soldaat. Er worden herinningen opgehaald en gedetailleerd verslag gedaan over die fatale strijd in spetember 1944 rond die zo belangrijke strijd om de brug bij Arnhem. De veteranen die eens vijanden waren vertellen ieder hun verhaal en hopen zo ieder hun verwerkingsproces te verbeteren. \n\nOp de tweede DVD staat een complete documentaire over Marker Garden. \nSeptembe 1944 - De geallieerden proberen een doorbraak te forceren om naar het Duitse Ruhrgebied op te trekken en de Duitsers zo een gevoelige klap toe te brengen. Het Britse XXX korps moest zich samenvoegen bij de Amerikaanse 101st, 82nd en de Britse Airborne divisies, die de belangrijkste bruggen tussen Eindhoven en Arnhem moesten houden. De Amerikanen deden hun werk met succes, maar de Britten stuitten op de 9e Panzer Divisie toen zij de brig probeerden veilig te stellen. De Britse verliezen waren enorn, 1130 doden en 6340 gewonden. \n\nDe Documentaire \\&quot;Operation Market Garden\\&quot; geeft een gedetailleerd beeld van de gebeurtenissen in Arnhem 1944. De politieke en militaire situatie voor de slag om Arnhem. Portretten van de soldaten en hun aanvoerders, uitleg van de gebruikte wapens, de gebruikte tactieken en een uitgebreide analyse van de gebeurtenissenin en rondom Arnhem. \n","torrent":{"xt":"urn:btih:e39f435feab05e3acad8f9f302af204bf760cdbe","amp;dn":"Operation+Marketgarden+-+Both+sides+of+the+line","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39f435feab05e3acad8f9f302af204bf760cdbe","infoHashBuffer":{"type":"Buffer","data":[227,159,67,95,234,176,94,58,202,216,249,243,2,175,32,75,247,96,205,190]},"announce":[],"urlList":[]}}