{"title":"Coast to Coast Radio Program! Commercial Free! Nov 23rd thru Nov","uid":3916362,"size":390767152,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e415bba52bc992a5cd39cad3765a94c7bc17e79d&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Nov+23rd+thru+Nov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":35,"time":1196509027,"description":"Hello again people, Stokeman here! I didn&amp;#039;t have anything to do so I thought I would upload seven more broadcasts of C2C for all you freaks out there! Dare to be different, that&amp;#039;s what I always say! I hope you all enjoy, especially you Pam! Thanks in advance to all the seeders! Later All!\n\nFriday November 23rd, 2007\nMoonlight Madness Open Lines\nDuring &amp;#039;Moonlight Madness&amp;#039; Open Lines, Bob in Monterey, CA said he has been working with a man named Ed, who uses night vision goggles to view UFOs and has witnessed them battling in the skies. Jerry shared his memories of a childhood encounter with human-ape... \nHost: George Noory\nGuest(s): Open Lines, Richard C. Hoagland, Glenn Beck\n\nSaturday November 24th, 2007\nPrivate Military Contractors\nAuthor and adventurer Robert Young Pelton discussed his latest book, Licensed to Kill: Hired Guns in the War on Terror, in which he explores the rise of military privatization in Iraq and Afghanistan, as well as in our own country. According to... \nHost: Ian Punnett\nGuest(s): Robert Young Pelton, Galen Cook\n\nSunday November 25th, 2007\nAlien Encounters\nHypnotherapist and psychotherapist Barbara Lamb discussed her study of alien abduction cases, which she came to through her work in regression therapy with clients. Abductees report &amp;#039;missing time&amp;#039; and sometimes when they are returned from a craft they&amp;#039;re... \nHost: Rollye James\nGuest(s): Barbara Lamb\n\nMonday November 26th, 2007\nThe Electric Universe: Comets &amp; Planets\nComparative mythologist Dave Talbott (thunderbolts.info) &amp; physicist specializing in plasma and electricity in space, Wallace Thornhill discussed the nature of the electric universe and its effect on comets and planets. The recent discharging of Comet... \nHost: George Noory\nGuest(s): Wallace Thornhill, David Talbott, Dave vonKleist\n\nTuesday November 27th, 2007\nThe Great Pyramid &amp; Enoch\nWriter and documentary filmmaker Ken Klein shared his research into ancient Egypt and the Great Pyramid. The Pyramid was not built as a tomb for the pharaoh Khufu as is commonly thought, but was constructed at least 600 years earlier-- around 3,000 ?... \nHost: George Noory\nGuest(s): Ken Klein, Dr. Robin Falkov\n\nWednesday November 28th, 2007\nAmerican Crises\nDuring the first three hours, columnist and television commentator Pat Buchanan discussed his new book Day of Reckoning. He outlined his belief that the &quot;perfect storm&quot; of crises are leading America to its demise. Illegal immigration is overwhelming... \nHost: George Noory\nGuest(s): Pat Buchanan, Richard C. Hoagland\n\nThursday November 29th, 2007\nWeather Wars, Prophecy, &amp; Giants\nAuthor and researcher Steve Quayle discussed his recent work on climate change and weather manipulation, and also touched on his interests in biblical prophecy, giants, and the mysterious deaths of microbiologists. There&amp;#039;s a long history of groups modifying... \nHost: George Noory\nGuest(s): Steve Quayle, Linda Moulton Howe","torrent":{"xt":"urn:btih:e415bba52bc992a5cd39cad3765a94c7bc17e79d","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Nov+23rd+thru+Nov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e415bba52bc992a5cd39cad3765a94c7bc17e79d","infoHashBuffer":{"type":"Buffer","data":[228,21,187,165,43,201,146,165,205,57,202,211,118,90,148,199,188,23,231,157]},"announce":[],"urlList":[]}}