{"title":"i am legend proper dvdscr xvid.avi","uid":4010689,"size":734877696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e44c38d36f28980af3dce43496322a4d99cc6720&amp;dn=i+am+legend+proper+dvdscr+xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mwworth","files":1,"time":1202067869,"description":"Robert Neville (Will Smith) is a brilliant scientist, but even he could not contain the terrible virus that was unstoppable, incurable...and manmade. Somehow immune, Neville is now the last human survivor in what is left of New York City...and maybe the world. But he is not alone. He is surrounded by &quot;the Infected&quot;--victims of the plague who have mutated into carnivorous beings who can only exist in the dark and who will devour or infect anyone or anything in their path. For three years, Neville has spent his days scavenging for food and supplies and faithfully sending out radio messages, desperate to find any other survivors who might be out there. All the while, the Infected lurk in the shadows, watching Neville&amp;#039;s every move, waiting for him to make a fatal mistake. Perhaps mankind&amp;#039;s last, best hope, Neville is driven by only one remaining mission: to find a way to reverse the effects of the virus using his own immune blood. But his blood is also what The Infected hunt, and Neville knows he is outnumbered and quickly running out of time. ","torrent":{"xt":"urn:btih:e44c38d36f28980af3dce43496322a4d99cc6720","amp;dn":"i+am+legend+proper+dvdscr+xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e44c38d36f28980af3dce43496322a4d99cc6720","infoHashBuffer":{"type":"Buffer","data":[228,76,56,211,111,40,152,10,243,220,228,52,150,50,42,77,153,204,103,32]},"announce":[],"urlList":[]}}