{"title":"HyperCam 2 - Cracked","uid":3782139,"size":1140414,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e44c3a34f5fda6af5446882e701c6a38b732d70e&amp;dn=HyperCam+2+-+Cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vritzy","files":1,"time":1187889068,"description":"HyperCam - Records action and sound from Windows desktop to standard AVI movie files.\n\n\nHyperCam captures the action and sound from any part of Windows desktop and saves it to standard AVI movie files. Captures cursor movements, menus selections, windows popping up and everything else you see on the screen. Correctly handles color palette changes if recording in 256 color mode. Allows you to pan the recorded area around the screen. Optionally annotates recorded movies with text. Can be also controlled remotely by Automation client software. Use in preparation of software tutorials, presentations, demonstrations etc. New features in ver. 2.10: New features to screen note allow inserting macros that will display currently pressed keys, date, time, user name and file name and path of recorded AVI movie. Perhaps the most useful of them is the display pressed keys macro that could be used in software tutorials. Bug fixes, e.g. save screen notes function did not work correctly in earlier versions 2 - the notes could not be read back without manual editing of the file.","torrent":{"xt":"urn:btih:e44c3a34f5fda6af5446882e701c6a38b732d70e","amp;dn":"HyperCam+2+-+Cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e44c3a34f5fda6af5446882e701c6a38b732d70e","infoHashBuffer":{"type":"Buffer","data":[228,76,58,52,245,253,166,175,84,70,136,46,112,28,106,56,183,50,215,14]},"announce":[],"urlList":[]}}