{"title":"Johnson.Family.Vacation.PAL.DVD-R_-_Xyric","uid":3355848,"size":3857790723,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e565c007b316febb1c2dc01e639b6cadce17b54f&amp;dn=Johnson.Family.Vacation.PAL.DVD-R_-_Xyric&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xyric","files":41,"time":1121279279,"description":" / /   _ _ __(_) ___      \n           / | | | '__| |/ __|      JOHNSON.FAMILY.VACATION.PAL.DVD-R_-_XYRIC.ISO\n         /   |_| | |  | | (__     \n        /_/___, |_|  |_|___|             2004\n             |___/                       \n                    \n                                  MOVIE INFO:\n             \nNate Johnson (Cedric the Entertainer), an insurance agent, thinks it would\nbe a great idea to take his estranged wife and three children to his family\nreunion in Missouri by car from California. Nate's motives are sincere enough:\nHe is separated from his wife, Dorothy (Vanessa Williams), who has custody of teenagers Nikki (Solange Knowles), DJ (Bow Wow) and Destiny (Gabby Soleil), and hopes the road trip will help them bond as a family and, with any luck, re-ignite that loving feeling with the mother of his children. But everything that can\ngo wrong does, even before the trip begins. Nate brings his SUV into the shop to have an 8-track tape player installed in order to listen to his old Motown classics but what he gets is something straight out of MTV's Pimp My Ride, although not even West Coast Customs would do something this gaudy. Off they go in their Burberry-outfitted low-rider Lincoln Navigator, complete with four TVs and 26-inch Spinners. Vehicle with up-to-the-minute gadgetry notwithstanding, the Johnsons encounter every clich&amp;eacute;d road trip disaster, including running out of gas and needing a pay phone. It's hard to figure out what's more trite--the journey\nto Missouri or what happens when they actually get there.       \n\n\n               RELEASE INFO:\n                \n        Since this movie didn't have any special features i did not have\n        to remove anything.Well i removed the part that said do not copy.\n        So this release has the same quality as the original =)\n               \n          P.S  I know this is a home rip, but the movie is untouched\n\n\n\n               INSTRUCTIONS:\n                 \n        1: Unpack the RAR files\n        2: Burn the ISO in Nero or Alcohol, or mount it in Daemon Tools\n        3: Watch the movie\n\n          Someone seeded for you, now do the same for others !","torrent":{"xt":"urn:btih:e565c007b316febb1c2dc01e639b6cadce17b54f","amp;dn":"Johnson.Family.Vacation.PAL.DVD-R_-_Xyric","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e565c007b316febb1c2dc01e639b6cadce17b54f","infoHashBuffer":{"type":"Buffer","data":[229,101,192,7,179,22,254,187,28,45,192,30,99,155,108,173,206,23,181,79]},"announce":[],"urlList":[]}}