{"title":"The.Cannonball.Run.(Eng).by.FaLLen_.avi","uid":3975753,"size":702968320,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e629e4286fb63f712da11c0c1cf730130b5af7a4&amp;dn=The.Cannonball.Run.%28Eng%29.by.FaLLen_.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LGLuX","files":1,"time":1200261974,"description":"title:     The Cannonball Run\nLanguage:  English\nYear:      1981\nIMDB:     &lt;a href=&quot; http://www.imdb.com/title/tt0082136/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0082136/&lt;/a&gt;\n\n\n\n\nThe Cannonball Run has been vilified by many critics over the years but I love this movie and have been watching it ever since I was little. This movie is what happens when a bunch of movie stars who just happen to be close friends in real life decide to make a movie just for fun. The plot is simple enough, race from one end of the country to the other for a million dollars and avoid the law on the way. The cast is jammed with big names and just about everyone in the movie that has a speaking part is a star of some stature. This movie is simply great fun and has a lot in common with the rest of director Hal Needham&amp;#039;s films,i.e. Smokey and the Bandit. I can&amp;#039;t really say that this film is full of great acting because the entire cast horses around through the whole movie. Jackie Chan makes his first appearance in a American movie with this film and both Hal Needham and writer Brock Yates have cameos. Don&amp;#039;t expect a lot in the way of plot or acting or effects or anything like that and just enjoy the ride. The outtakes at the end of this and Cannonball Run II are hilarious and it makes it more fun for me anyway to know that this movie was just like a big meeting of old friends. Dean Martin and Sammy Davis Jr. are great as Blake and Fenderbaum respectively. Burt Reynolds and Dom Deluise anchor this film (they&amp;#039;re the main characters)and the give and take between these two make them one of the best comedy teams I have ever seen. Bottom Line: Buy this flick, drag it out every once in a while, and have fun watching it with family or friends. A truly fun movie to watch.\n\n\nEnjoy\n\nLGLuX","torrent":{"xt":"urn:btih:e629e4286fb63f712da11c0c1cf730130b5af7a4","amp;dn":"The.Cannonball.Run.%28Eng%29.by.FaLLen_.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e629e4286fb63f712da11c0c1cf730130b5af7a4","infoHashBuffer":{"type":"Buffer","data":[230,41,228,40,111,182,63,113,45,161,28,12,28,247,48,19,11,90,247,164]},"announce":[],"urlList":[]}}