{"title":"Shocking Pinks - Shocking Pinks [2007] MP3 128kbps","uid":4003092,"size":44638337,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e69dd145f8a81d00804401eac06e28ba69028aad&amp;dn=Shocking+Pinks+-+Shocking+Pinks+%5B2007%5D+MP3+128kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dkords","files":17,"time":1201672950,"description":"Review\tby Heather Phares\n\nAs Shocking Pinks, Christchurch, New Zealand&amp;#039;s Nick Harte released three albums in two years. The first, 2004&amp;#039;s Dance the Dance Electric, got him noticed by DFA Records; Mathematical Warfare and Infinity Land were both issued by the legendary Kiwi label Flying Nun in 2005. Songs from these later albums make up Shocking Pinks, Harte&amp;#039;s DFA debut, which is unexpected, considering that Harte&amp;#039;s debut album was more eclectic and electronic -- more in keeping with the DFA&amp;#039;s previous output, in other words -- while his Flying Nun albums owe more of a debt to that label&amp;#039;s classic bands and My Bloody Valentine&amp;#039;s abrasive pop instincts. Only &quot;Cutout&quot;&amp;#039;s hypnotic groove and the moody, percussive &quot;Smokescreen&quot; hint at any dance leanings (ditto for the remixes by heavy-hitters such as Eluvium and the Glimmers on the singles leading up to Shocking Pinks&amp;#039; release). The rest of the comp shows off Harte&amp;#039;s way with love songs that are heartbroken, aloof, and even a little arrogant. &quot;This Aching Deal,&quot; &quot;End of the World,&quot; and &quot;Second Hand Girl&quot; are full of confessions and recriminations tucked safely away in blankets of distortion and tape hiss. Harte&amp;#039;s wispy voice can barely hold the emotions in his music, whether it&amp;#039;s &quot;How Am I Not Myself&quot;&amp;#039;s petulance (&quot;I&amp;#039;d rather be a retard than to be your motherfuckin&amp;#039; dad&quot;) or &quot;Girl on the Northern Line&quot;&amp;#039;s slow-motion yearning. It&amp;#039;s easy to hear why Harte&amp;#039;s band name was inspired by Pretty in Pink&amp;#039;s teen angst; he can sing &quot;fuck&quot; and sound completely innocent, or &quot;you make me feel bad&quot; like it&amp;#039;s the most romantic thing ever. Shocking Pinks&amp;#039; brittle, noisy production also harks back to the golden age of college rock in the late &amp;#039;80s and early &amp;#039;90s; in the best possible way, it often sounds like an ancient cassette that has spent years buried in the glove box. &quot;Blonde Haired Girl&quot; shows that the My Bloody Valentine that inspired Harte wasn&amp;#039;t Loveless&amp;#039; meticulous layers, but the scrappy sonic free-for-alls of Isn&amp;#039;t Anything -- the song&amp;#039;s drum rolls are right out of &quot;Feed Me with Your Kiss.&quot; Shades of Eric&amp;#039;s Trip and fellow college rock revivalists Marmoset hover around shambling, vulnerable songs like &quot;Victims,&quot; &quot;Emily,&quot; and &quot;I Want U Back.&quot; And, in classic indie fashion, Harte balances out the rough-edged but piercing beauty of some songs with others that take willful tangents, such as &quot;Yes! No!&quot; Crucially, though, it doesn&amp;#039;t feel like Harte is mimicking his influences so much as finding his own ways of embodying them. Even if it tends to portray Harte as a more straightforward artist than he actually is, Shocking Pinks is an intriguing introduction for listeners who want to catch up with his ever-growing body of work. ","torrent":{"xt":"urn:btih:e69dd145f8a81d00804401eac06e28ba69028aad","amp;dn":"Shocking+Pinks+-+Shocking+Pinks+%5B2007%5D+MP3+128kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e69dd145f8a81d00804401eac06e28ba69028aad","infoHashBuffer":{"type":"Buffer","data":[230,157,209,69,248,168,29,0,128,68,1,234,192,110,40,186,105,2,138,173]},"announce":[],"urlList":[]}}