{"title":"Destiny's End","uid":3918941,"size":241343515,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e81a8bc26aecf55e0048d161e3bf585c4d105f25&amp;dn=Destiny%5C%27s+End&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UrlikSkarsol","files":21,"time":1196665424,"description":"Destiny&amp;#039;s End Discography - Oh no! Not ANOTHER James Rivera Band!\n\n&quot;Boys and girls, raise your hands if you HAVEN&amp;#039;T heard of James Rivera.&quot;\n\nSeriously, who doesn&amp;#039;t know at least one of the 692 different bands this guy has been in (only a slight exaggeration)? From his beginnings in Helstar to his most recent ass-kickery in Vicious Rumors, James Rivera has been screaming ear-shattering screams for 20+ years, in 20 or more different bands, all of which have been at least &quot;good&quot;. Not all of them have been THIS good, but the guy has never been on a bad album, even with the bands that only made one. If only he could have stayed with THIS one!  This is a band that should have made TEN albums, not just the paltry two I offer you today.\n\nLet me just get this out of the way: Destiny&amp;#039;s End&amp;#039;s two albums are some of my favorite music by ANY band. I am not even remotely objective about their merits. This is some of the best metal I have ever heard. The guitar work is incredible; not so much the lead work, but the incredibly complex riffs that drive the songs. The drumming is not just some of the most furious double bass I&amp;#039;ve ever heard, it&amp;#039;s produced so well that it really is teeth-rattling, especially if you listen to it in a car where the sound can really envelop you. The vocals? It&amp;#039;s James Rivera - they are godly. Rivera makes full use of his range without seeming to show off; the melodies are subtle and powerful, and the vocal production is good (Rivera sometimes sounds a bit thin on recordings).  \n\nSo given that I have no objectivity at all about these albums, what do other people say?:\n\nFrom Encyclopedia Metalium review of Breathe Deep The Dark (98/100): &quot;What Destiny?s End do, they do very well, and that is playing 80?s inspired Speed/Power Metal with a very high degree of musicianship and song writing. Most of the songs take on the moniker of being fast and technical, however, to make things interesting Destiny?s End offers us progressive build-up and some mid-paced tracks as well. Some might prefer a little more variation, but when you play this good fast, why bother to slow down for extended periods? The riffs definitely have that Helstar feel and are very well played, not to mention the leads, which are another highlight. Both Perry Grayson and Dan DeLucie provide us with these leads, which always seem to come at the right time and they also partake in lead battles, which are rather exciting. A lot of harmonization is present as well, often making Destiny?s End sound like Iron Maiden on crack. Those of you familiar with Helstar will instantly recognize Rivera, as he sounds pretty much the same way he did in the 80?s. I know there are some of you who don?t like his vocals, but I think they?re top notch and give Destiny?s End the proper amount of aggression and melody to accompany the music.  I?m not sure if this was done purposely or not, but the production job sounds very 80?s... in a good way. Nothing is over done, the bass is clear, the drums are powerful but do not sound fake, and guitars are distorted and heavy, but not muddy? perfect if you ask me. The lyrics are also very good, not that it matters to some of you. Most songs take a psychological stand point on a particular topic, such as death on ?Where Do We Go?? while others portray money driven religions, as found on ?Sinister Deity?. Also, there seems to be a slight middle-eastern sound to some riffs, intentional or not, it adds an interesting atmosphere when used. I?ve listened to this CD many times over the last year or so and I can?t find any major faults, I like every song a lot, but some more than others. While I don?t dislike current Power Metal bands, or the current wave of Gothenburg inspired bands, there is always something to be said for Metal like this. One way to put it is that they don?t make Metal like this anymore, hehe. Truthfully, this is the kind of stuff that, for me at least, puts a smile on my face and forces me to head bang whether I want to or not, so fans of no-frills 80?s Power/Speed Metal, check these guys out, I hope you won?t be disappointed.\n\nFrom Metal-Rules review of Breathe Deep The Dark (4.5/5): &quot;Lyrically, the songs are rather deep, dealing with subject matter such as reincarnation, the purpose of existence, and ascension to power. Steeped in imagery and metaphor, the thought- provoking and poetic words of Destiny&amp;#039;s End, made all the more memorable when delivered by a vocalist as powerful as Rivera, will certainly leave the listener with much food for thought. Not since Sanctuary&amp;#039;s 1990 masterpiece Into the Mirror Black have I heard such an exemplary blending of aggression, melody, and philosophy. It&amp;#039;s music that&amp;#039;s guaranteed to appeal to the tastes of angry intellectuals. &quot;\n\nSo it&amp;#039;s not just me that thinks this band was great.\n\nWhile I quite like Riveras&amp;#039; most recent work on Vicious Rumors Warball album (if you don&amp;#039;t have it, you should check that out as well-maybe I&amp;#039;ll post a VR discography), these albums are MUCH better.  In fact, these albums are better than almost any power/traditional metal I have heard in the last several years, rivalling anything by Blind Guardian (at whichever point in their career you like most), Nevermore, Iced Earth (Barlow version or Ripper version) or anyone else. In style, these albums are darker and moodier than most anything Rivera has done, actually reminding me of Nevermore quite a bit, and even more so of Warrel Dane&amp;#039;s earlier band Sanctuary,  particularly in the furiousness of the drumming and the complexity of the material.  You owe it yourself to hear these if you have not.\n\nThis torrent include:\n\nBreathe Deep The Dark @ 320\nTransiton @ 320 (my rip)\n\nThere are two things to say to sum this up:\n1. download this RIGHT NOW!\n2. After listening, mourn the sad loss to all of us in the split of this brilliant team of musicians!\n\nBang it &amp;#039;til it bleeds!","torrent":{"xt":"urn:btih:e81a8bc26aecf55e0048d161e3bf585c4d105f25","amp;dn":"Destiny%5C%27s+End","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e81a8bc26aecf55e0048d161e3bf585c4d105f25","infoHashBuffer":{"type":"Buffer","data":[232,26,139,194,106,236,245,94,0,72,209,97,227,191,88,92,77,16,95,37]},"announce":[],"urlList":[]}}