{"title":"Child Benefit Lost Records","uid":3903469,"size":729235303,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e86b5cb36a4b27d0d8997f806f487d2c50b30493&amp;dn=Child+Benefit+Lost+Records&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flampard8","files":1,"time":1195691282,"description":"This is what happens when child related government records in the uk are lost...the result ends up on the net.\n &lt;a href=&quot;\nhttp://news.bbc.co.uk/1/hi/uk_politics/7106366.stm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://news.bbc.co.uk/1/hi/uk_politics/7106366.stm&lt;/a&gt;\n\nThis torrent contains all the info/data you need.\n\n\nQ&amp;A: Child benefit records lost\nHow worried should people be by the loss of discs containing child benefit recipients&amp;#039; personal details?\n\nWhat has happened?\n\nHM Revenue and Customs has lost computer discs containing the entire child benefit records, including the personal details of 25 million people - covering 7.25 million families overall. The two discs contain the names, addresses, dates of birth and bank account details of people who received child benefit. They also include National Insurance numbers.\n\nHow were the discs lost?\n\nThey were sent in normal internal mail from HMRC in Newcastle to the National Audit Office in London on 18 October, by someone at a low level, and never arrived, Chancellor Alistair Darling said. That broke data protection laws and is the reason Revenue and Customs chairman Paul Gray has resigned.\n\nWhat is the government saying?\n\nMr Darling called the loss &quot;catastrophic&quot;, apologising &quot;unreservedly&quot; and adding that ministers still did not know the whereabouts of the disks. He told the BBC &quot;there were procedures there, which should have prevented this from ever happening in the first place&quot; but that they &quot;appear to have been breached&quot;. People were &quot;entitled to trust&quot; the government to look after data but &quot;that did not happen here&quot;, Mr Darling said.\n\nWhat is being done to find the discs?\n\nThe Metropolitan Police, National Audit Office, Revenue and Customs staff and courier firm TNT have all been searching for the discs.\n\nHow worried should people be?\n\nThe details on the lost discs would be sought after by fraudsters. Mr Darling says the information was password protected, but that was not good enough. He said there was no suggestion that anything untoward had happened as a result of the discs&amp;#039; loss to date. Experts say such data should normally be sent in encrypted form.\nAnalysis: How worried should we be?\n\nHow could the information be misused?\n\nBanks say the information on its own would not be enough to allow someone access to your bank account, as other security information and passwords should be required. But the details would be enough for criminals to use in other types of fraud, such as setting up credit or financial agreements like mobile phone accounts. There may also be child protection concerns, as the discs contained names, addresses and dates of birth of children.\n\nWhat are people advised to do?\n\n    *\n    * Mr Darling said people should check their bank accounts for any &quot;irregular activity&quot;\n    * He said there was no need for people to close accounts as the details would not be sufficient to allow fraudsters to access them\n    * But people should not give out personal or account details &quot;requested unexpectedly&quot; by phone or by email\n    * Banking industry body Apacs advised people who bank online to monitor accounts and change passwords if they are a child&amp;#039;s name or date of birth\n    * Contact your bank immediately, but only if you spot something suspicious as banks are expecting to be overwhelmed with calls\n      Banks also warn customers to be on the lookout for signs of ID theft and fraud - such as regular post like bank statements going missing, bills for items you have not bought, or letters approving or denying you credit you know nothing about\n\nIs my money safe?\n\nMr Darling said there was no evidence of fraud or that the details had fallen into the &quot;wrong hands&quot;, but said that anyone who loses money as a result of fraud resulting from the lost discs would be reimbursed. But he said there was no need for anyone to close their bank accounts.\n\nHow can I find out more?\n\nHer Majesty&amp;#039;s Revenue and Customs has set up a Child Benefit Helpline on 0845 302 1444 for customers who want more details.\n\nWhat has been the political reaction?\n\nPrime Minister Gordon Brown has apologised for any inconvenience and worry caused. David Cameron says the government has failed in its duty to protect citizens. Lib Dem acting leader Vince Cable questioned whether the buck should stop with Mr Gray or whether ministers should share blame. ","torrent":{"xt":"urn:btih:e86b5cb36a4b27d0d8997f806f487d2c50b30493","amp;dn":"Child+Benefit+Lost+Records","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e86b5cb36a4b27d0d8997f806f487d2c50b30493","infoHashBuffer":{"type":"Buffer","data":[232,107,92,179,106,75,39,208,216,153,127,128,111,72,125,44,80,179,4,147]},"announce":[],"urlList":[]}}