{"title":"Collected clips about Halabja in Kurdistan","uid":3783332,"size":777378890,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e8af362b9aea10749a74029bdf49b7db58437acb&amp;dn=Collected+clips+about+Halabja+in+Kurdistan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gurgin_kurd","files":25,"time":1187992101,"description":"The Halabja poison gas attack occurred in the period 15 March?19 March 1988 during the Iran-Iraq War when chemical weapons were used by the Iraqi government forces and a number of civilians in the Iraqi Kurdish town of Halabja (population 80,000).\n\nIt was an event that is historically separate from the al-Anfal Campaign but related in that Kurdish civilians were caught up in the fighting and their numbers are often included in accounting the deaths attributable to Saddam Hussein&amp;#039;s regime as part of the Anfal campaign. Estimates of casualties in this attack range from several hundred to 5,000 people. Halabja is located about 150 miles northeast of Baghdad and 8-10 miles from the Iranian border.\n\n\n\n\n\n\n\nAlmost all current accounts of the incident regard Iraq as the party responsible for the gas attack, which occurred during the Iran-Iraq War. The war between Iran and Iraq was in its eighth year when, on March 16 and March 17, 1988, Iraq dropped poison gas on the Kurdish city of Halabja, then held by Iranian troops and Iraqi Kurdish peshmerga guerrillas then allied with Tehran (throughout the war, Iran had supplied the Iraqi Kurdish rebels with safe haven and other military support).\n\nThe poison gas attack on the Iraqi town of Halabja, which was defined as an act of genocide by Human Rights Watch, was the largest-scale chemical weapons (CW) attack against a civilian population in modern times. It began early in the evening of March 16, when a group of eight aircraft began dropping chemical bombs, and the chemical bombardment continued all night. The Halabja attack involved multiple chemical agents, including mustard gas, and the nerve agents sarin, tabun and VX. Some sources have also pointed to the blood agent hydrogen cyanide.\n\nA survivor described the attack: &quot;I got some gas in my eyes and had trouble breathing. You always wanted to vomit and when you did, the vomit was green.&quot; He said he passed &quot;hundreds&quot; of dead bodies. Those around him died in a number of ways, suggesting a combination of toxic chemicals. Some &quot;just dropped dead&quot; while others &quot;died of laughing.&quot; Still others took a few minutes to die, first &quot;burning and blistering&quot; or &quot;coughing up green vomit.&quot;","torrent":{"xt":"urn:btih:e8af362b9aea10749a74029bdf49b7db58437acb","amp;dn":"Collected+clips+about+Halabja+in+Kurdistan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8af362b9aea10749a74029bdf49b7db58437acb","infoHashBuffer":{"type":"Buffer","data":[232,175,54,43,154,234,16,116,154,116,2,155,223,73,183,219,88,67,122,203]},"announce":[],"urlList":[]}}