{"title":"East-Tec Backup 2007 v1.2.1.2 Cracked WinAll-BRD","uid":3776576,"size":5764047,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e8c4e7b78a6e181d4901a4c35be2ac57a493bcb1&amp;dn=East-Tec+Backup+2007+v1.2.1.2+Cracked+WinAll-BRD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1187394721,"description":"Yet another backup program. This time it?s East-Tec Backup 2007 released by BRD. East-Tec Backup 2007 backs up and protects the files and data you care about (files, folders, documents, emails, photos, address book, and settings from your favorite programs such as Internet Explorer, Mozilla Firefox, Microsoft Outlook and Outlook Express, and more). It is very easy to use and features intuitive wizards, automatic backups (with built-in scheduling), data compression (using the widely popular ZIP open format, a non-proprietary format, giving you full control over your backup), strong military AES encryption (adopted as an encryption standard by the US government), the ability to backup to any media (hard disks, CDs/DVDs, USB sticks, network or Internet locations), data synchronization (for example you can synchronize data between two computers), FTP support (with upload auto-resuming supported), a version control mechanism that allows backing up only changed files, and more. Other features include backing up without the need to close running programs, file filtering (include or exclude certain file types from your backup), the ability to run programs/commands before or after the backup, and detailed backup logs and email notifications.\n\nWorks with:\n\n    * Email and settings from Microsoft Outlook, Microsoft Outlook Express, Mozilla Thunderbird, Eudora, etc.\n    * Internet Explorer Settings and Favorites\n    * Mozilla Firefox Settings and Bookmarks\n    * Opera Settings and Bookmarks\n    * Windows Settings: Appearance, Internet Connection, Power Settings, Advanced Settings, etc.\n    * Windows Address Book\n    * Windows Registry\n\n?and more!\n\nNew in this release:\n\n    * Vista-ready: the new version is compatible with the Windows Vista operating system\n    * Data synchronization: for example, you can synchronize data between two computers\n    * New plug-ins: backup the user settings of more programs from your computer\n\nSystem requirements:\n\n    * Operating systems: Windows Vista, Windows XP, Windows Server 2003, Windows 2000, Windows NT, Windows Me, Windows 98.\n    * 300 MHz or higher processor\n    * 128 MB of RAM\n    * 10 MB of hard disk space\n","torrent":{"xt":"urn:btih:e8c4e7b78a6e181d4901a4c35be2ac57a493bcb1","amp;dn":"East-Tec+Backup+2007+v1.2.1.2+Cracked+WinAll-BRD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8c4e7b78a6e181d4901a4c35be2ac57a493bcb1","infoHashBuffer":{"type":"Buffer","data":[232,196,231,183,138,110,24,29,73,1,164,195,91,226,172,87,164,147,188,177]},"announce":[],"urlList":[]}}