{"title":"PSP-MP4 Mobile Shaun of the Dead","uid":3350363,"size":449282176,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:e9b3e62c5657c88beea88b28fe7b100aac37e8b9&amp;dn=PSP-MP4+Mobile+Shaun+of+the+Dead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Aurtach","files":3,"time":1120106119,"description":"Formatted for your PSP or other mobile gadget that handles MP4 format.  Included is a custom Shaun of the Dead wallpaper for your PSP and a matching custom thumbnail.\n\nConnect your PSP with PC, and copy the two files with the name M4V06660 (the large on is the move file and the smaller one is the thumbnail.  Both are needed for your PSP to play it) into &quot;H:MP_ROOT100MNV01&quot; (where &quot;H&quot; is the drive letter of your PSP)\n\nPlot:\nShaun (Simon Pegg) is your below average thirtysomething who seems to have no real goal in life. Lacking any real ambition, he drives his long-suffering girlfriend Liz (Kate Ashfield) around the bend. He seems to pay more attention to his fellow loser pals and housemates Ed (Nick Frost)and Pete (Peter Serafinowicz). Shaun is otherwise a decent enough sort. He soon realises how much Liz means to him when the dead begin to walk the earth. Now it's a race against time for Shaun to spring to the rescue not just of the girl he loves, but of his dear sweet Mum as well. After watching this you'll never look at &quot;Dawn of the Dead&quot; the same way again.\n\nIMDB Rating: 7.9/10\n\nShout out to Active666 and the others out there bringing the good shit to the handhelds.\n\nEnjoy","torrent":{"xt":"urn:btih:e9b3e62c5657c88beea88b28fe7b100aac37e8b9","amp;dn":"PSP-MP4+Mobile+Shaun+of+the+Dead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b3e62c5657c88beea88b28fe7b100aac37e8b9","infoHashBuffer":{"type":"Buffer","data":[233,179,230,44,86,87,200,139,238,168,139,40,254,123,16,10,172,55,232,185]},"announce":[],"urlList":[]}}