{"title":"Arthur And The Invisibles.avi","uid":3991704,"size":844316546,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e9c484ae3d79858df784d10dfda5850e417a3392&amp;dn=Arthur+And+The+Invisibles.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pcconsultant2007","files":1,"time":1201075826,"description":"First released in France, Luc Besson\\&amp;#039;s Arthur and the Invisibles is a touching computer animated adventure that makes up in look and in character for what it lacks in narrative originality. As a direct hybrid of Excalibur and A Bug\\&amp;#039;s Life, Arthur stars a heroic ten year-old, Arthur (Freddie Highmore), who draws a sword from a stone to fight a miniature battle in the garden before finding treasure valuable enough to save his grandfather\\&amp;#039;s farm from purchase by developers. Arthur\\&amp;#039;s grandfather, Archibald, having long ago discovered the miniscule world of Minimoys, garden gnome-like elves that lived in his yard, shrunk himself in order to hunt elusive rubies that were hidden in their evil Mecropolis, headed by Maltazard (David Bowie). Now Arthur must assist the benevolent Minimoy clan, ruled by The King (Robert De Niro) and Princess Selenia (Madonna), in challenging Maltazard for possession of the jewels. Shots taking the viewer down through grass blades into the microscopic, yet gigantic yard world readjust one\\&amp;#039;s sense of size, as do scenes, for example, in which a small, elven Arthur fights mosquitoes with catapulted tomatoes. Meanwhile, live action scenes of Arthur\\&amp;#039;s worried grandmother (Mia Farrow) provide respite from a completely computerized world. Bowie, as he did in Legend, steals the show, bringing to life his Darth Vader-like character who chose evil over good in a past adventure. Corny one-liners sometimes spoil the mood, but overall the film\\&amp;#039;s thematic blend of fantasy and environmentalism, like Princess Mononoke, will delight children with its positive message.","torrent":{"xt":"urn:btih:e9c484ae3d79858df784d10dfda5850e417a3392","amp;dn":"Arthur+And+The+Invisibles.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9c484ae3d79858df784d10dfda5850e417a3392","infoHashBuffer":{"type":"Buffer","data":[233,196,132,174,61,121,133,141,247,132,209,13,253,165,133,14,65,122,51,146]},"announce":[],"urlList":[]}}