{"title":"A Night in Casablanca (Marx Brothers)","uid":3997646,"size":4461586432,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ea20eb2aae7361e7b68a07417bffbcc47ee0f80d&amp;dn=A+Night+in+Casablanca+%28Marx+Brothers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"silvia-","files":22,"time":1201392950,"description":"A NIGHT IN CASABLANCA, 1946\n\n[img]http://www.edwardsamuels.com/illustratedstory/chapter%209/casablancaclr.jpg[/img]\n\nDirector Archie Mayo \nCast Groucho Marx, Harpo Marx, Chico Marx, Charles Drake, Lois Collier, Sig Ruman, Lisette Verea, Lewis L. Russell, Dan Seymour \nLength 85 min \nDistributor Manga Films \nDVD5 \nRegion 2 \nVideo Pal\n1.33:1, 4:3 \nLanguages Mono: English, Spanish \nSubtitles Spanish \n\nSynopsis\n\nAfter a five-year absence, the Marx Brothers returned to the screen in the independently-produced effort A Night in Casablanca. Originally conceived as a parody of Casablanca (with character names like &quot;Humphrey Bogus&quot; and &quot;Lowen Behold&quot;), the film emerged as a spoof of wartime melodramas in general. Someone has been methodically murdering the managers of the Hotel Casablanca, and that someone is escaped Nazi war criminal Heinrich Stubel (Sig Ruman). Disguised as a Count Pfefferman, Stubel intends to reclaim the stolen art treasures that he&amp;#039;s hidden in a secret room somewhere in the hotel, and the only way he can do this undetected is by bumping off the managers and taking over the hotel himself. The newest manager of Hotel Casablanca is former motel proprietor Ronald Kornblow (Groucho Marx), who, blissfully unaware that he&amp;#039;s been hired only because no one else will take the job, immediately takes charge in his own inimitably inept fashion. Corbacchio (Chico Marx), owner of the Yellow Camel company, appoints himself as Kornblow&amp;#039;s bodyguard, aided and abetted by Stubel&amp;#039;s mute valet Rusty (Harpo Marx). In his efforts to kill Kornblow, Stubel dispatches femme fatale Beatrice Reiner (Lisette Verea) to romance the lecherous manager, leading to a hilarious recreation of a key comedy sequence in the Marxes&amp;#039; earlier A Day at the Races. Arrested on a trumped-up charge, Kornblow, Corbacchio and Rusty escape in time to foil Stubel and his stooges. As in most Marx Brothers epics, A Night in Casablanca includes a tiresome romantic subplot, this time involving disgraced French flyer (Pierre) and his faithful sweetheart Annette (Lois Collier). Though hampered by listless direction and witless one-liners, A Night in Casablanca contains enough hilarity to compensate for its many flaws; some of the best visual gags were conceived by an uncredited Frank Tashlin, including Harpo&amp;#039;s legendary &quot;holding up the building&quot; bit. Hal Erickson, All Movie Guide \n\nOther features\nInteractive Menus, Scene Selection, Film Credits, Filmographies","torrent":{"xt":"urn:btih:ea20eb2aae7361e7b68a07417bffbcc47ee0f80d","amp;dn":"A+Night+in+Casablanca+%28Marx+Brothers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea20eb2aae7361e7b68a07417bffbcc47ee0f80d","infoHashBuffer":{"type":"Buffer","data":[234,32,235,42,174,115,97,231,182,138,7,65,123,255,188,196,126,224,248,13]},"announce":[],"urlList":[]}}