{"title":"Forensic and Anatomic Dissections of the Human Brain and Heart b","uid":4011341,"size":800734142,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ea2b444f2692c0831abdc00b82d4e8a6f52e1a4e&amp;dn=Forensic+and+Anatomic+Dissections+of+the+Human+Brain+and+Heart+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"funnyguy1234","files":65,"time":1202109321,"description":"Forensic and Anatomic Dissections of the Human Brain and Heart by Professor Anil Aggrawal, MAMC, New Delhi, India\n\nProfessor P. Sampath Kumar of Sri Ramachandra Medical College and Research Institute, Porur, Chennai conducted the Third Annual Conference of the Medico Legal Society of Tamil Nadu, at Sri Ramachandra Medical College and Research Institute on 25th and 26th August, 2006.\n\nProfessor Anil Aggrawal, a noted forensic pathologist from New Delhi was invited to this conference as a resource person, where he showed live dissections of human brain and heart. The focus was on anatomical and forensic aspects of the human brain and heart. The dissections were shown live to an audience of about 1000 medical experts, through video conferencing. Several forensic pathologists, anatomists, neurologists, neurosurgeons, cardiologists and cardiac surgeons attended this dissection.\n\nThe video CDs have been acquired through much efforts and are distributed only in the general interest of medical community. The CD includes not only dissections but handouts in *.doc format and several still pictures with captions which further enhance the value of these dissections.\n\nThe files are big, and those intending to download them must contend with some caveats. Some of the brains shown in the dissections are not well preserved and have softened from inside, compromising the number of structures which Professor Aggrawal could show. Furthermore since it was a live presentation, the commentaries accompanying the dissections are extempore, and are not necessarily exclusive.\n\nHaving said that, the dissections are quite useful. I particularly enjoyed the dissections of the conducting system of the heart, especially as I had never seen it before. What&amp;#039;s more, there are good illustrative still pictures accompanying the CD, with captions which further enhance the value of the CD.\n\nOverall a good fare, although I wouldn&amp;#039;t say they are as good as similar brain dissections by Lennart Heimer. Heart dissections are however quite exclusive. I haven&amp;#039;t seen any similar heart dissections anywhere else.\n","torrent":{"xt":"urn:btih:ea2b444f2692c0831abdc00b82d4e8a6f52e1a4e","amp;dn":"Forensic+and+Anatomic+Dissections+of+the+Human+Brain+and+Heart+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea2b444f2692c0831abdc00b82d4e8a6f52e1a4e","infoHashBuffer":{"type":"Buffer","data":[234,43,68,79,38,146,192,131,26,189,192,11,130,212,232,166,245,46,26,78]},"announce":[],"urlList":[]}}