{"title":"Im Sorry Ill Read That Again - The Curse of the Flying Wombat","uid":3923344,"size":298928602,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ea81271a59f55a6772714f681454e05a11f59133&amp;dn=Im+Sorry+Ill+Read+That+Again+-+The+Curse+of+the+Flying+Wombat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"leftofcentre","files":13,"time":1196939463,"description":"I&amp;#039;m Sorry I&amp;#039;ll Read That Again \nThe Curse of the Flying Wombat all 13 episodes\n\nBitrate 128 kb/s Codec mpga\n\n**I&amp;#039;m Sorry I&amp;#039;ll Read That Again (1964-1973)**\n\nBilled as &amp;#039;Radio Prune,&amp;#039; this show starred John Cleese, Greame Garden, Tim Brooke-Taylor, Bill \nOddie, Jo Kendall and David Hatch \n\nIrreverant sketch humor, post-Goon Show, pre-Monty Python. The show brought to the air silly voices, \nearly shades of Python humor, mildly smutty jokes, purposely awful puns (light-heartedly booing a \npurposely bad pun would become as much a part of the show&amp;#039;s audience participation as laughing at \nthe funnier jokes). It was totally anarchic for the times. \n\nThe show shines soley because of the talents of those present. John Cleese would later become one \nof the founding members of Monty Python&amp;#039;s Flying Circus, also famous for the BBC-TV program Fawlty \nTowers, and is undoubtedly one of the best comedy writers and performers ever. Bill Oddie and \nGreame Garden were regular performers on the show, and wrote the scripts with contributions from \nthe others. (Python-to-be Eric Idle is also sometimes mentioned in the writing credits.) Garden and \nOddie along with Tim Brooke-Taylor would later form &amp;#039;The Goodies&amp;#039; for BBC-TV. David Hatch was \nanother regular on the show. He has gone on to become Managing Director of the BBC Network Radio.\n\nEpisodes during 1966-68 tend to have a fun, brilliant, Python-esque quality; including the &amp;#039;Curse \nOf The Flying Wombat&amp;#039; serial which is split up into 13 parts of the 1966 season. As more time \npassed though, the joke writing very gradually appears to become lazier in the 1969-73 seasons, \nand in retrospect those later episodes suffer and seem somewhat less quick-witted. It was around \nthis time that Cleese&amp;#039;s interests turned toward the Monty Python troupe, although he did continue \nto appear in episodes of ISIRTA. In 1989, everyone reunited for the ISIRTA 25th Anniversary special \nwhich finds them once again at their best and is not to be missed.\n","torrent":{"xt":"urn:btih:ea81271a59f55a6772714f681454e05a11f59133","amp;dn":"Im+Sorry+Ill+Read+That+Again+-+The+Curse+of+the+Flying+Wombat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea81271a59f55a6772714f681454e05a11f59133","infoHashBuffer":{"type":"Buffer","data":[234,129,39,26,89,245,90,103,114,113,79,104,20,84,224,90,17,245,145,51]},"announce":[],"urlList":[]}}