{"title":"Multiple Sclerosis: Current Status and Strategies for the Future","uid":3360938,"size":21418613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebaa31eb899d27d32ff705f368781d90c3153bc1&amp;dn=Multiple+Sclerosis%3A+Current+Status+and+Strategies+for+the+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wee","files":1,"time":1122313310,"description":"439 pages in a .pdf\n\nMultiple sclerosis is a chronic and often disabling disease of the nervous system, affecting about 1 million people worldwide. Even though it has been known for over a hundred years, no cause or cure has yet been discovered-but now there is hope. New therapies have been shown to slow the disease progress in some patients, and the pace of discoveries about the cellular machinery of the brain and spinal cord has accelerated.\n\nThis book presents a comprehensive overview of multiple sclerosis today, as researchers seek to understand its processes, develop therapies that will slow or halt the disease and perhaps repair damage, offer relief for specific symptoms, and improve the abilities of MS patients to function in their daily lives.\n\nThe panel reviews existing knowledge and identifies key research questions, focusing on:\n\n    * Research strategies that have the greatest potential to understand the bio- logical mechanisms of recovery and to translate findings into specific strategies for therapy.\n    * How people adapt to MS and the research needed to improve the lives of people with MS.\n    * Management of disease symptoms (cognitive impairment, depression, spasticity, vision problems, and others). \n\n\n\nThe committee also discusses ways to build and financially support the MS research enterprise, including a look at challenges inherent in designing clinical trials. This book will be important to MS researchers, research funders, health care advocates for MS research and treatment, and interested patients and their families.","torrent":{"xt":"urn:btih:ebaa31eb899d27d32ff705f368781d90c3153bc1","amp;dn":"Multiple+Sclerosis%3A+Current+Status+and+Strategies+for+the+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebaa31eb899d27d32ff705f368781d90c3153bc1","infoHashBuffer":{"type":"Buffer","data":[235,170,49,235,137,157,39,211,47,247,5,243,104,120,29,144,195,21,59,193]},"announce":[],"urlList":[]}}