{"title":"Mindy Smith - My Holiday (2007)","uid":3928352,"size":61478112,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee1f053a69040386458a30cd2bee8182ca73d206&amp;dn=Mindy+Smith+-+My+Holiday+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"useruseruser2","files":18,"time":1197261912,"description":"WMA files\n\nTrack Listing:\n\n1. My Holiday\n2. The Christmas Song\n3. Santa Will Find You\n4. Follow the Shepherd Home\n5. What Are You Doing New Year&amp;#039;s Eve?\n6. Away in a Manger\n7. I Know the Reason\n8. Silver Bells\n9. I&amp;#039;ll Be Home for Christmas\n10. It Really Is (A Wonderful Life)\n11. Come Around\n\n\nMusic Review: Mindy Smith - My Holiday\nWritten by Big Geez\n\nWell, it looks like this particular Grinch finds himself once again reviewing a Christmas album, but that&amp;#039;s OK because it&amp;#039;s the kind I like. My Holiday, on the Vanguard label, is talented young vocalist Mindy Smith&amp;#039;s third album but her first holiday effort, and she&amp;#039;s assembled a very nice mix of traditional holiday pieces and new songs, including some of her own compositions. \n\nComing up via the Nashville route, Mindy has been performing professionally for only a few years but in addition to appearing on the Billboard charts, she&amp;#039;s beginning to build quite a reputation as one of the best singers around. In addition to her recording success, she&amp;#039;s become a frequent guest on TV shows and has also made appearances with Norah Jones, Emmylou Harris, and Alison Krauss. \n\nReturning the favor, Alison here backs up Mindy on harmony with &quot;Away In A Manger,&quot; and the two friends display an obvious affinity, making the track one of the best on the album. \n\nIt&amp;#039;s on this and other traditional holiday songs that Mindy&amp;#039;s sweet voice and straight-ahead style are shown to best advantage. &quot;Silver Bells&quot; was another enjoyable listen, as was &quot;I&amp;#039;ll Be Home For Christmas,&quot; with Mindy kicking that old chestnut up a notch or two. \n\nSpeaking of chestnuts, &quot;The Christmas Song (Chestnuts Roasting On An Open Fire),&quot; is here too, and it&amp;#039;s nicely done, but new songs are also deserving of a listen and a couple of Mindy&amp;#039;s own compositions are keepers. The title tune starts the album off by setting a soft mood, and the playful &quot;Santa Will Find You&quot; was fun, but Mindy&amp;#039;s established fans will find a real comfort level while listening to &quot;Come Around,&quot; a tune closer to her normal style.\n\n\nOverall, a good verdict on this holiday album, and an easy to make prediction that the gorgeous and talented Mindy Smith will be heard from again. \n\n","torrent":{"xt":"urn:btih:ee1f053a69040386458a30cd2bee8182ca73d206","amp;dn":"Mindy+Smith+-+My+Holiday+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee1f053a69040386458a30cd2bee8182ca73d206","infoHashBuffer":{"type":"Buffer","data":[238,31,5,58,105,4,3,134,69,138,48,205,43,238,129,130,202,115,210,6]},"announce":[],"urlList":[]}}