{"title":"Wonder Woman v1 pt2 39-110 ('50-'59)(Catseye2001) [h33t]","uid":3999099,"size":1560347821,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:ef1b4169404142ec129818b9aa7380f2a43a649b&amp;dn=Wonder+Woman+v1+pt2+39-110+%28%5C%2750-%5C%2759%29%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Catseye2001","files":73,"time":1201460379,"description":"As the title says, this is Wonder Woman v1, issues 39-110, running from 1950-1959.  \n\nSnipped from Wikipedia: Upon William Moulton Marston&amp;#039;s death in 1947, Robert Kanigher took up the writing duties on Wonder Woman. Diana was written as a less feminist character, and began to resemble other traditional American heroines. ...  During this time, Diana&amp;#039;s abilities expanded. Her earrings provided her the air she needed to breathe in outer space, and she piloted an &quot;invisible plane,&quot; (originally a propeller-driven P-40 Warhawk or P-51 Mustang, later upgraded to a jet aircraft). Her tiara was an unbreakable boomerang, and a two-way wrist radio similar to Dick Tracy&amp;#039;s was installed in one of her bracelets, allowing her to communicate with Paradise Island.\n\n... Due to a confluence of forces (amongst them the [Comics] Code and the loss of Marston as writer), Wonder Woman no longer spoke out as a strong feminist, began to moon over Steve Trevor, and, as time wore into the Silver Age, also fell for Merman and Birdman.\n\nWonder Woman experienced other significant changes from the mid-1950s throughout the 1960s. Harry G. Peter was replaced by Ross Andru and Mike Esposito in 1958 (starting with issue #98), and the character was revamped as were other characters in the Silver Age. In Diana&amp;#039;s new origin story (issue #105), it is revealed that her powers are gifts from the gods. Receiving the blessing of each deity in her crib, Diana is destined to become &quot;beautiful as Aphrodite, wise as Athena, stronger than Hercules, and swifter than Mercury&quot;. Further changes included removing all World War II references from Wonder Woman&amp;#039;s origin, changing Hippolyta&amp;#039;s hair color to blonde, giving Wonder Woman the ability to glide on air currents, and introducing the rule that Paradise Island would be destroyed if a man ever set foot on it.\n\nEnjoy, seed, etc!","torrent":{"xt":"urn:btih:ef1b4169404142ec129818b9aa7380f2a43a649b","amp;dn":"Wonder+Woman+v1+pt2+39-110+%28%5C%2750-%5C%2759%29%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef1b4169404142ec129818b9aa7380f2a43a649b","infoHashBuffer":{"type":"Buffer","data":[239,27,65,105,64,65,66,236,18,152,24,185,170,115,128,242,164,58,100,155]},"announce":[],"urlList":[]}}