{"title":"Halo PreCracked DEATH RG [www.torrentcyclone2-.tk]","uid":3979234,"size":632747225,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ef1f1503f5717397099df95fa2d7f50979a40c55&amp;dn=Halo+PreCracked+DEATH+RG+%5Bwww.torrentcyclone2-.tk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DeathByJayJay","files":1,"time":1200450947,"description":"Halo on PC remains predominantly the same as the Xbox original, albeit now benefiting from the added bonus of LAN/Internet based multiplayer support, complete with new maps, weapons and vehicles. The story behind it tells of a powerful fellowship of alien races known as the Covenant, bent on wiping out the Earth&amp;#039;s fledgling interstellar empire. Players, along with other surviving defenders of a devastated colony-world, embark on a task to lure the alien fleet away from Earth and, on the ancient ring-world Halo, begin a guerrilla war against the impending evil.\n\nThe game itself appears courtesy of an assortment of both vehicle and foot-based missions, each offering players the option to tackle them as they choose - be it storming an enemy base or taking the wheel or gunnery position in a variety of powerful vehicles. A diverse array of objectives is bestowed upon the player throughout the course of the game, such as attacking enemy outposts, raiding underground labs for advanced technology, rescuing fallen comrades, stealing alien weaponry and vehicles, and sniping at enemy forces.\n\nProbably the most anticipated element of this PC release though has to be the support for large-scale multiplayer gaming. Already a notable feature in the Xbox version, this has now been opened up to the masses and, as such, up to 16 players can now battle it out via a LAN or the Internet, in a variety of individual and team-based games such as King of the Hill, Capture the Flag, Race, Oddball, and Deathmatch.\n\nIf you&amp;#039;re a PC gamer, then you&amp;#039;ll already have been awaiting the arrival of Halo with bated breath. You&amp;#039;ll also appreciate the added precision delivered by the mouse/keyboard control method, as well as the support for high-end hardware, which allows you to play with a resolution of up to 1600 x 1200.\n\n\nSpecification\nWindows 98SE/Me/XP/2000\n\n\n    * 733 MHz processor\n\n    * 128 MB RAM\n\n    * 1.2 GB hard disk space\n\n    * 8x CD-ROM drive\n\n    * 32 MB T&amp;L capable video card\n\n    * Sound card, speakers or headphones required for audio\n\n    * 56.6 Kbps modem for online play; broadband to run a server\n\nTracker : http://tpb.tracker.thepiratebay.se:80/announce\n\n         &lt;a href=&quot; http://vip.tracker.thepiratebay.se:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://vip.tracker.thepiratebay.se:80/announce&lt;/a&gt;","torrent":{"xt":"urn:btih:ef1f1503f5717397099df95fa2d7f50979a40c55","amp;dn":"Halo+PreCracked+DEATH+RG+%5Bwww.torrentcyclone2-.tk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef1f1503f5717397099df95fa2d7f50979a40c55","infoHashBuffer":{"type":"Buffer","data":[239,31,21,3,245,113,115,151,9,157,249,95,162,215,245,9,121,164,12,85]},"announce":[],"urlList":[]}}