{"title":"Lightshine - Feeling (German Psychedelic Rock 1976)","uid":3353893,"size":70345565,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ef25c7ef49d25000520c87ded67c599d68050dd1&amp;dn=Lightshine+-+Feeling+%28German+Psychedelic+Rock+1976%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"test78","files":6,"time":1120893692,"description":"This is a most excellent album. Underground German rock with a strong leaning towards progressive, but again with a US flavour. Formed in 1974 in Emmerich. The band played over 200 concerts and originally issued this LP in two 500 pressings .After no real success the band split in 1977 leaving behind this recording. Copies sell at over the $200 mark. Thank the gods they reissued this album not so long ago :D\n\n\n\nThis group released just this one impressive album, &quot;Feeling&quot; (1973), a classic among small label releases. Unfortunately, I'm not able to give you the full names of this crew, as the sleeve only stated their forenames. (Joe - guitar, vocals ,Ulli - guitar, flute, vocals, Olli - synthesizer, Wolfgang - bass\nEgon - drums) The band was from the Emmerich area near the Dutch border, recording their obscure album in an unknown studio named Trepita-Film-Ton-Studio (whose label was also responsible for the release). It's hard to give you an accurate impression of this album because of its great variety. They obviously loved to incorporate crazy elements into their music, as illustrated by the primal screams at the beginning of &quot;Sword In The Sky&quot; and the King's laughter in &quot;King And Queen&quot;. There were also moments of great beauty: the cosmic, Ash Ra-like guitar style on &quot;Nightmare&quot; with soft vocal harmonics and synthesizer textures. &quot;Lory&quot; borrowed the bass pattern from Grieg's composition &quot;In The Hall Of The Mountain King&quot; and had gutsy, distorted guitars. The aforementioned &quot;King And Queen&quot; was a 13-minute opus, merging melancholic melodies, lyrics and dreamy instrumental parts with the sudden appearance of the insane king! The album concluded with &quot;Feeling&quot;, a kind of acid-folk composition culminating in a final frenzy. Overall, an extremely good album, well worth a listen to. Enjoy !\n\nRipped to HQ VBR\n\n\n\nTracklist:\n\n1. Sword In The Sky 4.49\n2. Lory 5.28\n3. Nightmare 10.29\n4. King And Queen 13.39\n5. Feeling 7.34","torrent":{"xt":"urn:btih:ef25c7ef49d25000520c87ded67c599d68050dd1","amp;dn":"Lightshine+-+Feeling+%28German+Psychedelic+Rock+1976%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef25c7ef49d25000520c87ded67c599d68050dd1","infoHashBuffer":{"type":"Buffer","data":[239,37,199,239,73,210,80,0,82,12,135,222,214,124,89,157,104,5,13,209]},"announce":[],"urlList":[]}}