{"title":"Eidolon Discography","uid":3937404,"size":960672173,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f08c1361cfef03764e38f834cc8e872ed72147fe&amp;dn=Eidolon+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UrlikSkarsol","files":74,"time":1197907049,"description":"The Band That Produced The Two Guys Who Rejuvenated Megadeth\n\nHail and kill, fellow &amp;#039;bangers, and prepare to pummelled by some truly rifftastic metal!\n\nFor those of you who have no idea why you should want to check this out, here it is: the Drover brothers, Glen and Shawn, are the lead guitarist and drummer who have revitalized Megadeth and made Dave Mustaine so happy that he has mostly stopped all discussion of shelving his band. Having just seen Megadeth a few months ago in San Francisco (for the 2nd time this year; I saw them in April opening for Heaven and Hell) I can tell you from firsthand observation that these guys can PLAY. I frankly would have doubted ANY guitar player could follow up Marty Friedman and Al Pitrelli in Megadeth, but Glen Drover really is THAT good.\n\nBut enough about the OTHER band the Drover brothers are in, what about THIS one?\n\nFrom BNR: &quot;Formed in 1993 by the Drover brothers Glen and Shawn, Eidolon is Canada&amp;#039;s entry in the pure metal field. This band packs a punch, solidly entrenched in the crunchy power/semi-thrash field, placing them neatly alongside bands such as Nevermore, Steel Prophet, or labelmates Jacob&amp;#039;s Dream. Though they occasionally rev up to thrash speed, most of their songs are slow to mid-paced, with the requisite crunchy riffs and impressive solos by Glen Drover, who apart from his work here also appeared on King Diamond&amp;#039;s House Of God album, also released in 2000.&quot;\n\nThis is a band that every metal guitar player should listen to, but NOT because they have the flashiest solos (they don&amp;#039;t; though Glen Drover can shred, he never makes songs into excuses for lead work). Though solos are what make guitar players famous, it&amp;#039;s the SONGS those solos are in that grab people, and that means the riffs that drive the songs have to good - and they really really are. Drover knows how to write a great crunchy riff, and furthermore, he has AWESOME guitar tone, even on the earlier albums with low production budgets. For those who don&amp;#039;t think much of the power of a great riff, think about the most memorable guitar rock moments (not just metal, ALL rock) - now,how many of those were solos? For the most part, metal guitar is about riffs, and that&amp;#039;s what pull you into the songs - it&amp;#039;s why Black Sabbath are the gods that they are, why Metallica made such an impact, etc. And Eidolon have THOSE kind of riffs.\n\nI will have to agree with many reviewers and say that the weakness of the Eidolon albums, up until the most recent, has been the vocals. While Brian Soulard and Pat Mulock really gave it a good go, vocally, it just wasn&amp;#039;t quite powerful enough to go with the crunchiness of Drover&amp;#039;s riffs. The most recent album is a whole different ball game, as it features Nils Rue from Pagan&amp;#039;s Mind on vocals, a guy who can rival almost any metal vocalist going these days. Still, in my view, (even being a vocalist myself), the vocals on the earlier albums are not a sufficient detraction to avoid listening to them. They just make you think &quot;wow, what would this have been like with a James Rivera or Ralf Scheepers or INSERT METAL VOCAL GOD NAME HERE singing&quot;.\n\nThis torrent includes:\n\nZero Hour (320Kbps, my rip)\nSeven Spirts (320/192, not my rip)\nNightmare World (320Kbps, my rip)\nHallowed Apparition (320Kbps, my rip)\nComa Nation(320Kbps, my rip)\nApostles Of Defiance (320Kbps,my rip)\nThe Parallel Otherworld (256VBR, not my rip)\n\nEnjoy, and Bang It &amp;#039;Til It Bleeds!","torrent":{"xt":"urn:btih:f08c1361cfef03764e38f834cc8e872ed72147fe","amp;dn":"Eidolon+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f08c1361cfef03764e38f834cc8e872ed72147fe","infoHashBuffer":{"type":"Buffer","data":[240,140,19,97,207,239,3,118,78,56,248,52,204,142,135,46,215,33,71,254]},"announce":[],"urlList":[]}}