{"title":"The Worst Witch Saves the Day  Jill Murphy ","uid":4002570,"size":37402670,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f0a1dc1998e8088621c6e59f9f6f3b4f28780367&amp;dn=+The+Worst+Witch+Saves+the+Day++Jill+Murphy+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"siinns","files":1,"time":1201644726,"description":"Jill Murphy is one of the most engaging writers and illustrators for children in the land. She writes with gaiety and charm about the fallibility of humans, elephants (she is responsible for the Large family), cats and trainee witches. Weakness is her forte. And wit. Long before Hogwarts, Murphy was selling millions with her Worst Witch series about Mildred, a lovable but incompetent girl who attends witch school with her equally unsuitable cat, a poor flier who crouches on the back of a broomstick in a &amp;#039;guinea-pig-like hunch&amp;#039;. This Halloween, we can light up a pumpkin to celebrate the first new book in the Worst Witch series for more than a decade.\n\nPrepare to meet Miss Granite, a new teacher with a cloud of bright orange curls and a frivolous look, addicted to knitting grey garments and with no apparent authority at all. Her pupils note that she &amp;#039;doesn&amp;#039;t look as if she could control a dead budgerigar&amp;#039;. But appearances can be deceptive and there is, frighteningly, more to Miss Granite than meets the eye.\nMildred undergoes several humiliations and consumes the evil school meals (swede and cabbage risotto) before becoming, against all expectation, a heroine. Her triumph involves (without giving the plot away) turning herself into an ant. And Murphy doesn&amp;#039;t stint in imagining how it might be to live through this metamorphosis: &amp;#039;Being an ant, she found herself fizzing with manic energy and the compulsion to start zooming about in a sort of frenzy.&amp;#039; There are terrific black-and-white illustrations throughout, particularly of the frantic ant.\n\nThis is a lovely, sparky book for confident readers (mainly girls) of 8-11 and for everyone who has ever missed a trick.\n\n1 CD. RAR.\t\t","torrent":{"xt":"urn:btih:f0a1dc1998e8088621c6e59f9f6f3b4f28780367","amp;dn":"+The+Worst+Witch+Saves+the+Day++Jill+Murphy+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0a1dc1998e8088621c6e59f9f6f3b4f28780367","infoHashBuffer":{"type":"Buffer","data":[240,161,220,25,152,232,8,134,33,198,229,159,159,111,59,79,40,120,3,103]},"announce":[],"urlList":[]}}