{"title":"Franks_MOONGATE1_01.exe","uid":3940418,"size":245076493,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f0e4c8757999292ca79f051ec7486a5f65a2a111&amp;dn=Franks_MOONGATE1_01.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vendettanet","files":1,"time":1198095469,"description":"Version 1.01\n============\n\nIf you want to create Multiplayer RPG game but don&amp;#039;t know how to program or even don&amp;#039;t care about game programming at all, simple use this Frank&amp;#039;s Moon Gate - Game Tools, with it just create amazing big adventure story, draw sprites (you can use any 2D or 3D animation generation sprites) then integrate them using the game tools (you can add background music and sound effect too).\n\nAnd the BIG GOODY is it&amp;#039;s FREE (GRATIS) no need to pay forever!\n\nJust as simple as that your game start rolling, share your game to everybody elses including to me, I like to play RPG :)\n\nWell what are you waiting for ?\n\nDownload learn how to create those sprite then start design your own big legendary RPG!\n\nDon&amp;#039;t forget you must share the game, everyone want to play it!\n\n- Frank Albert Pangajow -\n\n\nKalau kamu ingin buat permainan multiplayer RPG tanpa perlu mengetahui bahasa pemrograman apapun dan tidak diperlukan program sama sekali, maka mudahnya gunakanlah tools ini. Tugasmu hanyalah ngarang cerita hebat dan buat gambar animasinya (bisa menggunakan berbagai editor 2D/3D apa saja yang kamu miliki) dan diintegrasikan menggunakan game tools ini (bisa kamu tambahkan suara dan musik juga).\n\nDan ASIKNYA lagi, tools ini GRATIS! tidak perlu bayar selamanya!\n\nApa yang kamu tunggu ?\n\nDownload dan baca caranya maka kamu bisa segera mendesain sebuah permainan petualangan besar hasil karyamu sendiri!\n\nJangan lupa kamu harus kembali bagikan hasil karyamu tersebut kepada semua orang agar semua bisa ikutan bermain game hasil karyamu tersebut.\n\n\n\n=====================================================================================\n\nAddition on this vertion:\n\nBetter and more complete documentation plus addition of a full flegde complete game sample.\n\nTambahan pada versi ini:\n\nDokumentasi tata cara pembuatan yang lebih komplit, tambahan contoh sebuah RPG lengkap (Raja Sakti) yang dibuat menggunakan tools ini.","torrent":{"xt":"urn:btih:f0e4c8757999292ca79f051ec7486a5f65a2a111","amp;dn":"Franks_MOONGATE1_01.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0e4c8757999292ca79f051ec7486a5f65a2a111","infoHashBuffer":{"type":"Buffer","data":[240,228,200,117,121,153,41,44,167,159,5,30,199,72,106,95,101,162,161,17]},"announce":[],"urlList":[]}}