{"title":"Titan FTP Server Enterprise Edition 6.05.550","uid":3947101,"size":21665196,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f1477a5f545e0b0b69fa771d50a0d217bd522cb9&amp;dn=Titan+FTP+Server+Enterprise+Edition+6.05.550&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jokeri1971","files":5,"time":1198568104,"description":"Titan FTP Server is an enterprise class server product for storing and sharing files. With unparalleled performance and scalability, Titan serves a variety of needs from the largest enterprise to the small workgroup. The Titan FTP Server software provides an advanced feature set, giving you flexibility and control. An intuitive user interface makes Titan FTP Server easy to set up and maintain.\n\n\nFeatures: \n\nSecurity and Access Control\nSecuring the important files on your FTP server is a key issue. Titan provides security and access control features such as SSL for secure file transfers, and S/Key MD4 and MD5 password encryption, enabling or disabling of anonymous access, and the ability to permit or deny access based on IP address. Titan FTP Server also includes the ability to block FXP and PASV mode transfers.\n\nFull - Featured Events Handler\nTrigger customized actions based on specific events and conditions. Event Handlers allow the administrator to create rules that will respond dynamically to the current server state. Event Handlers can be used to send an email every time the server is started, create a custom log file for each user account, or to offload a file from the server immediately after it has been uploaded.\n\nManaged File Transfer\nFor additional details on our Managed File Transfer solutions, fill out our information request form.\n\nFor Large Enterprises\nTitan FTP Server offers unlimited user accounts (Enterprise Edition) and the controls to appropriately manage them. Bandwidth throttling and configurable maximum transfer speed allows you to customize the bandwidth given to any user or server. You can regulate the number of connections from a given IP, and block users and IPs after a configurable number of invalid commands. The control and scalability that Titan FTP Server provides offers an excellent file sharing solution for even the largest enterprises, especially when used with the WebDrive Client.\n\nFor Small Workgroups\nMuch of the advanced functionality of the Enterprise Edition is included in a more economical Personal Edtion. And with features like configurable upload/download ratios and disk quotas, you can control the way that files are shared on your system. The Personal Edition is the perfect solution for managing files in a small workgroup.\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:f1477a5f545e0b0b69fa771d50a0d217bd522cb9","amp;dn":"Titan+FTP+Server+Enterprise+Edition+6.05.550","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1477a5f545e0b0b69fa771d50a0d217bd522cb9","infoHashBuffer":{"type":"Buffer","data":[241,71,122,95,84,94,11,11,105,250,119,29,80,160,210,23,189,82,44,185]},"announce":[],"urlList":[]}}