{"title":"Switchfoot-Nothing_Is_Sound-(Advance)-2005-RNS [Rock/Alternative","uid":3369638,"size":89282486,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f18c02c0d85445260ac23cba784d3c3a706a1cde&amp;dn=Switchfoot-Nothing_Is_Sound-%28Advance%29-2005-RNS+%5BRock%2FAlternative&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"armis","files":15,"time":1124020088,"description":"ARTIST: Switchfoot\nTITLE: Nothing Is Sound\nLABEL: Columbia Records\nGENRE: Rock\nBITRATE: 233kbps avg\nPLAYTIME: 0h 51min total\nRELEASE DATE: 2005-09-13\nRIP DATE: 2005-08-13\n\nTrack List\n----------\n01. Lonely Nation                   3:45\n02. Stars                           4:20\n03. Happy Is A Yuppie Word          4:51\n04. The Shadow Proves The Sunshine  5:04\n05. Easier Than Love                4:29\n06. The Blues                       5:18\n07. The Setting Sun                 4:24\n08. Politicians                     3:28\n09. Golden                          3:36\n10. The Fatal Wound                 2:44\n11. We Are On Tonight               4:42\n12. Daisy                           4:19\n\nRelease Notes:\n\nSparrow Records/Columbia Records is set to release Nothing Is Sound, the\nfifth studio album from the multi-platinum San Diego-based rock band\nSwitchfoot, on September 13.\n\n&quot;Stars,&quot; the first single from Nothing Is Sound, is last week's #1 Most\nAdded record at Modern Rock radio.\n\nNothing Is Sound will be available as both a traditional CD and as a\nDualDisc featuring the entire album in 5.1 Surround Sound plus exclusive\nbehind-the-scenes footage of the band on-the road and in the studio.\n\nThe new Switchfoot album arrives two years after the release of the\ngroup's major label debut, the RIAA double-platinum The Beautiful\nLetdown, which yielded two Top 5 mainstream hit singles: &quot;Meant to Live&quot;\nand &quot;Dare You to Move.&quot;\n\nSince the release of The Beautiful Letdown, Switchfoot, whose\ntranscendent live performances are legendary among the group's intensely\nloyal fan base, has sold more than one million concert tickets worldwide\nwhile the group's two long-form videos, &quot;Live in San Diego&quot; and\n&quot;Switchfootage,&quot; have each been certified RIAA platinum.\n\n&quot;This record was written in back alleys and hotel rooms far from home,&quot;\nsays frontman and primary songwriter Jon Foreman, explaining the\ndifference between Nothing Is Sound and its predecessor. &quot;It's more\neclectic, less settled, with more dissonance. We've tried to capture the\nemotional ride that happens on stage and put it into the studio. Playing\nthat hard every night really stretches you, and all these diverse\nexperiences have played a key role in shaping this record.&quot;\n\nTouring nonstop behind The Beautiful Letdown, Switchfoot had no choice\nbut to write and record the bulk of the follow-up album on the road.\n&quot;We wanted to release a record this summer, and we were trying to\nfigure out when in the world we would have time to record it,&quot; Foreman\nadmits. &quot;So we took out a second set of gear, tiny drums and amps, and\nset up in the dressing room every day and got songs ready. While the\nopening bands were playing, we were in some tiny room trying to make a\nrecord.&quot;\n\nWhile this on-the-fly approach was predicated on necessity, it did have\none major benefit--enabling the band to road-test a new song in front\nof a highly vocal crowd immediately after it was finished. &quot;A lot of\ntimes you know a song is good but not how it's going to translate\nlive,&quot; Foreman points out. &quot;Something might be good in the studio, but\nyou have to change a lot of things to make it work live. These songs\nwere developed for the live show. I've heard that's how bands used to\ndo it back in the day.&quot;\n\nThus, Switchfoot fans may already be familiar with such new songs as\n&quot;Stars,&quot; the first single, &quot;Politicians,&quot; &quot;Easier Than Love,&quot; &quot;Lonely\nNation,&quot; &quot;The Shadow Proves the Sunshine,&quot; &quot;We Are One Tonight&quot; and\n&quot;Happy Is a Yuppie Word,&quot; whose title was taken from a Bob Dylan quote\nForeman happened upon, while the album title was drawn from his\nresulting lyric.\n\nThe band wound up recording parts of the album in unfamiliar locales as\nfar away as South Africa, and other parts as close to home as one can\nget--Foreman's San Diego bedroom. John Fields, who produced The\nBeautiful Letdown, oversaw the sessions and put them all together for\nNothing Is Sound. &quot;If you can combine the more-professional-sounding\nelements with the honesty of doing it yourself, those are the best\nrecords,&quot; Foreman asserts. &quot;They're honest and pure but listenable.&quot;\n\nForeman's writing was inevitably influenced by what must've felt like a\nnever-ending tour, but Nothing Is Sound is far deeper and more complex\nthan its origins might lead one to believe. &quot;For me, the past few years\nhave been an emotional and chaotic time--so many changes, so many\nstrange memories, like a dream that unfolds in the waking hours,&quot;\nForeman explains. &quot;And all of these new songs have been a diary of this\nstrange part of our journey, about the search for truth and beauty in\nuncertain times and places.\n\n&quot;The world is at a very volatile stage, with the war and how fast things\nare changing,&quot; he continues. &quot;But deeper than that, the idea that there\nis an instability within myself and humanity as a whole--that's where\nthese songs are coming from.&quot;\n\nAccording to Foreman, Nothing Is Sound marks a sort of culmination for\nSwitchfoot, which formed in 1997. &quot;I almost feel like everything we've\nbeen through as a band up till now has been like a warm-up, as though\nwe've been preparing this record for eight years,&quot; he says. &quot;The\nLetdown put us through the fire on many levels, and we've come out the\nother side more united than we've ever been. There's this urgency and\nimmediacy in the camp, like this record might be the most important\nthing we've ever done together.&quot;\n\nSpeaking of doing important things together, the band recently hosted\nits inaugural Switchfoot Bro-Am surf competition, a benefit for the\nnonprofit organization Care House, which aids homeless children and\nyoung mothers in San Diego County.\n\n\n\n\n\narmis","torrent":{"xt":"urn:btih:f18c02c0d85445260ac23cba784d3c3a706a1cde","amp;dn":"Switchfoot-Nothing_Is_Sound-%28Advance%29-2005-RNS+%5BRock%2FAlternative","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f18c02c0d85445260ac23cba784d3c3a706a1cde","infoHashBuffer":{"type":"Buffer","data":[241,140,2,192,216,84,69,38,10,194,60,186,120,77,60,58,112,106,28,222]},"announce":[],"urlList":[]}}