{"title":"Messenger Plus! Live v4.50.310 *skinning*","uid":3927315,"size":4724560,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f294fb8d114449d7d56bb9a30ce464d2c592353a&amp;dn=Messenger+Plus%21+Live+v4.50.310+%2Askinning%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rav0","files":1,"time":1197192265,"description":"Messenger Plus! Live v4.50.310 - 4.50 MiB\n\n== Release notes ==\nSingle file torrent of exact installer from official website.\n\nThe main highlight of Messenger Plus Live v4.50 is skinning. You can now change the appearance of your Messenger, rapidly and securely. All the pictures can be modified, the windows re-shaped and the elements re-colorized. Of course, skinning is only one of the many new things offered by this version. The Preferences panel has been re-designed, Script developers can now enjoy new API functions as well as a much better built-in , the Log Viewer has been completely reworked and the Contact List Clean-Up is now upgraded along with many other improvements.\n\n== Overview ==\nMessenger Plus! Live is an add-on for Windows Live Messenger which adds lots of features and extras that make your instant messenger easier, more useful or just tons more entertaining.\n &lt;a href=&quot;\nhttp://www.msgplus.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.msgplus.net/&lt;/a&gt;\n\nMessenger Plus! is freeware. Freeware is neither spyware nor shareware, just freeware. It\\&amp;#039;s 100% free to use and you can choose whether you want to install the sponsor program that comes with it or not. Why hesitate? Join millions of happy users right now!\n\n== Available languages ==\nThis version is distributed with the following languages:\nEnglish, Spanish, French, Arabic, Chinese Simplified, Chinese Traditional, Danish, Dutch, Estonian, Finnish, German, Hebrew, Hungarian, Italian, Japanese, Korean, Norwegian, Portuguese, Swedish, Thai, Turkish\n\n\n== Compatibility ==\nThe only thing needed to use Messenger Plus Live is Windows Live Messenger (the latest version of MSN Messenger) which requires Windows XP or above. Messenger Plus Live can be installed on 32 bit and 64 bit versions of Windows XP and Windows Vista.\n\nFor a version of Messenger Plus compatible with MSN/Windows Messenger 4.7 to 7.5 (Windows 98/2000 users), download Messenger Plus! 3.63.\n\n== Support information ==\nYou can visit the Help section of the official website to post in the forum, enter the chat room, or for more information about the sponsor program. &lt;a href=&quot;\nhttp://www.msgpluslive.net/help/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.msgpluslive.net/help/&lt;/a&gt;\n\n== Change log ==\nThe change log for this version is relatively large. See the full change log at  &lt;a href=&quot;\nhttp://www.msgpluslive.net/download/changelog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.msgpluslive.net/download/changelog/&lt;/a&gt;","torrent":{"xt":"urn:btih:f294fb8d114449d7d56bb9a30ce464d2c592353a","amp;dn":"Messenger+Plus%21+Live+v4.50.310+%2Askinning%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f294fb8d114449d7d56bb9a30ce464d2c592353a","infoHashBuffer":{"type":"Buffer","data":[242,148,251,141,17,68,73,215,213,107,185,163,12,228,100,210,197,146,53,58]},"announce":[],"urlList":[]}}