{"title":"Adhesion - Delphi Arrival [2006/FLAC]","uid":3911002,"size":148849154,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f29c714e50292af2f7428626549d386eb7b8b0d3&amp;dn=Adhesion+-+Delphi+Arrival+%5B2006%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"overlydiatonic","files":7,"time":1196150528,"description":"Adhesion - Delphi Arrival\n\nEvil Residence Records ER-30\nCreated: 2006 May 29-31\nReleased: 2006 May 31\nRun time: 20:38\n\n1. Logos (3:58)\n2. Isomorphism (4:21)\n3. The Oracle (3:18)\n4. Trivial Sun Surface (4:01)\n5. Pale Blue Lights (5:01)\n\nDelphi Arrival is the 12th release and ninth Album-A-Day from electronic musician and composer Adhesion. Made from May 29th-31st, 2006, this project is an experiment in combining multiple aspects of modern electronic music in an eclectic style. Ths first AAD by Adhesion since his first (It&amp;#039;s Really Hot Outside!) to not have an overarching theme of some sort. Genres like pop, IDM, breakbeat and ambient are explored with the addition of complex harmonies like 7th &amp; 9th chords. The instrumentation of this release is very electronic, with a focus on driving synths and complex percussion.\n\nLogos - IDM-oriented piece that prominently features complex hi-hat work as well as other types of high-frequency glitch-style percussion. Melodic themes are introduced and developed on two interacting synth instruments, one of which is a chiptune-style square wave.\n\nIsomorphism - Electro-vocoder-pop with emphasis on synthesized vocals. Features minor-key/pentatonic riffs, arpeggios and basslines backed by more traditional drum work. Lyrics describe a battle between different varieties of math.\n\nThe Oracle - An ambient piece, featuring ethereal pads underscored by simple yet effective sub-bass throughout and tempered glitch percussion in the middle section. The harmonies tend toward the complex, with heavy use of extended chords and the occasional chromatic progression.\n\nTrivial Sun Surface - Exploration of rhythm and structure with a breakbeat/trance setting. Begins with a polyrhythmic (4 against 3) drum &amp; synth section followed by a more traditional homophonic melody-oriented part in half tempo. Then it transforms into a monophonic rhythmic workout followed by repetition and variation of the first two sections.\n\nPale Blue Lights - Downtempo, with emphasis on the pad carrying the main chord progression, supported by low bass and relatively simple electronic drums. The middle development features complex chords in an experimental progression without a distinct tonal center. Then the piece returns to the original theme with an overlaid synth melody.\n &lt;a href=&quot;\nhttp://evilresidence.com/adhesion/delphiarrival.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://evilresidence.com/adhesion/delphiarrival.htm&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f29c714e50292af2f7428626549d386eb7b8b0d3","amp;dn":"Adhesion+-+Delphi+Arrival+%5B2006%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f29c714e50292af2f7428626549d386eb7b8b0d3","infoHashBuffer":{"type":"Buffer","data":[242,156,113,78,80,41,42,242,247,66,134,38,84,157,56,110,183,184,176,211]},"announce":[],"urlList":[]}}