{"title":"Useful programs","uid":3946138,"size":94696921,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f2dd1bd103092fc4bea179321376bb76e4ed3f2c&amp;dn=Useful+programs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":12,"time":1198491716,"description":"\n\n\n\nMediaMonkey 3.0.1.1124 RC6\n\nAudio EditorsMediaMonkey is a music manager and media jukebox for serious music collectors and iPod users. It catalogs your CDs, OGG, WMA, MPC, FLAC, APE, WAV and MP3 audio files. It looks up missing Album Art and track information via Freedb and the web, and includes an intelligent tag editor and an automated file and directory renamer to organize your music library. It includes a CD ripper, CD/DVD Burner, and audio converter for saving music, and manual or automated playlist editors for creating music mixes. Its player automatically adjusts volume levels so that you don&amp;#039;t have continually fiddle with the volume control and supports hundreds of Winamp plug-ins and visualizations; or if you prefer, it can use Winamp as the default player.It also includes portable audio device synchronization that allows you to synch tracks and play lists with devices such as the iPod and other portable audio devices.\n\nStandard FEATURES:\n- Organize music and edit tags in your audio library with a powerful, intuitive interface\n- Automatically lookup and tag Album Art and other metadata\n- Manage 50,000+ files in your music collection without bogging down\n- Play MP3s and other audio formats, and never again worry about varying volume\n- Record CDs into OGG, MP3, FLAC and WMA files\n- Convert MP3s, OGG, FLAC and WMA files into other formats with the Audio Converter\n- Create playlists and music mixes quickly and easily to suit any occasion\n- Synchronize with iPods / MP3 players effortlessly and convert tracks on-the-fly\nPlus much more...\n\nGold FEATURES:\n- Find music with advanced search functionality that digs through your collection to find tracks according to almost any criteria that you can think of. Search for Composer, Year, Beats per minute; find Lyrics, etc. and stop pulling your hair out trying to find music you know you have.\n- Customize your library by setting filters to display only Artists or Albums that match criteria that you set. For example, set a filter that causes Artists to appear in the tree only if they contain Albums that are currently available, and are of any genre other than &amp;#039;Children&amp;#039;.\n- Encode unlimited MP3s without having to manually install a new MP3 encoder (the free version of MediaMonkey includes a time-limited LAME MP3 encoder. If you&amp;#039;re so inclined, you can manually replace it with the free LAME encoder, or you can just upgrade to MediaMonkey Gold).\n- Catalog your physical CDs and use the Virtual CD feature to keep track of what CDs you own and at the same time see which subset of tracks from those CDs are copied to your hard drive. Instead of tracking your CDs and tracks separately, the virtual CD function gives you an integrated view..\n- Import and save audio tracks from Audio CDs and MP3 CDs with unprecedented flexibility using the Virtual CD. It allows you to sample tracks from various sources, select which ones you want to import, and then import and save the files in a single operation.\n- Create Previews, short samples of audio tracks, that you can use when trying to decide which audio files you want to add to your collection.\n- Use a Sleep Timer to play your music, gradually fade it over a set period of time, and then turn off your PC -- perfect for listening to tunes before you go to sleep.\n- Burn CDs at the maximum speed permitted by your hardware.\n\nAll MediaMonkey Gold Features:\n- Audio / Music Manager\n- Media Player (play MP3, OGG, WMA etc.)\n- Equalizer / DSP Effects / Volume Leveler\n- Party Mode &amp; Auto-DJ\n- CD Ripper: Encode MP3, OGG, WMA, FLAC\n- Audio Converter\n- Auto Renamer / File Organizer\n- Auto Tag Editor with Album Art Lookup\n- Find Duplicate Tracks and Missing Tags\n- Playlist Manager (auto music mixes)\n- Generate reports and statistics\n- Customization via scripts\n- iPod and MP3 Player Synchronization\n- Integrated CD/DVD Burner (Audio &amp; Data) (up to 48x) (up to 4x)\n- File Monitor (automatically updates library)\n- Advanced Searches and AutoPlaylists\n- Advanced Portable Device Synchronization with on-the-fly format conversion\n- Unlimited MP3 encoding\n- Virtual CD / Previews\n- Advanced Filters\n- Sleep Timer\n\nChanges in version 3.0:\n2704 Added Vista compatibility for CD playback\n2754 Added new themeable player (via msz files)\n2389 Added adjustable font sizes in Themes (for Media PC themes)\n2583 Added new status bar framework which conserves space\n2360 Added new client-side framework for easy installation of scripts (via mmip files)\n2399 Added lightweight db (sqlite) for improved performance and reliability\n0848 Added ability to display all fields in the Tracklist\n1856 Added podcast reader (configurable directories and podcasts)\n2253 Added My Documents in the Locations node (needs more work for Vista)\n1313 Added iTunes style browser\n2699 Added in-tracklist editing of ratings\n2524 Added Send-to email\n2366 Added the ability to add new folders via Drag and Drop\n1273 Added ability to sort the Now Playing list\n1273 Added undo capability for changes to the Now Playing list\n1988 Added Files to Edit &gt; Unlevelled tracks\n2623 Added track selection via spacebar to better comply with accessibility requirements\n0104 Added ability to see which playlists a track belongs to\n1797 Added empty winamp.exe file to install directory to facilitate winamp plugin installs\n2614 Added themeable text to better highlight Burn Wizard warnings\n1445 Added ability to burn audio across multiple Audio CDs\n2373 Added auto-conversion for CD Burning (e.g. convert Flac on the fly for an MP3 CD)\n2242 Added optional warnings to appear in burn wizard when when burn path &gt; 64 characters\n2416 Added delete original files option to burn data disc wizard (for archival purposes)\n2374 Added &amp;#039;cache files from network&amp;#039; option for safer burning of non-local files\n2521 Added ability to delete tracks in audio cd burn wizard\n2173 Added unicode support for disc burning\n2072 Added verify disc function for burning\n2371 Added much faster audio CD burning via on-the-fly track preparation and larger buffer\n1746 Added warning to prevent scanning of a directory containing the Virtual CD\n2772 Added option to add tracks to the library on conversion\n0097 Added automated volume analysis (optional)\n1330 Added Album Gain support\n0849 Added ability to edit volume leveling values\n2659 Added Micro-Monkey player upon minizing to Tray (currently &amp;#039;MediaMonkey Desk Player&amp;#039;)\n0351 Added configurable hotkeys with Global hotkey support\n2476 Added remember last node when closing\n2505 Added hibernate and sleep options to Sleep function\n2180 Added auto-generation of debug logs if MM crashes\n1448 Added AAC playback (requires Quicktime)\n0117 Added native crossfade support\n2545 Added silence removal\n2678 Added playback position is bookmarked based on Genre\n1380 Added advanced search for &amp;#039;unknown&amp;#039; fields\n2645 Added advanced search for last synched date\n1987 Added advanced search for contained in playlist\n2335 Added logical operators for quicksearch (&amp;#039; &amp;#039;=AND, &quot;&quot;=exact, &amp;#039;;&amp;#039;=OR)\n0096 Added basic logical operators for advanced search (&amp;#039;Any&amp;#039;/&amp;#039;All)\n1449 Added AAC tagging\n1545 Added improved support for classical music (help file to be updated)\n1633 Added global album art configuration settings / improved album art management\n1633 Added support for saving Album Art as folder.jpg globally\n2667 Added Album Art tagging in FLAC files\n2750 Added replay gain support for WMA tags (previously only in DB)\n2730 Added Album Art tagging in OGG files\n2773 Added linked Album Art locations to FLAC tags\n0956 Added WM9 encoding (lossless, Pro, speeach, VBR, CBR-2 Pass, etc)\n2605 Added multiple genres support to ID3 tags\n2440 Added Send-to My Documents\n2147 Added ability to import ratings from jRiver\n2655 Added synch support for iPod Gapless mode\n2231 Added auto-synch should display number of tracks being deleted\n1949 Added synchronization gives more control over auto-generated playlists\n2107 Added synchronization config allows user to define formats supported on a device\n0714 Added support for multiple Genres, Artists, Albums, CDs\n1796 Improved database is stored to Application data instead of My Music\n1627 Improved associated file types are not set to &amp;#039;MediaMonkey file&amp;#039;\n2490 Improved burn priority set to High for on-the-fly, and uses default thread priority otherwise\n2378 Improved default burn data disk format masks\n2212 Improved CD-text usability in the Audio CD wizard\n1132 Improved configuration in volume leveling screen (needs more work)\n0519 Improved Tooltips behaviour (needs more work)\n2731 Improved layout and icons\n1807 Improved Auto-tag from Amazon to better display changed tags\n2415 Improved Auto-organize with addition masks\n2664 Updated to LAME 3.97\n2737 Updated FLAC to 1.1.3\n2694 Updated Microsoft Windows Media components\n2506 Fixed MediaMonkey doesn&amp;#039;t work well in multi-monitor environments\n2377 Fixed Window Positions not persisted when application is closed\n2685 Fixed settings don&amp;#039;t persist if application is abnormally terminated\n1437 Fixed switching from Winamp back to MM player should trigger Now Playing list to appear\n2572 Fixed odbc errors when searching using Chinese characters\n2715 Fixed scanning status bar shows track prior to the one actually being scanned\n2760 Fixed MediaMonkey can add duplicate entries when a drive is switched from IDE to USB\n2643 Fixed MediaMonkey isn&amp;#039;t correctly associated with tracks in some environments\n2672 Fixed config settings can sometimes be saved to C:\\My Music\n2695 Fixed file lengths reported incorrectly when headers are incorrect (e.g. MusicMatch rips)\n2593 Fixed Audio CD is closed even if &amp;#039;Allow further writing&amp;#039; is enabled\n2575 Fixed if burner/disk fails to initialize, no error message is given\n2560 Fixed progress bar shows &amp;#039;Burning .m3u file&amp;#039; when burning a Single Data file\n2550 Fixed non-Gold user cannot click burn if CD/DVD isn&amp;#039;t inserted\n2549 Fixed Send-to disk has CD/DVD as an available option\n0210 Fixed Drag and Drop / Cut &amp; Paste disabled for virtual CD\n2460 Removed Virtual CD queue (playlists serve the same function)\n2786 Fixed newly added/converted tracks fail to trigger a refresh of the current view\n2751 Fixed leveling RVA2 ID3 tags written incorrectly\n2692 Fixed leveling RVA2 ID3 tags from Foobar not read correctly\n1421 Fixed tracklist scrolls horizontally unnecessarily in some cases\n2280 Fixed focus shifts when tracks are added/removed from the view\n0266 Fixed Location/Network node shouldn&amp;#039;t appear unless tracks are contained within\n2526 Fixed wheelmouse works backwards if configured to scroll page at a time\n2512 Fixed tray &amp;#039;restore&amp;#039; function when MM is in foreground causes &amp;#039;Now Playing&amp;#039; to become hidden\n0946 Fixed clicking a Tree shortcut sometimes cause node to display at the bottom of the window\n0700 Fixed &lt;Shift&gt;&lt;Delete&gt; should trigger permanent deletion without prompting for choice of method\n0021 Fixed empty tree nodes should not have a &amp;#039;+&amp;#039;\n0945 Fixed Now Playing transparency stops working after MediaMonkey is restored\n1127 Fixed Now Playing transparency blocks confirmation dialogs\n0905 Fixed Now Playing doesn&amp;#039;t always show the upcoming track\n2767 Fixed folder selection dialog can trigger AV, and is slow\n2489 Fixed usability issues in folder selection dialog\n2548 Fixed invalid MPP files can trigger an access violation\n2815 Fixed track never ends after switching back from party mode/full screen\n2680 Fixed playcount algorithm should only mark tracks as played when fully played\n2726 Fixed playcounts are increased when tracks are paused\n2718 Fixed MP3 input plugin introduces slight gaps\n1670 Fixed editing tag of currently playing track can lead to 5-10 seconds of repetition\n2711 Fixed player timer is stuck at zero if set to count down on a radio stream\n0124 Fixed changes in equalizer setting during playback cause audio artifacts\n2632 Fixed misc issues with MediaMonkey / Winamp integration\n2452 Fixed Auto-DJ performance issues\n2674 Fixed copy &amp; paste of autoplaylists doesn&amp;#039;t always work\n1966 Fixed duplicate detection doesn&amp;#039;t give any feedback if no duplicates are detected\n2738 Fixed faulty tags in some wave tracks cause them to always remain in unsynchronized tags\n2778 Fixed wave tags written by EAsy CD-DA extractor cannot be modified\n1765 Fixed auto-tag from Amazon generates incorrect artist info for Various Artist CDs\n2165 Fixed My Computer node infers properties of tracks that are already in the DB\n2241 Fixed multiple Album Art windows can open for a single file and retain focus incorrectly\n2696 Fixed File Monitor adds tracks in 8.3 format on FAT filesystems\n2687 Fixed volume leveling information isn&amp;#039;t read from LAME info tag\n2434 Fixed Volume leveling peak info not stored to MPC tags\n2621 Fixed auto-organize tries to organize all checked files even when no change is required\n2631 Fixed corrupted MP3 tags are read very slowly\n2499 Fixed tagging of tracks in tagging queue can cause damaged Album art\n2386 Fixed Auto-organize of large number of tracks leads to an apparent UI freeze\n2582 Fixed wording of auto-increment script\n2646 Fixed scripting bug: SDB.UI.NewEdit.ControlName = SDB.UI.NewEdit.Text\n2782 Fixed MTP synchronization: wmdm driver doesn&amp;#039;t delete empty directories\n2781 Fixed MTP synchronization: wmdm driver doesn&amp;#039;t synch album art from My Computer node\n2276 Fixed synchronization: iRiver H Series inaccurately named\n\nHomepage - http://www.mediamonkey.com\n\nSize: 6.35 MB\n\nName: CrA86\nSerial: 11112INF33334444555YJB16R6Y7\n\n\n\n\n\n\nMobile Master Corporate 7.0.1 Build 2699\n\nMiscellaneousMobile Master is a Cell phone and handset manager for Windows and synchronizes with a few mouse clicks your contacts and appointments between the handset and your computer. Edit and synchronize calendar entries (appointments and tasks).\nSend, read, archive SMS Note: the SMS Servant is included in the Mobile Master installation but requires an extra license. Logo-Editor, modify ring tone. Copy Station for transmitting your address book easily from one phone to the other. Mobile Master Agent: reach always the important functions easily and start e.g. Mobile Master automatically as soon as your mobile phone is connected to the PC.\n\n* One click synchronization solution for your mobile phone, edit all you phones data with the computer. Synchronization of contacts and the calendar, Many filter possibilities, AddIns for Outlook, Lotus Notes, Palm Desktop and Thunderbird\n* Mobile Master synchronizes or just copies all data with/to your mobile phone.\nSynchronize with: Outlook, Lotus Notes, Novell Groupwise, Palm Desktop, Thunderbird, Tobit David, Eudora, The Bat, Outlook Express, Google calendar, Windows contacts and calendar, iTunes\n* new cell phone: Mobile Master copies the phone/address book from your old to your new one regardless the manufacturer of the phones new phone number, appointment or note: type it in with your PC and send it easily to the cell phone.\n* Many import and export filters, e.g. one click to export to excel or open office. Can import e.g. vcf file with more than one contact and that has unicode format\n* Connection with the phone: serial or USB cable, infrared or Bluetooth, up to COM Port 300 supported.\n\nFeatures:\n- Mobile Master is a handset manager to edit manually or synchronize automatically or on demand\n- Quick area for quick and easy access to the main functions\n- Comfortable editing of the phone book, calendar and note items\n- easy to use user interface\n- Setup Wizard for easy configuring\n- Copy files, &gt;music, photos\n- SMS send, archive\n- Copy the address book, calendar from one phone to another\n- At least one update per month for the phones and devices\n- Copy play lists from iTunes and WinAmp to the phone\n\nSupported mobile phones and devices:\n- Apple iPod:iPod Video, iPod nano\n- LG: KG800 Chocolate, KG320S\n- Motorola: RAZR V3r, RAZR V3i, SLVR L7, SLVR L6\n- Nokia: Nokia 6233, Nokia 6270, Nokia 6280, Nokia 6230, Nokia 6230i, Nokia 6220, Nokia 6210, Nokia 6200, Nokia 6100, Nokia 6310, Nokia 6310i, Nokia 6820, Nokia 6822\n- Sony Ericsson: W880i W880 W710i W710 Z710i Z710 Z610i Z610 K800 K800i K800 W900i W900 W850i W850 W810i W810 W800i W800 W700i W700 W550i W550 W500i W500 W300i W300 D750i D750 K750i K750 K700i K700 K610i K610 K600i K600 K510i K510 K500i K500 K300i K300 F500i F500 S700i S700 T610i T610 V800i V800 V600i V600 Z600i Z600 Z550i Z550 Z520i Z520\n- Samsung: Samsung SGH-P310, Samsung SGH-P300, Samsung SGH-D900, Samsung SGH-D830, Samsung SGH-D820, Samsung SGH-D800, Samsung SGH-D600, Samsung SGH-D520, Samsung SGH-D500, Samsung SGH-E900, Samsung SGH-E850, Samsung SGH-E800, Samsung SGH-E770, Samsung SGH-E760, Samsung SGH-E730, Samsung SGH-E720, Samsung SGH-E700, Samsung SGH-E620, Samsung SGH-E610, Samsung SGH-E570, Samsung SGH-E530, Samsung SGH-E500, Samsung SGH-E380, Samsung SGH-E370, Samsung SGH-E350, Samsung SGH-E250, Samsung SGH-X830, Samsung SGH-X820, Samsung SGH-X800, Samsung SGH-X700, Samsung SGH-X670, Samsung SGH-X660, Samsung SGH-X640\n- Siemens BenQ: BenQ Siemens EL71, BenQ Siemens E61 , BenQ Siemens S88, BenQ Siemens S68, BenQ Siemens E61 , Siemens S75, Siemens SL75, Siemens CX75, Siemens CF75, Siemens C75, Siemens M75, Siemens ME75, Siemens CX70, Siemens M65, Siemens M56, Siemens S65, Siemens SL65, Siemens SK65, Siemens CX65, Siemens S56, Siemens S55, Siemens M55, Siemens SL55\nand more...\n\nChanges in Version 7.0.1 build 2699 | 20.12.07:\n* New Features:\no added support for the Nokia N95, Nokia N81, Nokia N76, Nokia E51, Nokia 6110 Navigator and Nokia 7600 Express Music\no now 2 addresses are supported for the S60 devices (Nxx, Exx and others)\no Filter for the calendar:\n- now working when synchronising with Tobit David\n- now working for appointments in the phone that should not be synchronized to the PC.\no improved serching connected handsets\n* Fixed bugs/solved problems:\no fixed problem: Analyzer did not work with Nokia phones\no fixed bug: work phone number was not stored in the Sony Ericsson K850i\no fixed problem: special filter was not stored for Outlook contactfolders with long paths.\no fixed problem with tabs in the description or subject in appointments and tasks\no fixed problem sending SMS with the Nokia 6230i (and others)\no fixed problem (re)installing the AddIn for Outlook 2007\no fixed problem with finding the COM port for paired Bluetooth devices\no fixed crash at the end of the setup wizard\n\nHomepage - http://www.mobile-master.com\n\nSize: 14.2 MB\n\n\n\n\n\n\n\nNorman Malware Cleaner: Built 2007/12/21\n\nAnti-VirusNorman Malware Cleaner is a Norman program utility that may be used to detect and remove specific malicious software (malware).\nNote that it should not be used as a substitute for running normal proactive antivirus protection, but rather as a reactive tool to handle systems that are already infected.\n\nBy downloading and running the program below it will clean an infected system completely:\n* kill running processes that are infected\n* remove infections from disk (including ActiveX components and browser helper objects)\n* restore correct registry values\n* remove references created by malware in hosts file\n* remove windows firewall rules for malicious programs\n\nNorman Malware Cleaner covers cleaning of all known variants of the following families up to (2007.09.24) :\n* Agent\n* Bagle\n* Blaster\n* BZub\n* Cimuz\n* Dloader\n* Dumaru\n* Feebs\n* Haxdoor\n* JS/Small\n* Lovgate\n* Mitglied\n* Mydoom\n* Mytob\n* Navipromo\n* Netsky\n* Newdotnet\n* OnlineGames\n* Renos\n* Rootkit\n* Sasser\n* Sdbot\n* Sircam\n* Small.KI\n* Smalltroj\n* Sober\n* Sobig\n* Spyaxe\n* Spybot\n* Spywad\n* Startpage\n* Stration\n* Swen\n* Tibs\n* Yaha\n* Zafi\n* Zlob\n* Zotob\n\nNote:\n- To give Norman Malware Cleaner the best working conditions possible, we recommend that you start the computer in Safe mode before running the program. To do this, tap the F8 key on your keyboard during startup, before Windows starts, and select Safe mode from the menu that appears.\n- Pressing the F8 key at just the right time may be a little difficult (after the firmware POST process completes, but before Windows displays graphical output). If the F8 method does not work, repeat the procedure, but press the F8 key more quickly, or press it several times.\n- On some (older) computers, the F8 key method may not work. In these Windows versions you may also configure your computer to start in Safe mode through the System Configuration Utility (msconfig).\n- In some cases Norman Malware Cleaner may require that you restart the computer to completely remove an infection\n\nSupported operating systems are: Windows 98, Me, NT, 2000, XP and 2003\n\nHomepage - http://www.norman.com/Virus/Virus_removal_tools/en\n\nSize: 13.9 MB\n\n\n\n\n\nPicturesToExe creates slide show in stand-alone EXE file. \n\nUsing a clean-looking, intuitive interface, you select pictures from any combination of folders on your system. Then press the Create button. In just moments, you&amp;#039;ve produced an .exe file that, when run, displays the images with the options you&amp;#039;ve selected. Options let you specify automatic or manual sequencing, pick the timer interval, adjust font and background properties, and decide whether you want the sequence to run once and terminate or to repeat continuously. You can also add a MIDI, or MP3-based soundtrack and associate each picture with a .wav file. PicturesToExe is a nice way to share your favorite images with others in a compact, easy-to-email form. Ability to create AVI video file.\n\nPicturesToExe has simple and intuitive interface, so creating of a slide show is very easy. All you have to do is choose some images and add music. Slide show has sharp and clear picture and very smooth playback of Pan/Zoom effects you have ever seen. You can place objects (images, text labels with drop shadow) on a slide and customize complex animation. Moreover, it&amp;#039;s possible to use various cinematographic transition effects between slides, add background music, add sound file and text comment to a slide.\n\nAnd ability to exactly synchronize show of slides to music. VideoBuilder in PicturesToExe Deluxe edition allows quickly and easily burn DVD-Video disc with your slide shows. You can adjust DVD menu and customize many parameters of your DVD disc. Ability to create AVI video file. If it is necessary, you can protect your slide show by password and assign expiration date. No additional programs (including PicturesToExe itself) are needed to run resulting slide showÃ¢??only produced stand-alone EXE file. Slide show will work under Windows XP, Vista, 95, 98, Me, 2000, 2003. Burned DVD-Video disc in PicturesToExe Deluxe can be played on any DVD player, on PC or Mac.\n\nMAIN FEATURES:\nÃ¢?Â¢ PicturesToExe produces single EXE file which contains all pictures and music.\nÃ¢?Â¢ PicturesToExe Deluxe can burn DVD-Video disc with slide shows.\nÃ¢?Â¢ Pan/Zoom/Rotate effects for images.\nÃ¢?Â¢ Powerful editor of objects of a slide with possibility to adjust complex animation.\nÃ¢?Â¢ You can add buttons or text labels with drop shadow and glow to a slide.\nÃ¢?Â¢ Cinematographic transition effects between slides.\nÃ¢?Â¢ Show of slides can be exactly synchronized to music on the timeline with waveform.\nÃ¢?Â¢ Slide show has built-in player for high quality MP3 and OGG playback. Also it supports WMA, WAV and MIDI music playback.\nÃ¢?Â¢ Ability to create screen saver.\nÃ¢?Â¢ Navigation bar in slide show.\nÃ¢?Â¢ Easy solution for creating of greeting cards.\nÃ¢?Â¢ Ability to create AVI video file.\nÃ¢?Â¢ Support of multi-select and visual drag-n-drop between file panel and Slide list.\nÃ¢?Â¢ Support of sound comments to slides (MP3, OGG, WMA or WAV).\nÃ¢?Â¢ Images can be in JPEG, PNG, GIF or BMP format.\nÃ¢?Â¢ Ability to rotate pictures (lossless algorithm).\nÃ¢?Â¢ Every slide can be individually customized with own time, effect, background, and etc.\nÃ¢?Â¢ And a number of another features.\nÃ¢?Â¢ Support for English, Russian, Netherlands, Italian, Swedish, Hungarian, Slovenian, German, Catalan, French, Spanish, Arabic, Romanian, Chinese, Brazilian Portuguese, Danish, Czech, Ukrainian, Slovak languages.\n\nKey features of version 5:\nÃ¢?Â¢ New graphical engine which uses all power of your video card.\nÃ¢?Â¢ Burning of DVD-Video disc with your slide shows right in PicturesToExe.\nÃ¢?Â¢ Pan/Zoom/Rotate effects in real-time with high quality. Sharp picture and smooth animation. Special option Ã¢??Perspective correction for ZoomÃ¢?? to reach natural looking zooming.\nÃ¢?Â¢ Completely new editor of objects and animation. Proportionally scalable objects. Improved Text objects, drop shadow or glow can be applied for any object. Seven skins for Button objects.\nÃ¢?Â¢ New cool view of Navigation bar.\nÃ¢?Â¢ Tree of folders in main window of PicturesToExe.\nÃ¢?Â¢ Improved quality of music player.\nÃ¢?Â¢ Improved support of Windows Vista (in main program of PicturesToExe).\nÃ¢?Â¢ PNG images support.\n\nChanges in PicturesToExe Deluxe 5.1:\n+ VideoBuilder:\n&gt; Encoding of DVD-Video disc (and AVI) works in 2-4 times faster now due to optimization for dual-core CPUs and using of hardware acceleration for video post-processing (if modern video card installed). Exactly same video quality as in previous version.\n&gt; You can choose a number of items per page in DVD menu.\n&gt; MPEG2 files can be added to a project. For example, you can encode your slideshow(s) to MPEG2 video file(s) and then use it again in new projects without re-encoding of it again.\n&gt; Music for DVD menu (with &quot;Fade in&quot; and &quot;Fade out&quot; parameters).\n&gt; Color adjusting of DVD menu (Hue, Saturation and Lightness). It allows very quickly modify a view of DVD menu and find your own individual style.\n&gt; Adjusting of a background image parameters (Tile, Stretch, Fit)\n&gt; Support of all kinds of AVI files imported to a project (including AVS video file scripts).\n&gt; A new tab in the Project options window - &quot;Program&quot; (customizing of priority mode for encoding and temp folder).\n* More exact calculation of required disc space.\n\n+ &quot;Wait for a key press to show next slide&quot; option in Project options available again. You can overwrite global value in a properties of a slide.\n+ Adjusting of colors for Text/Button objects in hover and pressed states activated again.\n+ PicturesToExe starts much faster now.\n+ Timeline window remembers current position of a cursor and selected keypoint when you switch between Timeline window and main window of PicturesToExe.\n+ Added support of multi-line default text comment for all slides (Project options | Comments tab).\n+ Visual improvements in Music tab of Project options and Customize slide windows. You can visually re-arrange files in the playlist.\n+ Slide list shows a hint what to do, when no slides added.\n\n+ Added &quot;Offset&quot; parameter to &quot;Advanced hour hand&quot; effect in properties of a slide.\n+ Small improvements in Create AVI file window (it displays filename of created AVI and browse button to open folder with AVI).\n* Fixed bug with too large controls in Drop shadow dialog when 120 dpi graphics mode used.\n* Fixed bug of previous versions when you couldn&amp;#039;t create AVI file and &quot;catCantCreateFile&quot; error message occured. It happened when name of project contained a dot symbol (&quot;Project 1.1&quot; for example).\n\n* Fixed bug of previous versions with renaming of image filename in Slide list if there are two or more slides with same image file.\n* Fixed bug of previous versions when mouse wheel didn&amp;#039;t work in Open/Save dialogs.\n* Fixed bug of previous versions when &quot;Load last used project&quot; option in fact always was enabled.\n\nHomepage - http://www.wnsoft.com\n\nSize: 4.35 MBPicturesToExe Deluxe 5.1\n\n\n\n\n\n\nAbexo Registry Cleaner 5.3\n\nRegistryAbexo Registry Cleaner is a utility software to make your computer run smoother and faster, achieving this by cleaning and compressing the registry. By time Windows registry gathers a lot of invalid entries that cause system complications and slow down your computer significantly. Included in Abexo Registry Cleaner is a registry defragmenter also called compressor which removes the empty spaces after a cleanup and thereby reduces registry size. Registry defragmentation increases the performance of your computer dramatically. Supported platforms: Windows Vista and Windows XP.\n\nAbexo Registry Cleaner Features:\n- Disk cleanup\n- Scan disk\n- Disk defrag\n- Registry backup\n- Registry cleanup\n- Registry defrag\n- Computer shutdown/restart\n\nRegistry is a database where Windows and programs store their data. When data changes i.e. you delete a file, the registry doesn&amp;#039;t remove the invalid data, thus in this case a reference to a non-existent file remains in the registry.\nAs the registry gets filled with invalid data, Windows and programs consume more system resources to search the database for any data. Therefore your computer gets slower and slower. Last but not least, passing invalid data to Windows programs can cause severe system complications resulting in system crash, hang and malfunction.\n\nAfter a registry cleanup the invalid entries leave empty spaces, which means the size of the registry remains unchanged. It goes without saying that loading a small registry is faster than a big one.\n\nThe Auto run feature is a one-click registry backup, registry cleanup and registry defrag.\n\nFurthermore if you own a copy of Abexo defragmenter you can configure them to work together. Just click a button and go to bed. All of the following tasks will be performed while you are asleep.\n\nChanges in Abexo Registry Cleaner 5.3:\n- Scanning of System Services added.\n\nHomepage - http://www.abexo.com/registry-cleaner.htm\n\nSize: 1.18 MB \n\n\n\n\n\nTo iPod Converter 4.78\n\nVideo EditorsConvert almost all kinds of video files to ipod !\nÃ¢?Â¢ Let your Apple iPod much super and advanced! With the help of plato video to ipod converter, it can easily make it true!\nÃ¢?Â¢ Do you thinking enjoy the visual feast on your ipod anywherer, anytime? Now, with Plato Video to iPod Converter, you could convert any of your funny and wonderful video clips to your ipod.\nÃ¢?Â¢ It enables you to convert almost all kinds of video files such as rm, divx, xvid, avi, wmv, asf, mpg, mpeg, vob, mov, qt, vcd, svcd to Apple iPod video (mp4) format.\n\nYou could convert batch video files with Plato Video to iPod Converter. It is convenient for you to add several video files one time to convert, and then just go to sleep, it could automatically shutdown your computer after all conversion done !!\n\nKey Features :\n1).Support wmv , asf to ipod mp4.\n2).Support mov , qt to ipod mp4.\n3).Support rm , rmvb to ipod mp4.\n4).Support mpg , mpeg , vob ,vcd , svcd to ipod mp4.\n5).Support avi , divx , xvid to ipod mp4.\n6).conversion speed is 2 times of the playback speed.\n7).Set the start position and end position of source file to convert.\n8).Support many predefined profile setting for ipod video.\n9).Customize the quality of output ipod video.\n10).Automatically shutdown your computer after long time conversion , such as for big files conversion at midnight.\n11).Automatically add output ipod files to iTunes after conversion.\n12).Best quality: the support for the latest industry standards ensures the videos you create with best picture and audio quality.\n13).User-friendly interface : without any complicated settings.\n14).Hardware auto-detect: Automatically detect your hardware and decide the best converting speed.\n15).Its preview display enables you to observe the whole converting process, making the Converting time enjoyable!\n\nHomepage - http://www.dvdtompegx.com\n\nSize: 3.99 MB\n\nRegistration Codes:\n-\n6776188A7CCD1F486776188A7CCD1F48538AA43CA05A1BF0\n-\n8A97855E2CCA2F208A97855E2CCA2F204027D80A00BE629A\n-\n4E1FBAF0976B549E4E1FBAF0976B549E1BF61C8B8B03B7D7\n-\n33529F50BF54294D33529F50BF54294D6362E920327130CE\n-\nBE88548BFF3A50CABE88548BFF3A50CA61A54B39346DDDC3\n-\n34FCDAB285561B1634FCDAB285561B161A218D0B25C24364\n-\n5A0434963E7B782B5A0434963E7B782B348AE3AD8A292E0A\n-\n736898BFE6409DA1736898BFE6409DA11800E66B01854E43\n-\n151F092CED0ED548151F092CED0ED548952DDD030F2AB713\n-\n54F007C343EE83E754F007C343EE83E764BB9B9E055F3429\n-\n\n\n\n\n\n\nAshampoo Photo Commander 6.00\nGraphics &amp; DesignAshampoo Photo Commander 6 is a perfect example of a new generation of programs that are genuinely intuitive easy to use. It makes organizing your pictures and getting them to look great as simple as pressing the button on your camera. YouÃ¢??ll save time, have a barrel of fun and your friends and family will be really impressed.\nAshampoo Photo Commander makes managing and organizing even the largest collections of digital photos easy. Its powerful integrated photo editing tools make it a one-stop solution. Instead of switching to a graphics application you can do all your adjustments and enhancements directly in the organizer. Remove the red-eye effect, adjust colors, contrast, hue and many other parameters, resize, crop, rotate, add a wide range of special effects and more. All without leaving the program.\n\nAlmost everything is done with a couple of clicks Ã¢?? adding picture frames, correcting your photos, making greeting cards, collages and slide shows, sharing your pictures on CDs/DVDs or your website and much more.\nAshampoo Photo Commander 6 is a one-stop solution. You organize and view your photo collection, edit and enhance your photos and use creative editing and project tools all in a single program. And it also manages your audio and video files!\n\nNew highlights in version 6:\nIntuitive new interface\nThe new tabbed ribbon-style interface puts all the functions at your fingertips. You can always see what functions are available and everything is so self-explanatory you will probably never need to consult the manual. Includes elegant Vista-style buttons in Windows XP and very cool transition effects when you switch between photos in full-screen editing mode.\nQuick-Fix Tools\nAll the common operations you need to perform on your photos are now available in the Quick-Fix Tools tab: One-click color and contrast optimization, photo straightening (if the camera wasnÃ¢??t straight), red eye correction, cropping, rotating and more Ã¢?? all with a couple of clicks.\nEditable objects\nYou can add additional photos, text boxes, geometric shapes, arrows and more to your images. And now you can save them in a new file format that lets you go back again edit the objects again later without having to start right from the beginning.\nPowerful new screen capture functions\nThe screen capture function now uses the latest technology from AshampooÃ¢??s award-winning Magical Snap 2. It includes full support for capturing Windows VistaÃ¢??s transparent Aero Glass effects and capturing on multi-monitor systems. You can also capture free-style shapes as well as the standard rectangular objects and fixed shapes, and apply cool drop shadow, edge and shape effects automatically while capturing.\nQuick 5-star rating system\nEvery photo displayed in the Organizer has a line of 5 stars under it. To rate your photo you just click for between 1 and 5 stars. You can then sort by star ratings to quickly find your favorite photos.\nEmailing multiple photos and movies\nNow you can email multiple photos in a single PDF file, which many people like a lot more than mails with a whole list of separate photo attachments. You can also press Ctrl+E to mail one or more photos or other media files quickly. And of course Photo Commander will resize your pictures for you to make them easier to send.\n\nNew features at a glance:\n* New interface: Ribbon style tabbed interface with Vista style buttons on XP\n* Adjustable dialog box sizes: user settings are saved\n* Quick-Fix Tools: All common operations with a couple of clicks\n* Editable objects: New file format stores objects you add on editable layers\n* Unlimited Undo/Redo: For all changes\n* Browser EXIF mode: Shows all the photoÃ¢??s EXIF/IPTC information directly under the picture\n* Quick 5-star ratings: Just click to rate photos with 1-5 stars, supports sorting by rating\n* Enhanced thumbnails: Better looking thumbnails stored with lossless compression\n* Enhanced searching: In subfolders and by EXIF and IPTC data\n* New screen capture technology: Capture free-style shapes, Vista Aero Glass effects and more, full multi-monitor support\n* Improved Wizards: Wizards guide you through procedures with a clearer, even more intuitive layout\n* Email to PDF: Mail multiple images in a single PDF file\n* Batch optimization: Apply the new One-Click Optimization tool to all your selected photos in one quick and easy process\n* Slide shows with audio: Add more than one audio track to your slide shows\n* JPEG-XR support: The program supports the new Windows HD Photo format\n\nOther great Photo Commander 6 features:\n* CD/DVD burning tools: Burn your photos and slide shows directly to CDs and DVDs without leaving the program.\n* Batch processing: Convert multiple photos to other formats and apply effects, all at the same time. Saves hours of tedious work.\n* Slide shows: On your computer or on CDs and DVDs, with cool transitions and background music.\n* Web albums: Post your best photos on your website, just choose them, generate the album and upload.\n* Save as PDF: Save single or multiple photos to PDF files.\n* Full-screen editing: Edit photos on your entire screen with the unique Mouse Tools.\n* Merge images: Merge multiple images to create special effects.\n* Collages, calendars, greeting cards, photo frames, collages: Build them all from your photos with a few clicks Ã¢?? being creative has never been so easy!\n* Plugins: Extend the programÃ¢??s capabilities with plugins Ã¢?? for example for special file formats.\n* Skins: Change the programÃ¢??s appearance with downloadable skins or design your own.\n* Audio and video: Manage and view all your media files and create playlists.\n* Supported formats: Over 60 photo, video and audio formats are supported, including transparent JPEG the new Windows HD Photo format.\n\nHomepage - http://www.ashampoo.com\n\nSize: 17.4 MB","torrent":{"xt":"urn:btih:f2dd1bd103092fc4bea179321376bb76e4ed3f2c","amp;dn":"Useful+programs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2dd1bd103092fc4bea179321376bb76e4ed3f2c","infoHashBuffer":{"type":"Buffer","data":[242,221,27,209,3,9,47,196,190,161,121,50,19,118,187,118,228,237,63,44]},"announce":[],"urlList":[]}}