{"title":"JET_LI_The_One","uid":4010442,"size":4700069888,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f366c063520014696883f266513c90cdb2044387&amp;dn=JET_LI_The_One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"w4lt3r","files":49,"time":1202056552,"description":"he One (2001) &lt;a href=&quot; http://www.imdb.com/title/tt0267804/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0267804/&lt;/a&gt; \n Genre: Action / Sci-Fi / Thriller\nStoryline: A sheriff's deputy fights an alternate universe version of himself who grows stronger with each alternate self he kills.\n Tagline: What if there was a killer traveling through parallel worlds...and he looked just like you? [taken from the trailer]\n Runtime: 87 min \nRating: [**********] 5.4/10 (15,016 votes)\nFull DVD with extras, subs and languages\n\nPhotos : http://www.imdb.com/gallery/ss/0267804/s_1105_25.jpg.html?path=gallery&amp;path_key=0267804&amp;seq=29\n\nThere is not one universe, but there are many, which is a multiverse. Supposing you are just one person, there are many other versions of you in the other universes, there are ways to travel, but only a police agency,MVA, can travel only for police procedures. Gabriel Yulaw (Jet Li)is a former MVA agent, who killed another version of himself in self-defense. It made the other versions of him stronger. When Yulaw found out about this, he became power-hungry killing the 122 other versions for two years. After killing Lawless (also played by Jet)and getting captured by his former partner Roedecker (Delroy Lindo) and a new MVA agent Funsch (Jason Statham) Yulaw managed to escape the prison and is trying to kill his last target, Gabe Law (also played by Jet) who is a police officer. He is also at Yulaw's strength. Roedecker and Funsch now have to arrest Yulaw before he can kill Gabe. There is a possibility that the universe could die or make Yulaw invinible. After encountering Yulaw for the first time, Gabe thought that it was his split personality, but it wasn't. Will Gabe be able to confront Yulaw before or after Yulaw ruins his life? Written by Zero 88\n\nThis movie postulates what if there is more than one universe. And that all of these universes are held together by one single stream of energy and that energy is equally distributed to every living in each universe and if one of these beings die, that energy is reallocated equally to each other surviving member. And with each allocation, a person becomes stronger. Now one universe has master the ability of crossing into another universe, and a man named Shulaw who believes that if he can kill all of his counterparts, he will become invincible, but there are those who believe that it might have detrimental effects, so try and stop him. Unfortunately, he just has one more person to kill, Gabe Law, but the officers follow Shulaw but Shulaw has committed some crimes and Gabe is accused and is wanted. But Gabe discovers that he has changed and only wants to kill Shulaw not realizing what could happen. Written by &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;4133223271757070013820292e2e6f222e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n","torrent":{"xt":"urn:btih:f366c063520014696883f266513c90cdb2044387","amp;dn":"JET_LI_The_One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f366c063520014696883f266513c90cdb2044387","infoHashBuffer":{"type":"Buffer","data":[243,102,192,99,82,0,20,105,104,131,242,102,81,60,144,205,178,4,67,135]},"announce":[],"urlList":[]}}