{"title":"Sir Salman Rushdie - Shalimar the Clown  (15 CDs unabridged)","uid":3994541,"size":522912116,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f3cfed62607993d69c0d96f730d9a7ea4753f92b&amp;dn=Sir+Salman+Rushdie+-+Shalimar+the+Clown++%2815+CDs+unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"paulyearwig","files":284,"time":1201242546,"description":"General Information\n===================\nTitle: Shalimar the Clown\nAuthor: Salman Rushdie\nRead By: Aasif Mandvi\nCopyright: 2005\nAudiobook Copyright: 2005\nGenre: Mystery &amp; Thrillers\nPublisher: Recorded Books LLC\nAbridged: No\n\nOriginal Media Information\n==========================\nISBN: 978-1-4193-3999-8 or 1-4193-3999-0\nMedia: CD\nNumber: 15\nSource: Rental\nCondition: Good\n\nBook Description\n================\nEditorial Reviews\n\nFrom Bookmarks Magazine\nLike some of the post-9/11 literature, Shalimar delves deep into the \nroots of terrorism and explores the turmoil generated by different faiths \nand cultures attempting to coexist. How can nations, Rushdie asks, go \nfrom near-peaceful ethnic and religious acceptance to violent conflict \nwithin a mere generation? Critics agree that Rushdie has brilliantly \nunraveled the construction of terrorists: some of them fight for ideas; \nothers fight to fulfill vows or, if they are men, to reclaim their wives.-\n\nShalimar is at once a political thriller, folk tale, slapstick comedy, \nwartime adventure, and work of science fiction, pop culture, and magical \nrealism. In shimmering (if sometimes baroque) language, Rushdie invokes \nclever satire and imaginative wordplay. Yet, despite its diverse genres \nand styles, Shalimar is, at heart, a story of love, honor, and revenge?and \nthe global consequences of such emotions and actions. Critics particularly \npraised Rushdie?s shocking description of Shalimar?s transformation \ninto a cold-blooded Islamic terrorist, from his participation in training \ncamps to forced humiliations before Taliban leaders. Similarly, wrenching \ndescriptions of pre- and post-war Kashmir, his homage to a paradise \nlost, confirm Rushdie?s brilliant powers of observation and keen social \ninsight. Some reviewers felt that some characters lacked psychological \ndepth or complete plausibility, or were too allegorical, but most described \nShalimar as convincingly real?too real, even.\n\nIn the 21st century, Shalimar?s painful, terrifying themes are both \nfantastical and devastatingly real. To evidence otherwise, Rushdie offers \na note of cautious optimism: people can work out their differences if \nleft alone by ideologues or fanatics. Shalimar provides a timely, ultimately \nidealistic, message for our times.\n\nCopyright Â© 2004 Phillips &amp; Nelson Media, Inc. --This text refers to \nthe Hardcover edition.\n\nFrom AudioFile\nThe former U.S. Ambassador to India is murdered outside his daughter&amp;#039;s \napartment in Los Angeles by an assassin known as Shalimar the Clown. \nThe political situation in Kashmir and the betrayal of Shalimar by his \nHindu bride are mirrored in interconnected narratives. Aasif Mandvi \nrises to the challenge of a complicated story that travels the globe. \nLocations include Strasbourg under the rule of the Germans in WWII, \nFrance, India, Pakistan, and the U.S. Who knows if every accent is perfect? \nThe important thing is that the myriad characters of varying nationalities \nown plausible, distinctive voices. Particularly effective is Mandvi&amp;#039;s \nemotional understatement in the face of the escalating violence. A.B. \nÂ© AudioFile 2006, Portland, Maine-- Copyright Â© AudioFile, Portland, \nMaine --This text refers to an out of print or unavailable edition of \nthis title.\n\n\n\nDownload Description\nSalman Rushdie is the author of 8 previous novels ? Grimus, Midnight?s \nChildren (for which he won the Booker Prize and the ?Booker of Bookers?), \nShame, The Satanic Verses, Haroun and the Sea of Stories, The Moor?s \nLast Sigh, The Ground Beneath Her Feet and Fury ? and one collection \nof short stories, East, West. He has also published 5 works of non-fiction: \nThe Jaguar Smile, Imaginary Homelands, The Wizard of Oz, Mirrorwork \nand Step Across This Line.\n","torrent":{"xt":"urn:btih:f3cfed62607993d69c0d96f730d9a7ea4753f92b","amp;dn":"Sir+Salman+Rushdie+-+Shalimar+the+Clown++%2815+CDs+unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3cfed62607993d69c0d96f730d9a7ea4753f92b","infoHashBuffer":{"type":"Buffer","data":[243,207,237,98,96,121,147,214,156,13,150,247,48,217,167,234,71,83,249,43]},"announce":[],"urlList":[]}}