{"title":"Choronzon - In My Own Life Blood I Exult To Float","uid":4008950,"size":95837114,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f437a51d21345532d3597c999e236f3fa81e4cba&amp;dn=Choronzon+-+In+My+Own+Life+Blood+I+Exult+To+Float&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gamalost418","files":5,"time":1201976128,"description":"Year: 1991\n\nSongs:\n\n1: In My Own Life Blood I Exult To Float\n2: Cruel and Epicene\n3: Agony and Bliss\n4: Visitation of Dread Desire\n5: Crossing the Abyss\n\nLength: 00:49:54\n\nThis is some very primitive and even more lysergic Black Metal. The final track sounds like tape manipulation done in a parking garage. In comparison to the only publicly traded demo they did before they signed to Nocturnal Art, this is much rawer and less &quot;experimental&quot; and more experimental, if you know what I mean. For the later demo they seemed to be trying to pull in Throbbing Gristle fans with their electronics and cutup arrangements.\n\nI&amp;#039;m guessing that at this point Mr. Williams was just starting to consider making this project something for the market, though the vocals still sound more like incantions from rituals and do not necessarily make for the best rockin&amp;#039; entertainment.\n\nA very hard tape to get a hold of, as he was still only giving copies to persons present at the event itself. The individual who passed this on to me told me it was recorded in a network of underground caverns under the city of Providence, RI. As with anything that has to do with Choronzon and P. Emerson Williams, there&amp;#039;s no way to verify the stories.\n\nMy source for this recording refuses to tell me who he is or how he obtained it. Apparently some were injured in the process of the performance and were considered to be chosen and special for the experience. I used to run into people from this strange cult a lot back in the nineties, but they must all be locked away by now.\n","torrent":{"xt":"urn:btih:f437a51d21345532d3597c999e236f3fa81e4cba","amp;dn":"Choronzon+-+In+My+Own+Life+Blood+I+Exult+To+Float","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f437a51d21345532d3597c999e236f3fa81e4cba","infoHashBuffer":{"type":"Buffer","data":[244,55,165,29,33,52,85,50,211,89,124,153,158,35,111,63,168,30,76,186]},"announce":[],"urlList":[]}}