{"title":"Roy Buchanan ~ When A Guitar Plays The Blues","uid":4008112,"size":104261655,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f44e1558484ab87ded0349238206324d55ffc717&amp;dn=Roy+Buchanan+%7E+When+A+Guitar+Plays+The+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":13,"time":1201940593,"description":"This is my favourite Buchanan after &quot;You&amp;#039;re Not Alone&quot;.\nI was sold on &quot;Guitar Plays the Blues&quot; &amp; &quot;Godzilla&quot; on first passing when the album came out &amp; still play these tracks often. YouTube has some fine videos from this album.\nI&amp;#039;ve included scanned cover art &amp; mp3&amp;#039;s at 256bps.\n\nCan anything really compare to Roy Buchanan&amp;#039;s early output? This one was produced later in his life... when he was a seasoned professional...and it definately has it&amp;#039;s gems. Alligator records should be applauded for letting cut loose and do his thing, a great testimonial to his style and abilities. I used to sneak in (fake ID) and watch Roy at &quot;My Mother&amp;#039;s Place&quot; in Washington DC, I wonder if &quot;My Fathers Place&quot; in NYC were of the same ownership? Those were nights I will never forget. If you are into the DC music scene of the early 70&amp;#039;s, check out some Danny Gatton records as well...between Roy and Danny, DC auido philes were greatly blessed with these two fine talents.\n\nA fine album by Roy Buchanan, a guitar hero who never quite made the big time. Exquisitely produced by Alligator Records, Roy gets a chance to stretch out and show what he can do with a guitar. On the opening track, he tries to make his guitar sound like a church organ, it seems, and he almost pulls it off ! The one thing about Roy Buchanan is his singing voice : it just doesn&amp;#039;t do the trick. Often he just seems to say the lyrics as opposed to sing them. He brings in a couple of guests to sing on a few tracks, and these add further to the unease about Roy&amp;#039;s own voice. His guitar playing is tops, though ! Listen to tracks like &quot;Mrs. Pressure&quot; (his former guitar teacher ! What&amp;#039;s in a name ?) or &quot;Sneaking Godzilla through the alley&quot; (great title !) and be convinced. This is the first of 3 albums Roy made for Alligator, and they seemed to set him on the track to greater recognition. Sadly, though, all came to an end when he was arrested one night for being drunk in a public place and took his own life in his cell. A sad end to a great guitar-player&amp;#039;s life.\n\nThis album is up here already, but Pirates have had problems downloading.\n\nthanks for you support &amp; please keep seeding","torrent":{"xt":"urn:btih:f44e1558484ab87ded0349238206324d55ffc717","amp;dn":"Roy+Buchanan+%7E+When+A+Guitar+Plays+The+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44e1558484ab87ded0349238206324d55ffc717","infoHashBuffer":{"type":"Buffer","data":[244,78,21,88,72,74,184,125,237,3,73,35,130,6,50,77,85,255,199,23]},"announce":[],"urlList":[]}}