{"title":"Curved Air - Phantasmagoria (Great progressive rock (hope u like","uid":3362661,"size":67894096,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f4aa1799ada7f0157e391d1f5a38652d8fae8360&amp;dn=Curved+Air+-+Phantasmagoria+%28Great+progressive+rock+%28hope+u+like&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"peternotpan","files":19,"time":1122642091,"description":"+ covers (really good quality of back front and inside booklets). It isn't my rip but ripped using EAC (with good settings).\nSee log inside and use cue to burn it. There is &quot;Melinda (More or Less)&quot; on this album and one big plz... Can someone tell me what about is that song, what is the main thought of lyric? Many thnx for that. If someone could translate it into polish.... PLZ!\nAnd many thnxx..:)\n\nTrack listing\n1. Marie Antoinette (6:20)\n2. Melinda (More or Less) (3:25)\n3. Not quite the Same (3:44)\n4. Cheetah (3:33)\n5. Ultra-Vivaldi (2:22)\n6. Phantasmagoria (3:15)\n7. Whose Shoulder are You Looking Over Anyway? (3:24)\n8. Over and Above (8:36)\n9. One a Ghost, Alway a Ghost (4:25)\n\nTotal Time: 39:04\n\n\nLine-up\n- Sonja Kristina / vocals, acoustic guitar\n- Francis Monkman / guitars, keyboards, Tubular Bells, Gong, percussion\n- Florian Pilkington-Miksa / drums, percussion\n- Darryl Way / violin, keyboards, vocals, Tubular Bells, Mellotron on &quot;Marie Antoinette&quot;\n- Mike Wedgwood / bass, acoustic guitar, vocals\n\nGuest Musicians:\n- Annie Stewart / flute on &quot;Melinda (More or Less)&quot;\n- Crispian Steele-Perkins / trumpet\n- Paul Cosh / trumpet\n- Jim Watson / trumpet\n- George Parnaby / trumpet\n- Chris Pyne / trombone\n- Alan Gout / trombone\n- David Purser / trombone\n- Steve Saunders / trombone\n- Frank Ricotti / xylophone, vibes\n- Mal Linwood-Ross / percussion\n- Colin Caldwell / percussion\n- Jean Akers / percussion and featuring\n- Doris the Cheetah / Grand Finale on Cheetah\n\nSome mixed reviews from progarchives:\n\n&gt;&gt;&gt;  If the rest of this album was up to the standard of the first two tracks, this would be a four or five star review, unfortunately it isn?t. ?Marie Antoinette?, a well written tribute to the French heroine, is a beautiful haunting piece, with Somja?s voice slightly echoed over a soft atmospheric backing. ?Melinda, more or less? is a very melodic softer piece, simple in its structure, but wonderfully effective.\nThe remaining tracks on side one are pleasant, if uninspired, including another reworking of ?Vivaldi? (from ?Air conditioning?), this time speeded up, and played on keyboards. Side 2 is disappointing and indulgent. For example, ?Whose shoulder..? consists entirely of Sonja Kristina?s voice processed into what is quite simply a mess.\nWorth picking up for the first two tracks, but disappointing thereafter.&lt;&lt;&lt;\n\n&gt;&gt;&gt;  Well, nobody here gave this wonderful album the grade that it deserves, so here I am. Despite some mistakes (Whose Shoulder...), the record is perfect: Over And Above it&amp;acute;s probably Curved Air&amp;acute;s best track, sounding a little like Gentle Giant, basically because of the vibraphone. Not Quite The Same it&amp;acute;s a good 6/8 time signature, but nobody gives the credit... Cheetah it&amp;acute;s Darril Way&amp;acute;s best moment ever, even better than the acclaimed Vivaldi, from the first album. Marie Antoinette it&amp;acute;s another classic of the band, really great.Plus, you can hear Sonja&amp;acute;s beautiful voice on Melinda (More Or Less) and Francis&amp;acute;s neurotic sinths on Ultra Vivaldi. Probably the first Curved Air album to spend your god money on. Believe-me!&lt;&lt;&lt;\n\n&gt;&gt;&gt;  Again another pleasant album from a pleasant band , isn't it pleasant? This is one of their better effort but don't approach the master of the times. Curved Air was always seen as second line of prog bands and this their finer album gets only three stars, so I think that ev eruthing has been said. Worth a spin and if you like Camel or B J H with female vocals (quite fine , really ), you should enjoy this.&lt;&lt;&lt;\n\n&gt;&gt;&gt;  Amazing followup to &quot;Second Album&quot;, the final album with (more or less) the original lineup (the band had trouble keeping bassists), the difference here, of course, the band was on to their third bassist, Mike Wedgwood (later of CARAVAN, for the albums &quot;Cunning Stunts&quot; and &quot;Blind Dog at St. Dunstans&quot;). A more elaborate album than before thanks to the inclusion of strings and horns, not to mention a jazzier album. &lt;&lt;&lt;\n\n","torrent":{"xt":"urn:btih:f4aa1799ada7f0157e391d1f5a38652d8fae8360","amp;dn":"Curved+Air+-+Phantasmagoria+%28Great+progressive+rock+%28hope+u+like","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4aa1799ada7f0157e391d1f5a38652d8fae8360","infoHashBuffer":{"type":"Buffer","data":[244,170,23,153,173,167,240,21,126,57,29,31,90,56,101,45,143,174,131,96]},"announce":[],"urlList":[]}}