{"title":"The Siege of Western Civizilation DVD","uid":3930671,"size":2369263616,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f4edbb7af1ebdcc84638283a595644d511f59e80&amp;dn=The+Siege+of+Western+Civizilation+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"plasmaview","files":8,"time":1197444264,"description":"In this remarkable and educational 42-minute presentation Herb Meyer - former Reagan Administration senior Intelligence official, former associate editor of Fortune, author of several books and dozens of published essays about politics and economics - talks seriously about what is really going on out there:\n\n\n\n    *      What lies behind the terrorists&amp;#039; attacks on our country?\n\n    *      How does radical Islam really threaten our survival?\n\n    *      Why was &quot;regime change&quot; necessary in Iraq and Afghanistan, and what else must we do to stop terrorism once and for all?\n\n    *      Within the US itself, are we really in the midst of a &quot;Second Civil War&quot; that will decide whether our traditional culture survives?\n\n    *      Why are the Judeo-Christian concepts of marriage and family under such ferocious attack?\n\n    *      Is this &quot;Second Civil War&quot; the reason our politics has become so partisan, so divisive, and so vicious?\n\n    *      What are the economic threats that loom before us?\n\n    *      How will the demographic crises in Western Europe and Japan hurt us?\n\n    *      Can our economy survive its own demographic problems?\n\n    *      Most of all, what must we do to defend civilization itself, and to assure that our children understand what Western Civilization really is and why it&amp;#039;s worth defending? \n\n\n\nIn The Siege of Western Civilization, Herb Meyer answers these questions, and more, in a lively, informal way.  He &quot;connects the dots&quot; so that you can see how today&amp;#039;s fast-breaking developments at home and abroad form a pattern you can understand -- and make sense of - as you follow the news.","torrent":{"xt":"urn:btih:f4edbb7af1ebdcc84638283a595644d511f59e80","amp;dn":"The+Siege+of+Western+Civizilation+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4edbb7af1ebdcc84638283a595644d511f59e80","infoHashBuffer":{"type":"Buffer","data":[244,237,187,122,241,235,220,200,70,56,40,58,89,86,68,213,17,245,158,128]},"announce":[],"urlList":[]}}