{"title":"PES4 update by Wolf Hook","uid":3360650,"size":747172781,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:f55dad79febb37cd209e235e6dc979fda17ed950&amp;dn=PES4+update+by+Wolf+Hook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WolfHook","files":1,"time":1122248940,"description":"24/07/2005\n\nWolf_Hook's Update V1.1\n----------------------------------------------------------------------\nBeen a while since I released a patch and I wanted to do another one that focused more on the correct details of the players.\n\nI have downloaded and tweaked PLF's option file from evo-web which fit so well into my original game. All transfers are done as of 24.07.2005. You will not be able to carry over the updated stats into the master league I am afraid, I had trouble inserting the para_we8 bin file. It would change all the in game text to white so you couldn't see anything.\n\nI have updated quite a few kits and you will see them as you play it.\n\nI would love to write a detailed read me file of everything that has been changed but I have lost track, I have done this patch in the best part of 20 hours with about 5 hours sleep inbetween.\n\nIncluded:\n\nLot more &quot;interesting&quot; background images for male fans.\nNew intro video.\nSome new music added.\nPlenty of new kits.\nUpdated transfers.\nUpdated player stats.\nNew commentary.\nWEmainacs Dream Teams (kits designed by myself)\n\nPlus everything else you would expect in a patch for Pro Evolution Soccer 4.\n\nA few people had a problem with my last patch when the game loaded, they kept on getting an error message &quot;0_text.afs Corrupt&quot;. The way to solve this apparantly was to have the correct default.xbe file.\n\nI have included everything in this folder.\n\nInstall Instructions:\nThose of you in the know will be able to play with this patch in minutes using FTP (File Transfer Protocol) or you can insert the lot into an .iso file and burn to DVD.\n\nI have created some &quot;adult&quot; themed backgrounds so be warned, I would advise backing up your e_text.afs file just in case you don't want to use my background images.\n\nYou can transfer the option file via Xbox Saves Manager as it is the easiest way. The zip archive &quot;4b4e0022&quot; is the option file.\n\nIf you are a newbie and do not know what you are doing then you ask questions at &quot;http://wemaniacs.com/smf/index.php&quot; on the &quot;Newbie questions&quot; thread, this is where I hang out these days.\n\nAlso once you have finished and are looking at the game, go watch the credits. :-)\n----------------------------------------------------------------------\n\nCredit to those who deserve it.\n\nwww.wemaniacs.com","torrent":{"xt":"urn:btih:f55dad79febb37cd209e235e6dc979fda17ed950","amp;dn":"PES4+update+by+Wolf+Hook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f55dad79febb37cd209e235e6dc979fda17ed950","infoHashBuffer":{"type":"Buffer","data":[245,93,173,121,254,187,55,205,32,158,35,94,109,201,121,253,161,126,217,80]},"announce":[],"urlList":[]}}