{"title":"The Secret Adventures of Jules Verne 3-4 [retrOtv]","uid":4006879,"size":734994479,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f63a2ec103692460741cd4b2ddc75895ee1b96ff&amp;dn=The+Secret+Adventures+of+Jules+Verne+3-4+%5BretrOtv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":3,"time":1201879434,"description":"The Secret Adventures of Jules Verne (2000) episodes 3-4 of 22\n\n3. Rockets of the Dead   7/2/2000\nWhen Rebecca investigates the murder of a British envoy in London, she must go undercover as an actress to attract Angelo Rimini, Duke of Carpathia and the prime suspect. He becomes infatuated with her and seemingly vice versa, and spirits her off to Carpathia. Phileas is none too thrilled with the Secret Service endangering her and pursues. The three of them evade vampires and Phileas and Jules make it to the castle and see Rebecca falling under Rimini&amp;#039;s sway.  Rimini&amp;#039;s plan  is to take over the world with an army of rocket-powered vampires. \n  Guest star: Jonathan Coy (Sir Jonathan Chatsworth) , Patrick Duffy (Duke Angelo Rimini), Derrick Damon Reeve (Cloaked Man), R.D. Reid (Landlord), David Schaap (Lord Pontetract), Maeiusz Sibigia (Captain of the Guard), Brett Watson (Soldier)\n\n4. The Cardinal&amp;#039;s Design  7/9/2000\nRebecca is trying to decypher a secret code created by Jules&amp;#039; old friend Alexandre Dumas. It turns out he was a spy at one time, and created the code and hid the transcription code in his novel The Three Musketeers. Dumas is up to his ears in debt, in part because he is trying to build a machine, the Phoenix, based on designs by Cardinal Richelieu from 200 years earlier. Passepartout inadvertently activates the time machine, and the four go back 200 years. As they step out to investigate, Passepartout inadvertently activates the time machine again, leaving the other three stranded. Worse, Rebecca is mistaken for an assassin and taken before Richelieu, who wants her to kill the king... (to be continued...)\n  Guest star: John Rhys-Davies (Alexandre Dumas), Rene Auberjonois (Cavois), Christopher Heyerdahl (D&amp;#039;Artagnan), Chip Chuipka (Aramis), Melissa Curzi (Camille/17th Century), Steve Griffith (Lavaler), Jean Guimond (Referre), Greg Kramer (Louis&amp;#039; Fool), Nathalie Matteau (Paris Whore/17th Century), Michael Scherer (Hangman), Michael Praed (Cardinal Richelieu)\n\nLeave a comment if you&amp;#039;d like to see more of this series! :)","torrent":{"xt":"urn:btih:f63a2ec103692460741cd4b2ddc75895ee1b96ff","amp;dn":"The+Secret+Adventures+of+Jules+Verne+3-4+%5BretrOtv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f63a2ec103692460741cd4b2ddc75895ee1b96ff","infoHashBuffer":{"type":"Buffer","data":[246,58,46,193,3,105,36,96,116,28,212,178,221,199,88,149,238,27,150,255]},"announce":[],"urlList":[]}}