{"title":"V/A - [2007] CMYK (Sutemos020)","uid":3993984,"size":176960864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f8c9e9066f1df61b5f06feb50b72ef5de3cc53a3&amp;dn=V%2FA+-+%5B2007%5D+CMYK+%28Sutemos020%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vocode","files":22,"time":1201207855,"description":"Music: V/A\nAlbum: CMYK\nCompiled By: Sutemos &amp; Walkman\nRelease date: 2008 01 24\nLabel: Sutemos.net\nCatalogue #: Sutemos020\nArtworks: Tmp, Sutemos.net\n\nThis release is protected with Creative Commons Attribution-NonCommercial-NoDerivs 2.5 License.\n\nCMYK is our 20th anniversary release which we have decided to dedicate to four Lithuanian artists. Although we have little scruple saying that we don&amp;#039;t really like working with our fellow-countrymen but Sutemos.net are all about music so we can&amp;#039;t simply ignore some really flawless creations. Because they are simply too good to demonstrate our code on them.\n\nCMYK are four colours. When they are joined together you get one colour - that is white. Each artist of this release is as unique as this spectrum. Each of them has their own mood, their own style and brand. I think some of you will find part of this stuff already familiar but we also know that you will find some new sounds for the joy of your ear couple. Or maybe you&amp;#039;ll just recover your memory...\n\nLadies and gentlmen, we know present you their majesty CMYK artistst! First is Sraunus who has already released his debut single on Signorafranca net label. Grad_U is also already a bit common for the electronic scene - his two singles were released on Signorafranca and widely acclaimed Kyoto net label (it&amp;#039;s a pity it was shut down...)\n\nAt the end of 2007 Mikrokristal has made his debut on Tomas Jirku label River Of Recordings with his &quot;Little Latent Forest Friends&quot; album. And the last but not least is Zulusas. Thi artist makes his very debut on his release. But that does not make tracks full his technical groove any less interesting!","torrent":{"xt":"urn:btih:f8c9e9066f1df61b5f06feb50b72ef5de3cc53a3","amp;dn":"V%2FA+-+%5B2007%5D+CMYK+%28Sutemos020%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8c9e9066f1df61b5f06feb50b72ef5de3cc53a3","infoHashBuffer":{"type":"Buffer","data":[248,201,233,6,111,29,246,27,95,6,254,181,11,114,239,93,227,204,83,163]},"announce":[],"urlList":[]}}