{"title":"Flash Renamer 5.3 incl. Serial","uid":3891915,"size":2103914,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f8d0da18bd0097d35bf163283cd108937f789315&amp;dn=Flash+Renamer+5.3+incl.+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mmx64","files":2,"time":1195071340,"description":"Great utility, highly recommended!\n\n\n----------------------------------------------------\n\n &lt;a href=&quot;\nhttp://www.rlvision.com/flashren/about.asp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rlvision.com/flashren/about.asp&lt;/a&gt;\n\n\nEverybody has a lot of files these days, be it digital photos, music, movies or documents. Keeping them tidy and organized is important so you can easily find what you are looking for.\n\nThink about how much time you spend managing your files, fiddling with their filenames to make them fit your personal taste. What if it could be done automatically? Now you can. With Flash Renamer your renaming days are gone!\n\nFlash Renamer contains everything you need to master your filenames. Transform them from unreadable junk to perfectly manicured filenames in a matter of seconds!\n\t\nFeatures:\n\n  o  Fast as lightning! Renames thousands of files in a matter of seconds.\n\n  o  Set casing to UPPER CASE, lower case or First Letter Case.\n\n  o  Rename Mp3s using their tags and properties.\n\n  o  Read data from jpeg Exif tags. Excellent for digital camera users.\n\n  o  Search and replace strings within filenames.\n\n  o  Set or clear file attributes, such as &amp;#039;read only&amp;#039; and &amp;#039;hidden&amp;#039;.\n\n  o  Set date &amp; time using various sources, such as image Exif date.\n\n  o  Add or Remove strings from specified positions.\n\n  o  Add counters to files that are related, such as photo sessions.\n\n  o  Extract meta-data from media, such as width/height and duration.\n\n  o  Realtime preview shows the new filenames before you rename.\n\n  o  Works on files, folder and sub-folders.\n\n  o  Easily manage your photo collection by using the thumbnail mode.\n\n  o  Add zeros to numbers to make files sort correctly in every situation.\n\n  o  Re-order parts within filenames the way you want it.\n\n  o  Supports Wildcards &amp; Regular Expressions.\n\n  o  Context menus allows you to quickly launch FR when you need it.\n\n\nWhether you&amp;#039;re a photographer, webmaster, a power downloader, or simply just have a lot of files, you will love the power Flash Renamer brings you. And you will love it even more afterwards, when you realize how much time and effort it has saved you. Let Flash Renamer do the work for you. You&amp;#039;ll never rename more that one file by hand ever again, that&amp;#039;s a promise!\n","torrent":{"xt":"urn:btih:f8d0da18bd0097d35bf163283cd108937f789315","amp;dn":"Flash+Renamer+5.3+incl.+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8d0da18bd0097d35bf163283cd108937f789315","infoHashBuffer":{"type":"Buffer","data":[248,208,218,24,189,0,151,211,91,241,99,40,60,209,8,147,127,120,147,21]},"announce":[],"urlList":[]}}