{"title":"Recovery Refill Lite","uid":3752656,"size":3375427,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:f8d2967192ccce3e1cefb00f444a9e6da49e929d&amp;dn=Recovery+Refill+Lite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"misterpirate","files":1,"time":1185392769,"description":"Recovery Refill Lite from Recovery Class--\n\nThe Recovery Refill from Recovery Class is a DVD collection of over 1 gig of samples containing an extensive library of high quality, versatile, and easy to navigate sounds. Specially designed for Reason users. Here\\&amp;#039;s what you get:\n\nGUITARSOUNDS- Massive collection of rock, soul, and funk guitar licks, combined with chords, phrases and riffs designed for use with Reason. Over 100mb of samples for the NN19 sampler, plus over 50 variable tempo Dr. Rex files. This is the ultimate guitar sample collection for Hip-Hop and Electronic use.\n\nREAL KEYS- WURLITZER 206 ELECTRIC PIANO, FENDER RHODES, REAL PIANO, and CLAVINET. Real instruments with several multisamples per note (more or less depending on the sensitivity of instrument). Includes patches for the NNXT sampler.\n\nTRON MACHINE- Srings, Choir, Brass, Flute. Includes a patch for the NN19 sampler.\n\nVINTAGE 70\\&amp;#039;S LOOPS- Taken from studio collections of the early 70\\&amp;#039;s, originally intented as bumpers and music beds for radio and broadcast use. Recoverysounds has chosen the best and carefully converted them into royalty free, variable tempo Dr. Rex files for the most flexibility and loopabability in your original music. 100 in all!\n\nDRUM SAMPLES- Various Acoustic and Electronic drum samples as wave files for the NN19 sampler. Various Dr. Rex Drum loops.\n\nSITAR SAMPLES- Real sitar samples! Includes NN19 patch!\n\nAll this and more including harp samples, ambient sounds and abstract loops. Taken taken from the best professional and vintage gear, and recorded with high quality microphones and preamps. Minimum processing was used to give you the most versatility for your use!","torrent":{"xt":"urn:btih:f8d2967192ccce3e1cefb00f444a9e6da49e929d","amp;dn":"Recovery+Refill+Lite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8d2967192ccce3e1cefb00f444a9e6da49e929d","infoHashBuffer":{"type":"Buffer","data":[248,210,150,113,146,204,206,62,28,239,176,15,68,74,158,109,164,158,146,157]},"announce":[],"urlList":[]}}