{"title":"[Kung Fu] Wong Fei Hung Ji Yi Naam, Yi Dong Ji Keung (1992) - DV","uid":3776169,"size":416595136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f9767dbc3d0634805ed1c3f92500b5c91e4ee660&amp;dn=%5BKung+Fu%5D+Wong+Fei+Hung+Ji+Yi+Naam%2C+Yi+Dong+Ji+Keung+%281992%29+-+DV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":7,"time":1187370949,"description":"Wong Fei Hung Ji Yi Naam: Yi Dong Ji Keung aka Once Upon A Time In China 2 (1992)\n\nAvg. Rating:  \t\n  4.8 / 5 (based on 6 ratings).\n\nPlot:\tThis first sequel to the acclaimed Once Upon a Time in China continues the adventures of Legendary Martial Artist Wong Fei Hung, played once again by Jet Li.\n\nOverview:\tThis first sequel to the acclaimed Once Upon a Time in China continues the adventures of Legendary Martial Artist Wong Fei Hung, played once again by Jet Li. In Canton for an east-west medical conference, Fei Hung befriends Dr. Sun Yat-Sen, who is secretly leading a movement to overthrow the emperor and create a Chinese republic. Unfortunately, Fei Hung also runs afoul of the White Lotus sect, a fanatic cult bent on purging all things foreign from China. When the White Lotus burn down the foreign language school, Fei Hung takes its displaced students to the British consulate after being rebuffed by commander Lan (Donnie Yen) at city hall. Lan wants Sun Yat-Sen, and so he stands by while the White Lotus attack the consulate where Dr. Sun is hiding, so that he can seize him and his list of followers. Needless to say, this eventually forces a confrontation with Wong Fei Hung, who must also deal with the White Lotus and their leader, the seemingly invincible Priest Kung.\n\nCast: \tJet Li Lian-Jie  ||  Max Mok Siu-Chung  ||  Rosamund Kwan Chi-Lam  ||  Donnie Yen Ji-Dan  ||  David Chiang (Keung Dai-Wai)  ||  Zhang Tie Lin  ||  Paul Fonoroff \n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:f9767dbc3d0634805ed1c3f92500b5c91e4ee660","amp;dn":"%5BKung+Fu%5D+Wong+Fei+Hung+Ji+Yi+Naam%2C+Yi+Dong+Ji+Keung+%281992%29+-+DV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9767dbc3d0634805ed1c3f92500b5c91e4ee660","infoHashBuffer":{"type":"Buffer","data":[249,118,125,188,61,6,52,128,94,209,195,249,37,0,181,201,30,78,230,96]},"announce":[],"urlList":[]}}