{"title":"Torrents Piratebayxxx2 estado de emergencia[Spanish].DvDSCreen","uid":3356012,"size":727638016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f9e2c9430d96bc0963369259773d82da0a76e311&amp;dn=Torrents+Piratebayxxx2+estado+de+emergencia%5BSpanish%5D.DvDSCreen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jaj","files":1,"time":1121301591,"description":"\nMontaje by jaj\n\nFICHA DE LA PELICULA:\n\nDirecci&amp;oacute;n: Lee Tamahori.\nPa&amp;iacute;s: USA.\nA&amp;ntilde;o: 2005.\nDuraci&amp;oacute;n: 104 min.\nG&amp;eacute;nero: Acci&amp;oacute;n, thriller.\nInterpretaci&amp;oacute;n: Ice Cube (XXX/Darius Stone), Samuel L. Jackson (Augustus Gibbons), Willem Dafoe (George Deckert), Scott Speedman (Agente Kyle Steele), Peter Strauss (Presidente Sanford), Sunny Mabrey (Charlie Mayweather), Nona Gaye (Lola), Xzibit (Zeke), Michael Roof (Toby Lee Shavers), John G. Connolly (Teniente Alabama &quot;Bama&quot; Cobb).\nGui&amp;oacute;n: Simon Kinberg.\nProducci&amp;oacute;n: Neal H. Moritz y Arne L. Schmidt.\nM&amp;uacute;sica: Marco Beltrami.\nFotograf&amp;iacute;a: David Tattersall.\nMontaje: Mark Goldblatt, Todd E. Miller y Steven Rosenblum.\nDise&amp;ntilde;o de producci&amp;oacute;n: Gavin Bocquet.\nDirecci&amp;oacute;n art&amp;iacute;stica: Bradford Ricker.\nVestuario: Sanja Milkovic Hays.\nEstreno en USA: 29 Abril 2005.\nEstreno en Espa&amp;ntilde;a: 29 Abril 2005.\n\nSINOPSIS:\n\nEn &quot;XXX 2: Estado de emergencia&quot;, Samuel L. Jackson vuelve como Augustus Gibbons, el miembro de la Agencia de Seguridad Nacional. En esta nueva entrega, Gibbons y el experto en artefactos Toby Lee Shavers (Michael Roof), escapan a un ataque mortal por parte de unos asaltantes desconocidos en el centro de operaciones encubierto XXX de la ASN. Gibbons sospecha que los asesinos han sido enviados por una facci&amp;oacute;n secreta radical dentro del gobierno y busca a un nuevo agente para eliminarlos. Esta vez, Gibbons quiere un militar bien entrenado y con experiencia y que d&amp;eacute; credibilidad en la calle, que pueda descubrir la fuente de la insurgencia desde dentro. Desafor-tunadamente, el hombre perfecto para el trabajo est&amp;aacute; en prisi&amp;oacute;n. &amp;Eacute;l es Darius Stone (Ice Cube) y actualmente se encuentra bajo vigi-lancia en una prisi&amp;oacute;n militar por golpear a un superior. Gibbons ayu-da a Stone en la peligrosa fuga de la prisi&amp;oacute;n y le convence para convertirse en el nuevo agente XXX que detenga el asalto al gobier-no de los Estados Unidos. En la Casa Blanca, el presidente de centro Sanford (Peter Strauss) discute con el Secretario de Defen-sa radical, George Deckert (Willem Dafoe), un ex general con lazos pasados con Gibbons y con Stone. Cuando Deckert asiste a una gala del gobierno, Stone interroga a un camarero con la esperanza de conseguir alguna informaci&amp;oacute;n de alguien de dentro. En la fiesta conoce a Charlie Mayweather (Sunny Mabrey), la hija de un oficial del Gabinete que al final ayuda a Stone a escapar. Stone tambi&amp;eacute;n se ve perseguido por el agente del FBI Kyle Steele (Scott Speed-man), un ambicioso advenedizo que considera a Stone un peligroso criminal. Para ayudarle en su misi&amp;oacute;n, Stone va a buscar a dos vie-jos amigos de sus d&amp;iacute;as en las calles de Washington D.C: Lola (No-na Gaye), una ex ladrona de coches que ahora lleva un concesio-nario de gama alta, y Zeke (Xzibit), un atracador de tiendas con ac-ceso a armas y personal. Cuando el presidente Sanford es secues-trado tras un asalto al Capitolio de los Estados Unidos, Stone y sus compatriotas deben unirse para enfrentarse a una de las mayo-res amenazas de todos los tiempos a la libertad de los Estados Unidos, liderada por un enemigo con lo &amp;uacute;ltimo en poder de disparo moderno y hombres a su disposici&amp;oacute;n.\n","torrent":{"xt":"urn:btih:f9e2c9430d96bc0963369259773d82da0a76e311","amp;dn":"Torrents+Piratebayxxx2+estado+de+emergencia%5BSpanish%5D.DvDSCreen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9e2c9430d96bc0963369259773d82da0a76e311","infoHashBuffer":{"type":"Buffer","data":[249,226,201,67,13,150,188,9,99,54,146,89,119,61,130,218,10,118,227,17]},"announce":[],"urlList":[]}}