{"title":"DVD.Profiler.v2.4.0.868.MULTILINGUAL.WinALL.Incl.Keymaker-CORE","uid":3365597,"size":4316484,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fa9a755b959a4a7a6864f5b23c496c314249176a&amp;dn=DVD.Profiler.v2.4.0.868.MULTILINGUAL.WinALL.Incl.Keymaker-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"j4gg3r","files":1,"time":1123225194,"description":"DVD Profiler's unique combination of desktop application and online data access sets it apart from competing alternatives.\n\nWith a database of over 150,000 DVDs created by an enormous community of dedicated users worldwide, DVD Profiler has become the most complete, most accurate, and most compelling source of DVD information anywhere.\n\nKeep track of your entire DVD collection\n\nDVD Profiler can manage any size collection. Extensive data collection, filtering and reporting features specific to DVD, and unique to DVD Profiler. \nPut simply, DVD Profiler is the best way to track your DVD addiction!\n\nOne-step entry\n\nJust enter the UPC from the DVD case and DVD Profiler does the rest!\nIf you have a DVD-ROM drive, its even easier. Put the DVD in the drive and let DVD Profiler recognize it automatically.\nDon't have the UPC yet? Add it by title using powerful search criteria.\n\nPeruse your collection with ease\n\nExtensive, powerful search and filter functions let you find what you're looking for fast\nOr, browse your collection by actor or director through a filmography customized to your collection.\nDVD Profiler's complete and customizable reporting engine let's you take your collection from the computer to the coffee table in style. Check the downloads section for a huge repository of user-created reports.\n\nKeep track of loaned DVDs\n\nBuild a database of users who borrow (or just watch) your DVDs and track lendings and/or viewings.\nMonitor loan status, view and edit history by user or DVD, and generate reports to keep tabs on your collection.\n\n... And much, much more!\n\nPowerful price search engine \nCharts and graphs to track trends \nCustomizable HTML skin capability \nParental control \nPersonal &quot;My Profiler&quot; site to let others browse your colletion \nSeamless integration with DVD Profiler Pocket (future product)","torrent":{"xt":"urn:btih:fa9a755b959a4a7a6864f5b23c496c314249176a","amp;dn":"DVD.Profiler.v2.4.0.868.MULTILINGUAL.WinALL.Incl.Keymaker-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa9a755b959a4a7a6864f5b23c496c314249176a","infoHashBuffer":{"type":"Buffer","data":[250,154,117,91,149,154,74,122,104,100,245,178,60,73,108,49,66,73,23,106]},"announce":[],"urlList":[]}}