{"title":"Bob_Melamede_interview.mp3","uid":3369680,"size":48306518,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fbc59a95a2850e132eb0ec3434024f2cf62d0496&amp;dn=Bob_Melamede_interview.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"braskamin","files":1,"time":1124028179,"description":"Interresting stuff about cannabinoids (marijuana-like com-pounds that our bodies produce)\n\nDr. Melamede\nAlso joining the faculty as Associate Professor and Chair of the Department in the fall 2002 semester was Dr. Bob Melamede. Dr. Melamede received his Ph.D in Biochemistry from City University of New York in 1980. Recently, Dr. Melamede has been Assistant Professor at the University of Vermont and Director of the LCCRO Monoclonal Facility. In addition to his Chair duties, he is teaching Microbiology (Biol 203) and establishing his research laboratory. His research interests center around free radicals: the damage that they produce in DNA, the repair of these damages, the use of phage display technology to make monoclonal antibodies to DNA damage and their repair enzymes, the central role that free radicals play in living systems as explored through the perspective of open system thermodynamics, and the mechanisms by which endogenous cannabinoids (marijuana-like com-pounds that our bodies produce) inhibit free radical based disease states such as cancer, auto-immune diseases, cardiovascular disease and neuronal deterioration.","torrent":{"xt":"urn:btih:fbc59a95a2850e132eb0ec3434024f2cf62d0496","amp;dn":"Bob_Melamede_interview.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbc59a95a2850e132eb0ec3434024f2cf62d0496","infoHashBuffer":{"type":"Buffer","data":[251,197,154,149,162,133,14,19,46,176,236,52,52,2,79,44,246,45,4,150]},"announce":[],"urlList":[]}}