{"title":"PokerManager","uid":4003360,"size":16171128,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fc5c523672a2bcf9b5370c0f4de3ba9985b7175d&amp;dn=PokerManager&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PokerManager","files":1,"time":1201690247,"description":"&quot;The software is made by players and is there for players. We co-operate closely with our partners (poker and casino sites)  to bring you the best product out there, and the software will always be free!&quot;\nConcerned about security?\nWell, you don&amp;#039;t have to be..\nWe are approved by http://www.verisign.com and http://www.hackersafe.com\n\nAfter all, the biggest poker rooms in the world are our partners, Annette Obrestad (WSOPE winner) and 2 EPT winners are part of the team\nTournaments from all the major networks (and some small ones as well)\nOne of the most exiting features is the tournament listing. The concept of listing a lot of tournaments is not new, but there has never been anybody who actually made it work - until now. PokerManager list all the tournaments from the major networks, and according to our records we have over 10 000 daily tournaments in the listing, and by a click of a button, you are sent to the pokerclient that has the tournament of your choice. The software detects if you already have a client for that tournament, and if not we will offer you to download some of our partners clients with the best deals! That&amp;#039;s pretty impressing! \n\nWe think you will find it very easy to search for tournaments of your liking using the standardized tournament lobby and filtering options. We also invite our users to special tournaments that we run inside the poker rooms that are our partners have and sometimes we also invite our users to a free lesson from Annette_15 Obrestad or the 2 EPT winners \n\nAnother cool thing is the huge video archive PokerManager have. \nWe pretty much have every single poker video out there (last time we counted it was 50 000 videos), in 1 big archive! Best of all, the videos plays on demand and with good quality. You don&amp;#039;t have to download any torrents\nOn top of this, we have a poker community that feels like a merge of myspace, facebook, youtube, twitter and what have you: You can stay in touch with your poker friends, write blogs, create your own poker profile, make a shout out\nFree one-stop-shop for poker players. \n\nPokerManager is a utility program for poker players and includes:\nTournaments: It contains a wast interactive list of all the major poker networks tournaments and is updated in real time. \nVideos: PokerManager also contains the world&amp;#039;s largest poker video archive.\nPoker tools: We have developed and are constantly developing new useful tools for our users. Try our advisor that calculates odds on the fly for you!\nPoker calendar: Add your favourite tournaments and get reminded. Never miss a start again!\n\nPoker news: All the latest poker news from Bluff magazine.\nPoker community: Blogs, user-videos/pictures, shout outs, profiles and more. Stay in touch and discuss with new and old poker friends.\nInstant Messenger: Chat with your poker-playing friends without having to worry about Spam messages and annoying x-girlfriends.\nBasically all an online or offline poker player needs to get an overview of the poker universe.","torrent":{"xt":"urn:btih:fc5c523672a2bcf9b5370c0f4de3ba9985b7175d","amp;dn":"PokerManager","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc5c523672a2bcf9b5370c0f4de3ba9985b7175d","infoHashBuffer":{"type":"Buffer","data":[252,92,82,54,114,162,188,249,181,55,12,15,77,227,186,153,133,183,23,93]},"announce":[],"urlList":[]}}