{"title":"Ibiza Live","uid":3769258,"size":572792626,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc6fdc23d3f6c3be0b3305fd39d6c53b70635708&amp;dn=Ibiza+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Orangeman01","files":6,"time":1186789411,"description":"Music : Dance / Disco : MP3/192Kbps\nLIVE MIX FROM GUARANA &amp; BASE BAR, IBIZA. \n\nRecorded live on 08 Aug 2007. Two amazing DJs, jaw clenchingly dance the night away music, fantastic mixing over 5 cds. \nIgnore all the commercial &quot;Ibiza&quot; crap albums that have surfaced as usual eg M.O.S, Euphoria etc Anything that&amp;#039;s studio created. The nearest it&amp;#039;s been to Ibiza is the sound engineer once got a postcard from his granny who went on a SAGA holiday to Santa Ponsa. This is the real deal. DJs Mikael &amp; Yoshi take you on a musical journey that includes downtempo/chillout, baleric, garage, house, classics, funky, electro and trance. A real mix and a true flavour of the Isla Blanco. Good Ibiza DJs never play one style of tune and never is that more evident than here. Listen to them in order as it builds, comes down and the whole process is repeated. CDs Quatro &amp; Cinco are just the dogs and will knock your socks. These tunes are just right for every walk of life, especially good to drive to. If you&amp;#039;re interested DJ Mikael is an 32 yr old Ibizan native, brought up on the sound of Pacha, Space &amp; Cafe Del Mar. His first year of Ibizan clubbing 14 years ago was when Oakenfold, Tenaglia, Alex P, Jose Padillia, Brandon Block &amp; Alex, Tong, Carl Cox were all loving the vibrancy of the scene. DJ Yoshi is a native of Tokyo and is resident in Ichi Ni San. This is his first year in Ibiza and he is a true technical wizard. Works on 3 or 4 decks and has grasped the Ibizan lifestyle with both hands and he claims Ibiza has &quot;taken over his heart&quot;. You must try and catch these guys live! Remember before to criticise, this is all mixed live, no studio mularky from these boys. \n\nPlease Seed \n\nPlease give your feedback &amp; comments (constructive)","torrent":{"xt":"urn:btih:fc6fdc23d3f6c3be0b3305fd39d6c53b70635708","amp;dn":"Ibiza+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc6fdc23d3f6c3be0b3305fd39d6c53b70635708","infoHashBuffer":{"type":"Buffer","data":[252,111,220,35,211,246,195,190,11,51,5,253,57,214,197,59,112,99,87,8]},"announce":[],"urlList":[]}}