{"title":"Total Training for Adobe Photoshop CS3 - Enhancing Digital Photo","uid":3984334,"size":973636348,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd0811b277e4143eb0c1cec56836e3489424e64c&amp;dn=Total+Training+for+Adobe+Photoshop+CS3+-+Enhancing+Digital+Photo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stevyo","files":1,"time":1200737387,"description":"The series begins with an introduction to Adobe Photoshop CS3 and then moves to an overview on how to organize your photos using Adobe Bridge. The lessons examine Photoshop CS3?s many tools including Adobe?s Camera Raw 4, layer alignment, and impressive image correction tools. You?ll learn how to correct various kinds of flaws including color, noise and perspective, plus uncover amazing image effects that are sure to wow even the most advanced Photoshop user.\n\nHighlights\n    * Learn how to utilize the power of Adobe Bridge to import, analyze, and organize your photos.\n    * Understand the camera RAW workflow. Uncover how to convert your files to DNG, how to adjust white balance, exposure, saturation, create magnificent monochromes and even edit your JPEGS and TIFFS non-destructively.\n    * Master some of the industry?s revered retouching techniques. Clone and heal your images, enhance eyes, whiten teeth, smooth skin tones, and reduce wrinkles.\n    * Discover all the image adjustment tools inside Photoshop CS3 including the histogram, adjust levels and curves, brightness and contrast, and shadows and highlights.\n    * Find out how to create image stacks, align and blend your layers and use Photomerge to create seamless eye-popping panoramas.\n","torrent":{"xt":"urn:btih:fd0811b277e4143eb0c1cec56836e3489424e64c","amp;dn":"Total+Training+for+Adobe+Photoshop+CS3+-+Enhancing+Digital+Photo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd0811b277e4143eb0c1cec56836e3489424e64c","infoHashBuffer":{"type":"Buffer","data":[253,8,17,178,119,228,20,62,176,193,206,197,104,54,227,72,148,36,230,76]},"announce":[],"urlList":[]}}