{"title":"Slavery and the Making of America: Seeds of Destruction Ep. 3/4","uid":3982324,"size":734009344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdeec6102619cb419a5308e0f18f29d6aa49c193&amp;dn=Slavery+and+the+Making+of+America%3A+Seeds+of+Destruction+Ep.+3%2F4+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"shunster07","files":1,"time":1200614941,"description":"Slavery and the Making of America: Seeds of Destruction Ep. 3/4 (2005 02) PBS \n \nSLAVERY AND THE MAKING OF AMERICA is a four-part series documenting the history of American slavery from its beginnings in the British colonies to its end in the Southern states and the years of post-Civil War Reconstruction. Drawing on a wealth of recent scholarship, it looks at slavery as an integral part of a developing nation, challenging the long held notion that slavery was exclusively a Southern enterprise. At the same time, by focusing on the remarkable stories of individual slaves, it offers new perspectives on the slave experience and testifies to the active role that Africans and African Americans took in surviving their bondage and shaping their own lives. \n\nDocudrama narrated by Morgan Freeman. \n\t\t\t\t\nEpisode 3: Seeds of Destruction\n\nOne by one the Northern states, led by Vermont in 1777, adopted laws to abolish and phase out slavery. Simultaneously, slavery in the Southern United States entered the period of its greatest expansion. Episode three, which starts at the beginning of the 1800s, examines slavery&amp;#039;s increasing divisiveness in America as the nation develops westward and cotton replaces tobacco as the country&amp;#039;s most valuable crop. \n\nThe episode weaves national events through the personal histories of two African American slaves -- Harriet Jacobs and Louis Hughes -- who not only managed to escape bondage, but also exposed the horrific realities of the slave experience in autobiographical narratives. These and other stories of physical, psychological, and sexual exploitation fed the fires of a reinvigorated abolitionist movement. With a diverse membership comprised.\n\n Men and women, blacks and whites, and led by figures including Frederick Douglass, Sojourner Truth, and Amy Post, abolitionist sentiment gathered strength in the North, contributing to the widening fissure and imminent break-up of the nation.\n\n\n\n\n\nSupport your local PBS Station by making a contribution or by purchasing their DVDs..\n\nBuy new: &lt;a href=&quot; http://www.pbs.org/wnet/slavery/about/buy.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.pbs.org/wnet/slavery/about/buy.html&lt;/a&gt;\n\n\nAvailable to buy used  through Amazon at: www.sonofshun.com (http://amazon.imdb.com/title/tt0472251).\n\nshunster\n","torrent":{"xt":"urn:btih:fdeec6102619cb419a5308e0f18f29d6aa49c193","amp;dn":"Slavery+and+the+Making+of+America%3A+Seeds+of+Destruction+Ep.+3%2F4+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdeec6102619cb419a5308e0f18f29d6aa49c193","infoHashBuffer":{"type":"Buffer","data":[253,238,198,16,38,25,203,65,154,83,8,224,241,143,41,214,170,73,193,147]},"announce":[],"urlList":[]}}