{"title":"The Marx Brothers The Big Store","uid":3995551,"size":4327759872,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fe95f7f1b00cc904b6c0807adf812e6e41b5a0a0&amp;dn=The+Marx+Brothers+The+Big+Store&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"silvia-","files":11,"time":1201293453,"description":"The Big Store , 1941\n\n[img]http://img123.imageshack.us/img123/5980/marxbrothersthebigstoretw6.jpg[/img]\n\nDirector Charles Reisner \nCast Groucho Marx, Chico Marx, Harpo Marx, Tony Martin, Virginia Grey, Margaret Dumont, Douglass Dumbrille, William Tannen \nLength 79 min \nDistributor Warner Home Video \nDiscs 1 \nRegion 2 \nVideo Pal\n1.37:1 , 4:3 \nLanguages Dolby Digital Mono: English, German, Spanish \nSubtitles English, Spanish, French, Italian, German, Portuguese, Danish, Finnish, Hebrew, Swedish, Croatian, Slovakian, Greek, Hungarian, Polish, Turkish, English for deaf people, German for deaf people \n\nSynopsis\n\nIn the last of the Marx Brothers&amp;#039; MGM films, The Big Store, Groucho Marx plays two-bit detective Wolf J. Flywheel, hired by department-store owner Martha Phelps (  \nMargaret Dumont) to act as bodyguard for Martha&amp;#039;s nephew and sole heir, Tommy Rogers (Tony Martin). Crooked store manager Grover (Douglas Dumbrille) is anxious to take over the operation and to hide the fact that he&amp;#039;s been juggling the books; to expedite this, he has arranged several &quot;accidents&quot; to put Tommy out of the way. Despite his monumental ineptitude, Flywheel manages to protect Tommy from harm, with the help of his mute assistant, Wacky (Harpo Marx), and Tommy&amp;#039;s music-teacher pal, Ravelli (Chico Marx). After a series of yawn-provoking complications, Grover tries once more to kill Tommy during a musical reception given in honor of the store&amp;#039;s merger with the Hastings Brothers. When this also fails, he kidnaps Tommy&amp;#039;s girlfriend, Joan (Virginia Grey), a bit of skullduggery captured on film by camera-wielding Ravelli. Grover&amp;#039;s efforts to get his hands on the incriminating photo leads to a zany slapstick chase through the department store, culminating in the villain&amp;#039;s capture (&quot;I told you in the first reel he was a crook,&quot; observes Flywheel) and a happy ending for Tommy and Joan. The opening routine in Groucho&amp;#039;s seedy office and Harpo&amp;#039;s harp solo (in which, through trick photography, he accompanies himself on flute and bass violin) are the only scenes truly worth watching in The Big Store; the big-chase finale is compromised by the fact that the Marx Brothers&amp;#039; stunt doubles do all the work, while the film&amp;#039;s major production number, &quot;Tenement Symphony,&quot; is downright embarrassing. The Marxes were so disappointed with The Big Store that they vowed to quit moviemaking altogether -- only to return to the screen five years later in A Night in Casablanca. ~ Hal Erickson, All Movie Guide\n\n\nOther features\nInteractive Menus, Scene Access, Short film: &quot;Flicker Memories&quot;, Animated film: &quot;Officer Pooch&quot;, Theatrical Trailer, Black And White Film","torrent":{"xt":"urn:btih:fe95f7f1b00cc904b6c0807adf812e6e41b5a0a0","amp;dn":"The+Marx+Brothers+The+Big+Store","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe95f7f1b00cc904b6c0807adf812e6e41b5a0a0","infoHashBuffer":{"type":"Buffer","data":[254,149,247,241,176,12,201,4,182,192,128,122,223,129,46,110,65,181,160,160]},"announce":[],"urlList":[]}}