{"title":"Led Zeppelin 06.28.1972 - Tucson, AZ - Arizona's Smiling","uid":3984034,"size":1003347296,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fee25105d1371d60e463317aa432c7bf29b6534b&amp;dn=Led+Zeppelin+06.28.1972+-+Tucson%2C+AZ+-+Arizona%5C%27s+Smiling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TimD54","files":28,"time":1200718478,"description":"Ladies and gentlemen, this week&amp;#039;s show is none other than 6.28.72 Tucson, Arizona.  That&amp;#039;s right, the Pianoguy show.  For those who were with us in late 2004, you&amp;#039;ll remember a slight disagreement between a fellow from Tucson and, well, the entire FBO membership, concerning this show.  There were several issues that Badgies had with this release, and I&amp;#039;m here to answer a few of them, and leave a few of them mysteries for all time:\n\nFirst of all, there was some controversy concerning the method of transfer - a few Badgies took exception to the master cassettes having been transferred to 7.5 fps reel-to-reel.  Well, me too.  Rob, being quite young in 1972, assumed that the reel-to-reel would sound better and hold up better, not understanding generational losses, etc.  But, what you didn&amp;#039;t know is that the master cassettes also weren&amp;#039;t readily available for a new transfer to be made, and that the source as previously supplied was the best available even to Mr. 88 Keys himself at that time.  It is the source that was provided to any bootlegger who has ever released this show, also.\n\nWell, that&amp;#039;s no longer true.  Rob has graciously gone through the trouble of retrieving the master cassettes from the safe-deposit box 3000 miles from his home and made a by-God direct-to-digital copy of the master tapes for my own use.  I investigated to make sure, and the waveforms of the two shows are just too similar to be anything else.  The transfer is far better this time - done on obviously better equipment, with more volume but not boosted at all, just more of the original was captured.  The channels are balanced and not showing the left-channel bias of the previous source that was typical of reel-to-reel of the day.  Eliminating the generational losses has provided the show with a brightness and clarity where it was previously muddy and dull - the separation of instruments is quite nice now.  Since this show was a damn-fine performance, I was, and still am, thrilled to provide the definitive audio source.\n\nI&amp;#039;ve been nice enough to master this recording via Sonic Foundry, applying just a touch of negative compression, a tiny bit of smoothing filter to take off a touch of the overload, and just a smidgen of EQ to balance the instruments nicely.  I engineered out a cut in the crowd noise between the last track and the encore, but left an audible reminder that it was there.  I took the stop-pops out of the beginning and end of the discs.  Oh, and I added cue stops - the master provided by Rob was so clean that it didn&amp;#039;t even have stops - a true direct transfer.  I assure you this is a very light engineering job - you guys know I&amp;#039;m a purist who would rather keep recordings as close to the master as possible.  I did not boost the volume or apply any other effect than I&amp;#039;ve listed here.\n\nThe new lineage of the show?  \n\nMaster Cassette &gt; CD-R &gt; WAV (via EAC) &gt; Sonic Foundry &gt; WAV &gt; FLAC-8 (via TLH with no need for SBE fixes - all were correct.)\n\nI swear that, to my knowledge, this is absolutely true.\n\nI don&amp;#039;t want to give the impression that this is a miracle recording.  I was working from the same tapes that gave us the previous source, just several generations cleaner.  Don&amp;#039;t expect a five-level jump in quality, for certain.  But my wife, a non-boot-listener and non-Zeppelin-fanatic who can&amp;#039;t even tell different songs apart by their intros and doesn&amp;#039;t hear subtleties even in studio tracks, says she can hear a major difference, enough for me to stand before you today and pitch this show as enough of an upgrade to download it even if you already have it.  Play them side-by-side and it&amp;#039;s obvious which is which.  That&amp;#039;s the only claim I&amp;#039;ll make.\n\nSetlist:\n\nDisc 1\nDrone (0:44)\nImmigrant Song (3:41)\nHeartbreaker (9:04)\nBlack Dog (6:39)\nOver The Hills And Far Away (5:58)\nSince I?ve Been Lovin? You (9:02)\nStairway To Heaven (11:29)\n\nDisc 2\nBron-Y-Aur Stomp (5:43)\nDazed And Confused (28:35)\nWhat Is And What Should Never Be (5:40)\nDancing Days (4:42)\nMoby Dick (17:22)\n\nDisc 3\nWhole Lotta Love - Medley :\nLet That Boy Boogie, Boogie Mama,\nLet?s Have a Party, Stuck On You,\nHello Mary Lou, Goin? Down Slow (29:45 with multiple cue stops) Rock And Roll (5:07)\n\nNext, if there are any encores other than Rock and Roll, I am not aware of them.  Rock and Roll is the encore that was provided on my copy of the masters.  If Rob is keeping any encores to himself, he has his reasons.  He was kind enough to go to the trouble to supply this recording - if he didn&amp;#039;t provide the entire thing, I would be surprised, but I would also give him the benefit of the doubt.  Why have the cassettes shipped 3000 miles just to leave something out?  If he&amp;#039;s keeping anything back, there&amp;#039;s a good reason for it.  There will be no further discussion of this subject.\n\nLastly, as befitting a new release of this magnitude, there is a new title and new TimD-provided artwork available.  The new title of the show is &quot;Arizona&amp;#039;s Smiling,&quot; named after a Plantation near the end of the show.  The artwork follows this theme, as you will see.\n\nI&amp;#039;m making the artwork part of the torrent in PDF form.  Converting it to JPG is, to a printer like myself, not unlike converting WAV to MP3, so I will not be doing it.  If you&amp;#039;re going to print it yourself, you can download a free copy of Acrobat Reader at:\n &lt;a href=&quot;\nhttp://www.adobe.com/products/acrobat/readstep2.html?promoid=BONRM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.adobe.com/products/acrobat/readstep2.html?promoid=BONRM&lt;/a&gt;","torrent":{"xt":"urn:btih:fee25105d1371d60e463317aa432c7bf29b6534b","amp;dn":"Led+Zeppelin+06.28.1972+-+Tucson%2C+AZ+-+Arizona%5C%27s+Smiling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fee25105d1371d60e463317aa432c7bf29b6534b","infoHashBuffer":{"type":"Buffer","data":[254,226,81,5,209,55,29,96,228,99,49,122,164,50,199,191,41,182,83,75]},"announce":[],"urlList":[]}}