{"title":"AQUAMAN Pilot","uid":3754789,"size":367548715,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ff023c7e0f26ccdf9743bbdb58724361b6c154cc&amp;dn=AQUAMAN+Pilot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Triunity","files":2,"time":1185559974,"description":"Pilot Episode Review: \\&quot;Aquaman\\&quot;\n\nBe warned of pilot episode SPOILERS below. And before anyone asks, right now there are currently no plans to air Aquaman, nor has it aired on television up to this point, so you didn\\&amp;#039;t miss anything.\n\nFor the past 6+ months, fans have been curious about where the television adventure of Aquaman would take us. We pounced upon every morsel of information that surfaced. We watched with anticipation when we learned that Justin Hartley replaced Will Toale in the lead role. We felt the excitement when Ving Rhames was added to the cast. And we were curious if lightning would strike twice for creators Alfred Gough and Miles Millar, which gave us Smallville five years ago.\n\nSo after all of these months of anticipation, how does it stand up? Pretty darn well.\n\nRemember the casting breakdowns that leaked onto the Internet a few months back? Well, you can forget them. A lot of people were worried that A.C.\\&amp;#039;s new co-stars of Rachel, Eva, and Tom Curry would be nothing more than clones of Lana Lang, Chloe Sullivan, and Jonathan Kent, respectively. Thankfully, this is not the case. All of these characters are mature, adult, and new - ones I would have savored the opportunity to have seen more of.\n\nFrom the opening shots, Aquaman (apparently the \\&quot;Mercy Reef\\&quot; title didn\\&amp;#039;t make it) is picturesque. Lots of BEAUTIFUL undersea life swimming around; the screen flashes to a sequence taking place 10 years ago. A little boy is flying in a plane with his mother. The little kid, of course, is Arthur Curry (Graham Bentz), and his mother is Atlanna (Daniella Wolters). This early scene gives the viewers a sense of family, as Wolters and Lou Diamond Phillips (who plays A.C.\\&amp;#039;s adoptive father, Tom Curry) have a very clear chemistry. Calamity strikes, and a bright and powerful light emits from what seems to be the Bermuda Triangle. The plane crashes. The young actor chosen to play A.C. at this early age, Bentz, is very convincing in acting scared, as is Wolters as his mother, who really seems like she is looking out for her child. Atlanna instructs her son to escape, and she is taken away - seemingly gone forever.\n\nThe cinematography in this scene looks fantastic. Like the meteor shower in Smallville\\&amp;#039;s premiere, it immediately drags you into a world and then flips it over on its side.\n\nWe then flash forward ten years. We see the now-adult Arthur \\&quot;A.C.\\&quot; Curry (Justin Hartley). It?s difficult to say what catches your eye more ? how great the underwater photography is or how A.C. seems to seamlessly swim with the sea life.  I don?t know if Hartley?s swimming ability was a prerequisite for the casting, but Justin performed swimmingly here. (Okay, sorry, that was a really bad pun)\n\nA.C.\\&amp;#039;s gotten himself into some trouble as he\\&amp;#039;s decided to free some dolphins. He later tells his friend Eva that he thought these sea mammals were \\&quot;calling for him,\\&quot; almost instructing him to do it.\n\nA scene between Lou Diamond Phillips and Justin Hartley soon following A.C.\\&amp;#039;s arrest for his seemingly impulsive act of eco-terrorism was one of the few scenes I thought dragged in the pilot. Phillips had chemistry with the younger A.C. and Atlanna, but this scene was one of the few in the episode that felt \\&quot;off.\\&quot; Perhaps compared to the other characters, Tom Curry is just somewhat boring. It\\&amp;#039;d be curious to see if this would have improved over time ? something that would only happen if the series were picked up.\n\nThe scene soon shifts to a scene between A.C. and his best friend and co-owner of the \\&quot;Old Man and the Sea\\&quot; dive shop, Eva (Amber McDonald). This is one actress that I knew nothing about prior to seeing the pilot, aside from a biography read online. I\\&amp;#039;m happy to say that McDonald NAILED IT. Her interplay with A.C. is the first in which we really see of his sense of humor, and said humor is one of the two best things about the pilot, the other being the fantastic underwater special effects.\n\nLet it be said right here, in case this pilot ever leaks out or is put on DVD and the rest of the world gets to see it: I LOVE EVA. And I think everyone else would too.\n\nThe pilot is not all fun and games. There\\&amp;#039;s something mysterious brewing in the Bermuda Triangle, and it has ties to Atlantis. There\\&amp;#039;s a creepy guy played by Rick Peters (\\&quot;Bob Rickman\\&quot; from Smallville, also \\&quot;Dr. Tom Griffith\\&quot; from Veronica Mars) who you just love to hate. Incidentally, I\\&amp;#039;ve realized I really hate the characters Rick Peters plays. I mean that in the kindest way - he plays characters that just tick me off ? an example of great casting. There are people who disappeared in the Bermuda Triangle years ago who are now resurfacing. There\\&amp;#039;s a mysterious and sexy Siren named Nadia who causes trouble for A.C.. In other words, enough to keep you glued to the television and curious as to what happens next.\n\nVing Rhames is a fellow Atlantean exile named McCaffery.  I must admit, when he first showed, the performance seemed rather flat. Kind of \\&quot;I\\&amp;#039;m bad ass but I don\\&amp;#039;t really have much going on besides being bad ass.\\&quot; But as the episode progressed ? he and A.C. became more like partners and McCaffery took his spot as A.C.\\&amp;#039;s mentor ? his character?s sense of humor started to develop.  By episode\\&amp;#039;s end, you had a Buffy-and-Giles vibe between the two of them. That, friends, is a very big compliment.\n\nFormer Miss America Denise Quinones (who many of you may remember as \\&quot;Andrea Rojas, the Angel of Vengeance\\&quot; in the Smallville episode \\&quot;Vengeance\\&quot; and the online \\&quot;Vengeance Chronicles\\&quot; webisodes) plays an Air Force lieutenant named Rachel Torres. She\\&amp;#039;s dedicated to her work, and an accident, conspicuously near the Bermuda Triangle, introduces her to A.C. for the first time. Her first interactions with A.C. are fun, with snappy dialogue, and she is brought into a storyline involving Rick Peters\\&amp;#039; character I believe would only get more interesting. There\\&amp;#039;s a twist involving Rachel Torres that I will not reveal at this time, just in case by some miracle this ever airs.  I can promise you, though, that it\\&amp;#039;s really, really cool. Lana Lang she isn\\&amp;#039;t. Oh, and the very first sequence with Torres on an airplane while A.C. is in the water, quickly swimming below, is AMAZING.\n\nArthur gets a hint of his true destiny when he is faced with a tragedy - kind of the superheroic \\&quot;great power comes great responsibility\\&quot; thing. He and McCaffery are taken away by Nadia (Adrianne Palicki), and there\\&amp;#039;s an undersea battle that really needs to be seen to fully be appreciated.\n\nMcCaffery gives Arthur a book to celebrate the start of their journeys together - a book containing \\&quot;Henry V, Parts I and II.\\&quot; \\&quot;There\\&amp;#039;s plenty of sex and violence in there to keep you interested,\\&quot; McCaffery says. I have to say the same thing for this pilot. There\\&amp;#039;s plenty to go around for audiences of all types.\n\nYou may notice there\\&amp;#039;s one thing I haven\\&amp;#039;t really commented on yet in this review, and that\\&amp;#039;s the leading man himself: Justin Hartley. The short version? This guy is REALLY GOOD. It\\&amp;#039;s no wonder he\\&amp;#039;s got a legion of fans from Passions, and for his first TV leading role, he nailed it. His casting was a very wise move, and is certainly leagues ahead of Alan Ritchson\\&amp;#039;s overdone portrayal of \\&quot;A.C.\\&quot; in the Season 4 Smallville episode \\&quot;Aqua.\\&quot; I can only hope, should there be no hope for this project in the future, that if the producers of Smallville choose to bring A.C. back, they bring Justin Hartley back to do it. It\\&amp;#039;s a damned shame that we don\\&amp;#039;t get to see him again.\n\nFive years ago, Smallville gave The WB what many may argue was their last really big hit. Aquaman could have easily been the first big hit for the new CW network. I really don\\&amp;#039;t know what executives could have been thinking when they chose to pass on this. The comic book fans would have liked it, those who like looking at pretty people would have liked it, and most of all, it could have been an iconic hit for the network. Look at all of the anticipation the project has had online thus far. I don\\&amp;#039;t see RunawayTV.com anywhere, and I doubt we will ever see such a thing. \n\nOne thing not to miss: Yes, this pilot was very expensive, and you can see that expense on the screen. That might have scared the decision-makers away. It\\&amp;#039;s also a VERY LAME excuse. There were plenty of interesting and fascinating stories that could be told with these characters for a lesser budget. They just had to get out the starting gates with something theatrical. It\\&amp;#039;s really like comparing the Smallville pilot to the series. The series still looks darned good, and I think it would have turned quite a profit in the long run.\n\nJust looking at the fan responses to the leaked pilot episode trailer, and the way that it spread through the internet in just a day, it is clear to me that there\\&amp;#039;s quite a demand for this show. So, I implore any network executive who may dare to take a look - give Aquaman a chance. Air the pilot and see how it does.  Or order a limited run of 6-13 episodes as a test, see how it does. At the very least it\\&amp;#039;d be a very high-selling DVD.\n\nThe pilot episode of Aquaman was written and created by Smallville\\&amp;#039;s executive producers/creators Alfred Gough and Miles Millar and directed by popular Smallville director Greg Beeman, and was the kind of work that routinely got them Best Writer and Director awards in the KryptonSite Awards every year. The script (by Gough and Millar) had the right mix of action, humor, and suspense, and Beeman\\&amp;#039;s direction was on the same high level as his work on some of Smallville\\&amp;#039;s biggest episodes. The project also succeeds in taking the comic book myth and keeping it fresh, new, and exciting for a modern audience. The comic book history of Aquaman is not ignored here in the least; if anything, it is appreciated and embellished. And best of all, it finally put Aquaman in the category of \\&quot;not lame.\\&quot;\n\nIt\\&amp;#039;s not fair that this much time and effort is spent on a GOOD product, with good acting and production values, only to never be seen again. I give \\&quot;Aquaman\\&quot; 9 stars out of 10. The only really bad part? Even if this does get a DVD release, we\\&amp;#039;ll never get to see what happens next...\n\n-------------- \n &lt;a href=&quot;\nhttp://www.aquamantv.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.aquamantv.com/&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:ff023c7e0f26ccdf9743bbdb58724361b6c154cc","amp;dn":"AQUAMAN+Pilot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff023c7e0f26ccdf9743bbdb58724361b6c154cc","infoHashBuffer":{"type":"Buffer","data":[255,2,60,126,15,38,204,223,151,67,187,219,88,114,67,97,182,193,84,204]},"announce":[],"urlList":[]}}